{"country":"BR","name":"Brésil","totalSpots":445,"totalReviews":751,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":66,"lat":-22.6445,"lon":-43.2832,"rating":5,"reviews":4,"wait":12,"signal":null,"lastUsed":"2023-11-21","comments":[{"text":"Bonm lugar para pegar carona a juiz de fora ou BH. Demorou 10 minutos ou menos","date":"2023-11-21","rating":5},{"text":"I followed this instructions on november 2013 and got a ride to Juiz de Fora in less than 10 minutes. Got off the bus just after the Fragoso toll, and walked some meters until I found a good spot next to the road. Really easy.","date":"2013-12-16","rating":5},{"text":"It's easy to get there. The ticket costs 6 R. Lees than 40 min I was there trying.","date":"2013-10-27","rating":5},{"text":"HOW TO GET HERE:\ntake a bus from Central do Brasil (Rio de Janeiro) to Vila Canaã (border of Duque de Caxias), and ask to get off it in the toll.\nthere\\\\'s a Federal Police next to that toll (the cars go too fast there, anyway i got a ride in less than 20minutes. maybe it\\\\'ll be easier to you if you take a bus to Petrópolis and start hitchhiking from there. but the bus is like 10reais more expensive -not too much, but you can drink like 3 bottles of beer with the difference hahah-)\n\nVIDEO HITCH","date":"2011-01-17","rating":5}],"destLat":-20.0497,"destLon":-43.97},{"id":65,"lat":-22.7159,"lon":-43.7185,"rating":5,"reviews":3,"wait":5,"signal":null,"lastUsed":"2023-11-26","comments":[{"text":"Atualização 2023. Aida um lugar ótimo. Demorei 5 mimutos. Ônibus sai da rodoviaria atrâs da rodoviaria central, plataforma 3. 193C","date":"2023-11-26","rating":5},{"text":"Pedágio Viúva Graça (toll plaza). Good spot for hitching to São Paulo. You can get here by bus 193C from the bus terminal next to Central Station (metro Central). Starts from platform D, spot no. 07. Hitch slightly further away from toll booths, there is a bus stop to pull over, restaurant and supermarket.","date":"2014-07-11","rating":5}],"destLat":-23.3502,"destLon":-46.0167},{"id":393,"lat":-23.4229,"lon":-46.3945,"rating":5,"reviews":3,"wait":45,"signal":null,"lastUsed":"2013-07-03","comments":[{"text":"I forget to put the image of google maps: http://goo.gl/maps/kBiR1","date":"2013-07-03","rating":5},{"text":"Forget the SAKAMOTO autostation. FAROL IS THE BEST OPTION! REALLY! It could be the best option, because it's full of truckers, but the guys who work there DOES NOT let HITCHHIKERS TALK WITH THE TRUCKERS. They will tell you that you can only ask for a ride OUTSIDE the station.","date":"2013-07-03","rating":5},{"text":"POSTO FAROL\nThe good old way to hitchhike. Talking with the truck drivers is always a gooid option. And this is the place to do this when leaving São Paulo this way, Lots of truckers stop here before hitting the long road. Just talk with them. Be friendly and everything  will be alright. \n\nTo reach here, get down on ARMENIA metro station and take the bus GUARULHOS VIA DUTRA. Ask for the bus driver to tell you, get down on the Policia Rodoviária Federal and walk to the autostation.","date":"2013-07-03","rating":5}],"destLat":null,"destLon":null},{"id":75,"lat":-23.2214,"lon":-44.7338,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2016-11-21","comments":[{"text":"Great place to hitchhike. I've never spent more than 20 minutes there","date":"2016-11-21","rating":5},{"text":"Just after the roundabout. Was only here for like 5 minutes.","date":"2016-01-18","rating":5}],"destLat":null,"destLon":null},{"id":79,"lat":-23.4502,"lon":-46.5697,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-08-19","comments":[{"text":"Excelente ponto para sair da Grande São Paulo sentido Minas Gerais. Para quem está em São Paulo, é necessário tomar um ônibus no metrô parada inglesa com destino a av. Pedro de Souza Lopes com avenida 13 de maio. os ônibus que fazem esse trajeto são: 163 TRO - Jardim Palmira, 337 - TRO - Jardim Acacio. Os valores das passagens variam de R$ 4,10 a R$ 4,80. Peça pra descer no ultimo ponto da av.13 de maio e caminhe com direção a rua vila ormuz. Referencias: posto 555 e motel clarks. Existe uma sai","date":"2016-08-19","rating":5}],"destLat":null,"destLon":null},{"id":82,"lat":-18.2398,"lon":-43.6245,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-08-04","comments":[{"text":"Fui para esse ponto por indicação do meu host em Diamantina. Numa segunda-feira, por volta de 14h. Peguei carona muito rápido. Em frente a um posto de gasolina, com um quebra-molas logo à frente. Não esperei nem 5 minutos. Estávamos em duas pessoas e com mochilas bem grandes.","date":"2016-08-04","rating":5},{"text":"Avenida João Antunes de Oliveira, 889, em frente ao Posto de Gasolina Real Dávila. Carona sentido Belo Horizonte.","date":"2016-08-04","rating":5}],"destLat":null,"destLon":null},{"id":85,"lat":-12.8246,"lon":-38.2567,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-23","comments":[{"text":"There's a gas station here, Posto Br. It's right before a pedagio or toll. Waited under fifteen minutes on a sunny morning.","date":"2016-07-23","rating":5}],"destLat":null,"destLon":null},{"id":88,"lat":-11.2489,"lon":-37.4354,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-23","comments":[{"text":"Waited under 15 minutes, after refreshing myself at the bathroom and crafting a sign.","date":"2016-07-23","rating":5}],"destLat":null,"destLon":null},{"id":89,"lat":-19.3792,"lon":-40.0666,"rating":5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2016-07-21","comments":[{"text":"Great place for hitchhikers . Because it is an urban area , vehicles pass at low speeds . Place with parking space for small trucks and cars. Good visibility . There is a gas station in the street behind , good to ask for help , if necessary.","date":"2016-07-21","rating":5}],"destLat":null,"destLon":null},{"id":91,"lat":-21.1884,"lon":-43.7517,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Aqui é um ponto bom para conseguir carona, sentido BH. Fica bem na entrada do AABB. \nÉ um lugar um pouco mais distante do centro de Barbacena, então infelizmente não vou saber dizer como chegar aqui de ônibus.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":92,"lat":-21.7001,"lon":-43.4522,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Se você deseja ir para Barbacena ou BH, esse é o ponto. Aqui tem alguns redutores de velocidade, o que pode te ajudar bastante.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":93,"lat":-21.7229,"lon":-43.9244,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Um bom ponto para conseguir carona, sentido Lima Duarte. O fluxo de carros é bom durante os finais de semana. Recomendo tentar na parte da manhã, bem cedo.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":94,"lat":-21.4319,"lon":-43.9736,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Um bom ponto para conseguir carona, sentido Piedade do Rio Grande. Aqui consegui uma carona direto para Ibitipoca.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":95,"lat":-21.2314,"lon":-43.7902,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Aqui é um excelente ponto para conseguir carona, nesse posto, sentido Ibertioga. Se você estiver no terminal rodoviário de Barbacena, pode pegar o ônibus Campolide. A tarifa custa em torno de 3,00.\nEsse ônibus te deixa em Campolide, que fica uns quilômetros a frente. Então fica a seu critério, parar aqui ou mais a frente :)","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":96,"lat":-19.9767,"lon":-43.9474,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Aqui nesse exato ponto é um ótimo ponto pra carona. Muitas pessoas que passam aqui, podem te deixar no trevo para seguir a Ouro Preto. \nÉ possivel conseguir carona indo para Barbacena.\nChegar aqui em bem fácil. É só procurar linhas de ônibus que podem te deixar no BH Shopping.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":97,"lat":-20.0031,"lon":-43.9651,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2016-07-17","comments":[{"text":"Aqui é um bom ponto para conseguir carona, sentido Barbacena/Ouro Preto. Quatro linhas de onibus podem te deixar aqui: 3050, 3055, 3150 e 8151.","date":"2016-07-17","rating":5}],"destLat":null,"destLon":null},{"id":107,"lat":-14.7518,"lon":-39.0617,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"There's a store of sorts where I could get shade and use the tables to write a sign. I'm sure I could have used their bathroom too. People seemed very welcoming.","date":"2016-07-13","rating":5},{"text":"Great for rides to Itacare, no need to go further than the roundabout.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":112,"lat":-14.0438,"lon":-38.9555,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"I spent more time eating and talking to the people than anything else. I believed I would have waited less if there were more cars passing by, It was a dirt road though, so not that many.","date":"2016-07-13","rating":5},{"text":"I stood under a tree right in front of a small convinience store. There was free wifi somehow and the hospitable people from the store offered me food, access to their bathroom and tried to help me get a ride. Excelent to get to Barra Grande.","date":"2016-07-13","rating":5}],"destLat":null,"destLon":null},{"id":114,"lat":-24.9843,"lon":-53.3725,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-01","comments":[{"text":"This is a PRF (police station) where the cars slow down","date":"2016-07-01","rating":5}],"destLat":null,"destLon":null},{"id":120,"lat":-10.0563,"lon":-36.0507,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Uma das praias mais belas do sul Alagoano, também é o lugar perfeito para pegar carona sentido Maceió!\nLogo após a saída do povoado, os veiculos passam lentamente e há um abrigo com sombra para esperar alguém parar. Talvez nem seja necessário, pois em menos de 10 minutos consegui uma carona diretamente para Maceió.","date":"2016-05-18","rating":5}],"destLat":null,"destLon":null},{"id":122,"lat":-10.4078,"lon":-36.4291,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Na sáida da Cidade há um centro comercial e uma maternidade. Passagem obrigatória pra quem segue sentido Maceió. A frente há um posto de Gasolina onde é possível conseguir carona também. Mas se preferir a beira da estrada, esse é o lugar perfeito! Não deixe de conhecer a foz do Rio São Francisco que fica às margens da cidade.","date":"2016-05-18","rating":5}],"destLat":null,"destLon":null},{"id":123,"lat":-10.2849,"lon":-36.5572,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Na saída da cidade há um trevo com o monumento principal. Para chegar lá é necessário pegar um ônibus de linha que circula pela pequena cidade. É possível pegá-lo no centro de Penedo. A tarifa é 2 reais, porém eu pedi uma carona ao motorista que me atendeu prontamente. Há um ponto de táxi com algumas lombadas (quebra-molas, dormentes) onde os veículos passam lentamente.","date":"2016-05-18","rating":5}],"destLat":null,"destLon":null},{"id":124,"lat":-9.9528,"lon":-36.5414,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Trevo da BR101 com a AL110 sentido a cidade Histórica de Penedo. Os veículos circulam devagar pela área e é fácil para sermos vistos.","date":"2016-05-18","rating":5}],"destLat":null,"destLon":null},{"id":127,"lat":-30.0409,"lon":-51.3297,"rating":5,"reviews":2,"wait":45,"signal":null,"lastUsed":"2016-05-15","comments":[{"text":"We decided to stop after the toll, the police station and the gas station to show that we were going to Pelotas. We waited for 40 min, and a truck stopped. The best day is saturday cause many people are going back to their home after a work week.\n\nTo get to this point, we took a bus to near Guaíba (R$ 7 - 2016) and they left us after the police station, in front of the gas station, where there is a bus stop.","date":"2016-05-15","rating":5}],"destLat":null,"destLon":null},{"id":129,"lat":-22.3336,"lon":-44.5416,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-12","comments":[{"text":"Hitchhiking is very common in Visconde de Maua region. This here is a good spot if you're heading towards Presidente Dutra highway or the surroundings of the city of Resende. There's a speed bump at this spot where people usually hitchhike.","date":"2016-05-12","rating":5}],"destLat":null,"destLon":null},{"id":131,"lat":-10.2061,"lon":-36.8195,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-04-28","comments":[{"text":"Melhor lugar que já peguei carona, foi menos de 10 segundos.","date":"2016-04-28","rating":5}],"destLat":null,"destLon":null},{"id":132,"lat":-22.7355,"lon":-47.2823,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-04-24","comments":[{"text":"Peguei essa carona sozinha, foi bem trânquilo, peguei um ônibus de Campinas para Americana, custou R$10,10. Pedi para o motorista me deixar próxima ao Posto da Polícia Rodoviária, e de fato tem um ponto que é na polícia, pedi carona lá mesmo, foi super rápido e direto para Araraquara, meu local...","date":"2016-04-24","rating":5}],"destLat":null,"destLon":null},{"id":133,"lat":-22.4959,"lon":-44.5727,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-23","comments":[{"text":"Caronas na direção de São Paulo com caminhoneiros.","date":"2016-03-23","rating":5}],"destLat":null,"destLon":null},{"id":134,"lat":-22.4998,"lon":-44.677,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-23","comments":[{"text":"Um bom local para conseguir caronas em direção à Minas Gerais (Itamonte, Pouso Alto..)\nConsegui em 20 minutos uma carona com os militares que saiam de Itatiaia no sábado de manhã e iam para Três Corações. Meu destino final era São Tomé das Letras.","date":"2016-03-23","rating":5}],"destLat":null,"destLon":null},{"id":138,"lat":-21.2993,"lon":-43.6276,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"There's a gas station here that is great to take rides to Rio de Janeiro.\nThere's not much truckers but the cars pass in low speed.\nYou get here by bus from Barbacena, it only costs about 3 reais","date":"2016-03-10","rating":5}],"destLat":null,"destLon":null},{"id":142,"lat":-20.7415,"lon":-44.7714,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"there's some gas stations here where you may try to take a ride, it's a good place to take a ride to Belo horizonte.\nThe gas station on the side of the highway that goes to São paulo doens't have many truckers.","date":"2016-03-10","rating":5}],"destLat":null,"destLon":null},{"id":160,"lat":-22.9163,"lon":-43.9334,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-01-09","comments":[{"text":"Good place to go from Rio. Here are speed cameras, so cars go slowly. Went from here to Paraty and waited near 15-20 min.\nTo get here:\n1. Take train from Central to Campo Grande\n2. Then you need bus to Mangaratiba. Ask people, if possible. It goes not from Rodoviaria, but also near station. Yoou need go right and a bit forward from train station. Costs ~10$R","date":"2016-01-09","rating":5}],"destLat":null,"destLon":null},{"id":166,"lat":-25.59,"lon":-54.5621,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-11-24","comments":[{"text":"BRAZIL/ARGENTINA border: very easy to hitchhike here. We did it in both directions and didn't have to wait more than 10 minutes to get a ride to Puerto Iguazu or Foz do Iguacu.","date":"2015-11-24","rating":5}],"destLat":null,"destLon":null},{"id":169,"lat":-16.5814,"lon":-49.1719,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-30","comments":[{"text":"Posto da Polícia Rodoviária Federal.\n\nBom lugar para quem deseja ir ao Norte/Brasília.\n\nPara chegar aí, no Terminal Rodoviário de Praça da Bíblia deve se tomar um ônibus para Teresópolis e descer na PRF.","date":"2015-10-30","rating":5}],"destLat":null,"destLon":null},{"id":172,"lat":-29.2967,"lon":-49.768,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Receita estadual","date":"2015-10-28","rating":5}],"destLat":null,"destLon":null},{"id":173,"lat":-29.3009,"lon":-49.7708,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Receita estadual","date":"2015-10-28","rating":5}],"destLat":null,"destLon":null},{"id":181,"lat":-24.3119,"lon":-47.6246,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-10-17","comments":[{"text":"O ponto para carona é exatamente esse, depois da rotatória. Aqui tem uma parada de ônibus. Minha recomendação é você fazer uma plaquinha, se desejar ir para Sorocaba.","date":"2015-10-17","rating":5}],"destLat":null,"destLon":null},{"id":182,"lat":-24.6286,"lon":-47.9032,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2015-10-17","comments":[{"text":"Aqui encontra-se o Graal de Registro-SP. Tem água gelada, banheiro e WiFi, gratuitos. É possível acampar em algumas partes do posto.\nSe desejar pegar carona aqui (Sentido São Paulo) recomendo ficar bem na saída do posto.","date":"2015-10-17","rating":5}],"destLat":null,"destLon":null},{"id":183,"lat":-27.7053,"lon":-48.5087,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-10-06","comments":[{"text":"Um ótimo local para pedir carona, indo ao centro de Floripa. Faça uma plaquinha escrito \"centro\".\nMuitos universitários já estão acostumados a dar carona para as pessoas que moram nessa região.","date":"2015-10-06","rating":5}],"destLat":null,"destLon":null},{"id":194,"lat":-28.4228,"lon":-53.9142,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"Aqui fica o Posto 44, excelente local para pegar carona, se você deseja ir para Santa Maria, Cruz Alta ou Santiago. É possível pegar caronas que vão para o Uruguai ou Argentina.","date":"2015-08-26","rating":5}],"destLat":null,"destLon":null},{"id":195,"lat":-28.2354,"lon":-52.38,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"Nesse ponto existe um posto da PRF (Policia Rodoviária Federal). Aqui os carros passam lentamente. Você pode conversar com os agentes da PRF, eles te deixam tomar água em uma bica.\nÓtimo ponto para pegar carona no sentido Carazinho.","date":"2015-08-26","rating":5}],"destLat":null,"destLon":null},{"id":197,"lat":-23.7873,"lon":-46.9133,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"saindo do centro de SP, o mais rápido para chegar até Itapecerica é pegar o metrôcptm até a estação de Capão Redondo. De lá saem os ônibus para Itapecerica.","date":"2015-08-26","rating":5},{"text":"Pedágio São Lourenço a Serra (toll plaza). You can get here by bus 001 or 340 to Itapecerica da Serra getting off at Praça Belchior de Pontes and from there taking bus 030 to Jaquitiba. Another option is bus 282 from Terminal Tietê, but the last one leaves at 6 pm and 4 pm on weekends. Hitch further away from the toll booths to not be sent away.","date":"2014-07-11","rating":5}],"destLat":null,"destLon":null},{"id":211,"lat":-23.2977,"lon":-50.0694,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-01","comments":[{"text":"a BR 153 passa pelo meio da cidade, trajeto de muitos caminhoneiros, com PRF, lombadas e semáforos. Ótimo ponto","date":"2015-07-01","rating":5}],"destLat":null,"destLon":null},{"id":217,"lat":-19.9261,"lon":-44.0082,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2015-04-22","comments":[{"text":"Um ótimo local para pegar carona. Se você deseja ir para Brasilia, aqui é o lugar.\nNão demorei mais do que cinco minutos para conseguir uma carona. Tem um radar neste ponto, então os carros passam lentamente por aqui.","date":"2015-04-22","rating":5}],"destLat":null,"destLon":null},{"id":228,"lat":-23.2954,"lon":-46.0052,"rating":5,"reviews":2,"wait":25,"signal":null,"lastUsed":"2015-02-12","comments":[{"text":"Realy good place for hicking. Many cars, good view.","date":"2015-02-12","rating":5},{"text":"Pedágio (toll station) where you can hitch towards Rio de Janeiro. From São Paulo Tieté Terminal take a bus to Jacareí and tell the driver to stop at posto with restaurnat Frango Assado located near the exit to Jacareí. From there you can walk to the toll plaza. If you hitch to close to the booths you can be sent further by the security, so move yourself on the beginning.","date":"2014-06-30","rating":5}],"destLat":null,"destLon":null},{"id":229,"lat":-21.6795,"lon":-43.3469,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-02-10","comments":[{"text":"ponto muito bom mesmo!!","date":"2015-02-10","rating":5},{"text":"Já peguei muitas caronas neste ponto e também varias pessoas pegam, já é um ponto conhecido por caroneiros.\n\nTem um quebra mola e um ponto de ônibus no local, que facilita muito, pois tem uma área muito boa para os carros parar no acostamento.\n\nVocê pode pegar um ônibus no centro da cidade e chegar neste ponto. Se você perguntar onde é o ponto de caroneiro no bairro Grama certamente alguém vai consegui lhe explicar.\n\nMais a frente deste local tem outro ponto que bastante caroneiros costumam pedi","date":"2014-06-21","rating":5}],"destLat":null,"destLon":null},{"id":231,"lat":-25.3907,"lon":-49.0564,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-02-02","comments":[{"text":"Este ponto de carona é uma boa porque fica perto de duas estradas a BR277 que liga o litoral do Paraná ao Paraguay, e a BR116 principal rodovia brasileira.\n\nO ponto no mapa não está exatamente no lugar certo, mas não é difícil chegar lá.\n\nNo terminal de São José pegue o ônibus BORDA DO CAMPO (R$2,95) e peça para descer na BR antes de  entrar em borda do campo, ou se preferir fique de olho no lado direito que tem um posto de saúde, assim que ver ele pode dar o sinal.\nDescendo do ônibus mais ou me","date":"2015-02-02","rating":5}],"destLat":null,"destLon":null},{"id":234,"lat":-21.9132,"lon":-50.5637,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-26","comments":[{"text":"Posto da Policia Rodoviária Militar.","date":"2015-01-26","rating":5}],"destLat":null,"destLon":null},{"id":237,"lat":-23.19,"lon":-51.1988,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2015-01-22","comments":[{"text":"Lugar ideal pra quem quer pegar carona de Londrina para diversas direções. A maior vantagem é que é fácil acessar de ônibus, basta conversar com os locais e dizer que você deseja ir à \"Warta\". Chegando em Warta basta andar até a rotatória.","date":"2015-01-22","rating":5}],"destLat":null,"destLon":null},{"id":238,"lat":-22.1737,"lon":-51.3762,"rating":5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2015-01-22","comments":[{"text":"Peguei carona com um caminhoneiro que me deixou na rotatória que vai em direção ao paraná.","date":"2015-01-22","rating":5},{"text":"Lugar ideal para pegar carona na direção de Assis e Londrina.","date":"2015-01-22","rating":5}],"destLat":null,"destLon":null},{"id":241,"lat":-15.9283,"lon":-48.1676,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-01-19","comments":[{"text":"realmente otimo lugar","date":"2015-01-19","rating":5},{"text":"You must take any bus to \"Santo Antônio do Descoberto\"  and ask to stop in ONE POINT BEFORE the Polícia Rodoviária Federal. \n\nWalk 500 meters ahead till found the Policial Station. It's the better place to get away of Brasília.","date":"2014-12-11","rating":5}],"destLat":null,"destLon":null},{"id":242,"lat":-12.1296,"lon":-49.1716,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-19","comments":[{"text":"Otimo lugar para pegar caronas ,a cidade tem diversos quebra-molas onde passam diversos caminhoes indo para belem-PA ou sentido Brasilia-Goiania. 5 minutos e ja consegui minha carona ate uruaçu -GO","date":"2015-01-19","rating":5}],"destLat":null,"destLon":null},{"id":244,"lat":-21.691,"lon":-45.2394,"rating":5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2015-01-16","comments":[{"text":"Posto Petrobras, saida de Três Corações. Bom lugar pra pegar carona até São Thomé das Letras.","date":"2015-01-16","rating":5}],"destLat":null,"destLon":null},{"id":258,"lat":-17.2347,"lon":-46.8477,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-12","comments":[{"text":"Parada em Frente ao posto Catuí. \nPosto bem estruturado, com hotel e tem uma área q o pessoal acampa ou arma redes.\nÉ de fácil acesso tanto por quem vem pela 040 ou pela MG188. \nÉ uma parada de caminhoneiros, então é fácil conseguir carona nos dois sentidos. \nTem ponto de ônibus em frente que vai pro centro da cidade e também uma parada rodoviária, ponto de vários ônibus interestaduais.","date":"2014-12-12","rating":5}],"destLat":null,"destLon":null},{"id":259,"lat":-21.6678,"lon":-45.3198,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Pra quem vai descer pra São Thomé, é o melhor ponto de descida. No posto. Do outro lado, atravessando pela passarela ha um ponto de ônibus que leva à rodoviária. \nO posto é parada de caminhão, e fica sempre cheio. Ir pra SP, ou voltar pro triângulo mineiro é tranquilo!","date":"2014-12-11","rating":5}],"destLat":null,"destLon":null},{"id":264,"lat":-16.7671,"lon":-46.1324,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Vários caminhões para BH-MG.","date":"2014-12-11","rating":5}],"destLat":null,"destLon":null},{"id":267,"lat":-16.5941,"lon":-46.8432,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Otimo ponto para caronas nessa região, os carros","date":"2014-12-11","rating":5}],"destLat":null,"destLon":null},{"id":285,"lat":-21.1394,"lon":-42.3843,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Not a big city to walk through, you quickly reach the exit. There's a small gas station on the left side of the road (facing south) which didn't seem very helpful. We got a direct ride to Rio in around 20 minutes.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":286,"lat":-18.9181,"lon":-41.9408,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Take a bus 05A to Jardim Atalaia and go until the final stop. There's a Policia Federal post nearby and you can hitch after it.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":289,"lat":-14.8977,"lon":-40.8671,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Bus stop just in front of a supermarket.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":291,"lat":-14.798,"lon":-39.061,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Direction Itabuna, around 3 km from the center.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":293,"lat":-14.1412,"lon":-39.7273,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Direction Ubata, Ilheus.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":296,"lat":-11.6132,"lon":-46.825,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Small town, good for rides in both directions.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":297,"lat":-12.5853,"lon":-39.5229,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"For rides south. After the narrow bridge there's enough space for the cars to pull over.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":298,"lat":-12.4964,"lon":-41.2999,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"A little village Tanquinho, good for rides both directions.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":302,"lat":-14.1427,"lon":-47.5227,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"For rides towards Sao Jorge in Chapada dos Veadeiros","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":304,"lat":-16.7492,"lon":-47.6079,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Posto BR at the exit of Cristalina, good for rides to Brasilia.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":305,"lat":-18.6615,"lon":-48.1613,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Gas station on the side of the road going north.","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":309,"lat":-23.1696,"lon":-46.925,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-04","comments":[{"text":"A good spot to go north direction Brasilia. From Sao Paulo take the purple line metro from Estacao da Luz until the very end. There's a moment somewhere during the trip when you have to change the train, the one continuing all the way to Jundiai is on the same platform, on the track just next to the one with the train you came with. From the final station, walk along Avenida Marginal which continues into Av. Prefeito Luis Latorre. You'll see the signs for the highway. Took us around 10 minutes t","date":"2014-06-04","rating":5}],"destLat":null,"destLon":null},{"id":312,"lat":-26.1914,"lon":-48.9121,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-05-26","comments":[{"text":"O melhor lugar para pegar carona saindo de Joinville sentido RS é no posto da Policia que fica em Pirabeiraba, para chegar até lá, pegue um ônibus até o terminal de Pirabeiraba,  depois pegue um ônibus para Rio Bonito, (você irá pagar uma passagem só se pegar os onibus nos terminais do centro de Joinville e no terminal de Pirabeiraba!) quando estiver no  onibus de Rio Bonito, espero-o pegar a rodovia e desça logo depois da ponte no Posto da Policia. Boa Sorte!","date":"2014-05-26","rating":5}],"destLat":null,"destLon":null},{"id":313,"lat":-25.6768,"lon":-49.15,"rating":5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2014-05-25","comments":[{"text":"O melhor lugar para pedir carona saindo de Curitiba sentido SC é um posto da Policia Rodoviaria que fica a cerca de 8Km do posto Cupim 2 em São José dos Pinhais, tem ônibus urbano que passa na frente do posto, mais não sei a linha, cabe a cada um se informar e boa viagem!","date":"2014-05-25","rating":5}],"destLat":null,"destLon":null},{"id":318,"lat":-16.5134,"lon":-54.6571,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-04-03","comments":[{"text":"Very good spot!\nfew meters before the gas station, trucs and car slow down and just after, a placce to stop!\neasy to get a lift to Campo Grande!\nbeware of the sun!!","date":"2014-04-03","rating":5}],"destLat":null,"destLon":null},{"id":330,"lat":-14.3119,"lon":-39.0239,"rating":5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2014-03-05","comments":[{"text":"Good for rides in all directions. To itacare it's 6 km from there, to the bridge over Rio das Contas - 4, so might be better to hitch while walking.","date":"2014-03-05","rating":5}],"destLat":null,"destLon":null},{"id":363,"lat":-25.4785,"lon":-54.4811,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-01-17","comments":[{"text":"Ótimo lugar para sair de foz do iguaçu de carona, há um auto posto grande onde param vários cominhões, mas eu sempre fiquei a beira da estrada pedindo.","date":"2014-01-17","rating":5}],"destLat":null,"destLon":null},{"id":371,"lat":-19.5681,"lon":-43.9178,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[{"text":"Good place to hitchhiking from Belo Horizonte to Parque Nacional Serra do Cipó. It's a speed reducer.\n\nFor getting here: Take a bus in a Rodoviaria of BH to Lagoa Santa. (Costs R$4,20 - Jan of 2014). In Lagoa Santa going out of Terminal and take a bus to Lapinha and going out in the last point of BR. Walk 50 m until the speed reducer.\n\nI just waited 1 minute.","date":"2014-01-09","rating":5}],"destLat":null,"destLon":null},{"id":374,"lat":-27.1579,"lon":-48.5519,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2013-12-16","comments":[{"text":"There is a toll in Porto Belo in wich it's easy to hitch hike. You can take a buss from Florianópolis to Porto Belo.","date":"2013-12-16","rating":5}],"destLat":null,"destLon":null},{"id":376,"lat":-29.9403,"lon":-50.9961,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2013-12-16","comments":[{"text":"The toll of Gravataí is a great spot to hitch hike. I did it in october 2013, on my way to Santa Catarina.\n\nHOW TO GET THERE?\nYou go to the Terminal Rodoviaria do Camelao, in Porto Alegre, and take the bus to de \"Pedagio Gravataí\", it costed $7 reales when I did it. There you walk a few meters and stand on the road side. I waited for 10 minutes only!","date":"2013-12-16","rating":5}],"destLat":null,"destLon":null},{"id":380,"lat":-23.5515,"lon":-51.4689,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-09-08","comments":[{"text":"Ótimo lugar para se pegar carona com destino a Maringá, neste ponto tem um sinaleiro, só abordar os automóveis que pararem. Demorei em torno de 35 minutos para conseguir uma carona.","date":"2013-09-08","rating":5}],"destLat":null,"destLon":null},{"id":383,"lat":-8.085,"lon":-34.945,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Ótimo posto de gasolina para pegar carona, para quem está indo rumo à João Pessoa. Para quem está em Recife tem metrô que traz até a o bairro Barro, onde se tem uma parada do metrô. Demorei em torno de 10 minutos para conseguir uma carona no posto.\n\nhttp://relatosdeummochileiro.blogspot.com.br/","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":385,"lat":-9.6296,"lon":-35.6989,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Otimo lugar para se pegar carona, para quem está indo rumo à Recife. Consegui uma carona em menos de 10 minutos.","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":386,"lat":-10.8958,"lon":-37.1321,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Otimo local para se pegar carona para quem está indo rumo a Maceió. Demorei em torno de 20 minutos para pegar uma carona com plaquinha.","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":387,"lat":-11.507,"lon":-37.7873,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Otimo local para se pegar carona. Estava indo rumo à Aracaju pela BR-101.","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":388,"lat":-12.7789,"lon":-38.4093,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Otimo lugar para se pegar carona para quem quer ir para BR-101. Demorei 20 minutos para pegar uma carona usando plaquinha, estava indo rumo à Aracaju.","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":391,"lat":-21.1285,"lon":-42.3844,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-27","comments":[{"text":"this is one very good spot to hitchhike. there's a speed bump where cars slow down. it's very common to get rides here to, LEOPOLDINA and JUIZ DE FORA. If you want to go to Rio, here's the place to be too. Th get there's another place that is better, but you'll need a ride to reach there. Here, you can come walking, or take a bus, ask for a bus that pass in front of MITSUBISH VEMASA, and than walk till here.","date":"2013-07-27","rating":5}],"destLat":null,"destLon":null},{"id":394,"lat":-21.7674,"lon":-43.3268,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-03","comments":[{"text":"http://goo.gl/maps/sDsK4 here is an image of a very good spot to hitchhike this way (to Bicas, Mar de Espanha, Leopoldina, Muriaé). You can take the bus SANTO ANTONIO, or just walk, it's not that far from the center. There's a speed bump nowadays, that doesn't appear in the google maps image.","date":"2013-07-03","rating":5}],"destLat":null,"destLon":null},{"id":395,"lat":-21.7747,"lon":-43.2939,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-03","comments":[{"text":"You can see a image of a guy in the nicest spot to hitchhike. http://goo.gl/maps/aiH0T . To reach here, you should take the bus FLORESTA or JARDIM ESPERANÇA. It's just past the tunnel. Use as a reference that colored buildings just up the hill.","date":"2013-07-03","rating":5}],"destLat":null,"destLon":null},{"id":396,"lat":-23.5049,"lon":-46.8813,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-06-02","comments":[{"text":"Existe um posto de gasolina (da Petrobras) em torno de 3,4 km após este ponto (o posto não apareceu neste mapa, de uma olhada no Google Maps, só procurar por Faculdade Alfacastelo, que já aparece este cruzamento), ótimo para se conseguir carona para quem está indo em direção à Ourinhos e ao norte do Paraná (Londrina/Maringá), consegui uma carona em torno de 5 minutos. Há um ponto de circular dentro do posto (não sei qual circular deve se pegar para chegar ao posto, devido ter me perdido).\nhttp:/","date":"2013-06-02","rating":5}],"destLat":null,"destLon":null},{"id":398,"lat":-23.5061,"lon":-51.7387,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2013-05-30","comments":[{"text":"Ótimo ponto para pegar carona, principalmente para São Paulo e Curitiba. \nQuem estiver em Maringá é só ir na praça Raposo Tavares e pegar a circular, da empresa Garcia, em direção Maringá-Mandaguari. O percurso dura em torno de uns 50 m. Entre a cidade de Marialva e Mandaguari, há um pedágio, após passar o pedágio tem um ponto, só descer e esperar debaico de uma arvore por carona!","date":"2013-05-30","rating":5}],"destLat":null,"destLon":null},{"id":399,"lat":-22.6261,"lon":-47.8376,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2013-02-12","comments":[{"text":"Excelente ponto para pegar caronas para Piracicaba, Americana, Sta B., etc. Fica próximo da rotatória que dá acesso à região do Thermas, portanto, a velocidade de alguns carros reduz. Além disso, vai melhorar, há um posto em construção: teremos dois pontos de barganha e um safe house se anoitecer e não rolar nenhum carona.\n\nExcellent point to catch rides to Piracicaba, American, Sta B., etc.. Is close to the round about which gives access to the Thermas region, therefore it reduces the speed of ","date":"2013-02-12","rating":5}],"destLat":null,"destLon":null},{"id":400,"lat":-22.6337,"lon":-47.8489,"rating":5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2013-02-12","comments":[{"text":"Pequena estrada que leva até o parque aquático Thermas Water Park. Não tem acostamento, mas não é perigosa: há pouco trânsito e a maioria dos motoristas dirigem devagar. Na metade do trajeto (sem placa, andando de costas para os carros, só esticando o dedão) consegui uma carona: um morador de uma das chácaras da região. Ele nem ia até o Thermas, mas me levou até lá...\n\nSmall road that leads to the waterpark Thermas Water Park. It has no shoulder, but it is not dangerous: there is little traffic ","date":"2013-02-12","rating":5}],"destLat":null,"destLon":null},{"id":402,"lat":-22.9823,"lon":-47.468,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-02-12","comments":[{"text":"Muito bom local para pegar carona sentido Piracicaba, São Pedro, Águas de São Pedro, Rio das Pedras, Mombuca...Nessa carona o caminhoneiro estava indo para o MS evitando pedágios, talvez possa ser uma estratégia para ir p/ lá. \n\nVery nice spot to hitchhike to Piracicaba, São Pedro, Águas de São Pedro, Rio das Pedras, Mombuca...In this trip the truck driver was going to MS to avoid some tollbooths, might as well be a good place to hitch towards MS.","date":"2013-02-12","rating":5}],"destLat":null,"destLon":null},{"id":406,"lat":-30.0361,"lon":-51.3274,"rating":5,"reviews":2,"wait":18,"signal":null,"lastUsed":"2013-01-12","comments":[{"text":"Daqui você pode pegar carona tanto pro oeste do Rio Grande do Sul, quanto para o sul do estado. Se você vai pro Uruguay sem uma cidade específica como destino, você pode fazer uma placa simplesmente com o nome \"URUGUAY\", porque daí vc pode conseguir uma carona (assim como eu consegui) que te leve até a fronteira no oeste do país.\n\nCOMO CHEGAR AQUI?\n- Pegar o ônibus que vai pra Guaíba (custou r$7,50 em jan/2013, mas talvez existissem opções mais baratas, não pesquisei muito)\n- Pedir pra descer no","date":"2013-01-12","rating":5}],"destLat":null,"destLon":null},{"id":413,"lat":-29.6953,"lon":-53.7751,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2013-01-10","comments":[{"text":"Great spot for exiting Santa Maria to the North and East. A car stopped within 5 minutes.","date":"2013-01-10","rating":5}],"destLat":null,"destLon":null},{"id":416,"lat":-22.5294,"lon":-43.2214,"rating":5,"reviews":2,"wait":15,"signal":null,"lastUsed":"2012-12-05","comments":[{"text":"Every time I hitch back to Juiz de Fora from Rio I take the bus to Petropólis. But, some people told me that exists a good point near a pike, just outside of Rio","date":"2012-12-05","rating":5},{"text":"From Rio de Janeiro (the capital) you should take a bus to PetrÃ³polis and just from here try to hitch a ride.. coz as everybody can imagine, do it on the border of the capital is not a good idea. it sounds like impossible and.. dangerous.\n\nthe people from PetrÃ³polis told me they use to see people hitchhiking here sometimes.. and the road is really good and as it's up in a mountain, they pass by here slowly..\nand there's a police station near.\ni got a ride easily.","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":419,"lat":-27.5967,"lon":-48.557,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-07","comments":[{"text":"If you have arrived to the city by bus, make a sign and wait around here. You'll get all the traffic of people coming out of the city bus station and the rather large parking lot going to pretty much anywhere on the island.","date":"2011-10-07","rating":5}],"destLat":null,"destLon":null},{"id":420,"lat":-27.6006,"lon":-48.4733,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-07","comments":[{"text":"Any place along this stretch of road is good for hitch-hiking but I have always seen many people on this part going back to the other side of the island (I have picked up many myself).","date":"2011-10-07","rating":5}],"destLat":null,"destLon":null},{"id":432,"lat":-20.9264,"lon":-41.0787,"rating":5,"reviews":2,"wait":18,"signal":null,"lastUsed":"2011-04-01","comments":[{"text":"Busstop where trucks and cars have nice place to stop.","date":"2011-04-01","rating":5}],"destLat":null,"destLon":null},{"id":435,"lat":-14.1513,"lon":-39.3316,"rating":5,"reviews":2,"wait":45,"signal":null,"lastUsed":"2011-04-01","comments":[{"text":"A gasstation and restaurant where a lot of trucks are passing all the time. To south or north","date":"2011-04-01","rating":5}],"destLat":null,"destLon":null},{"id":437,"lat":-13.3829,"lon":-39.0742,"rating":5,"reviews":2,"wait":15,"signal":null,"lastUsed":"2011-04-01","comments":[{"text":"Getting here from Salvador first you need to take the ferry to Itaparica and then take a bus to Valenca. From the ferry i heard it is also possible to hitch. Probably asking people where they are going etc.","date":"2011-04-01","rating":5}],"destLat":null,"destLon":null},{"id":442,"lat":-19.9858,"lon":-44.203,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"O melhor lugar pra se pedir carona saindo de BH para o TriÃ¢ngulo Mineiro (Uberaba, UberlÃ¢ndia) ou para SÃ£o Paulo Ã© neste ponto, no trevo onde a BR262 e BR381 se separam e os carros sÃ£o filtrados, cada um segue pro seu lado.\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar Ã´nibus para a Morada do Trevo (Betim) na av. OlegÃ¡rio Maciel, 742 no centro de BH. NÃ£o tenho certeza do nÃºmero do Ã´nibus, mas Ã© um desses trÃªs (vocÃª deve perguntar pra ter certeza!): 3292, 3297 ou 3298. PeÃ§a para de","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":9,"lat":-2.4537,"lon":-54.77,"rating":5,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2026-01-08","comments":[{"text":"I did take a bus to the EETEPA ( university just across) and  hitchhiked from there. Really easy, most car go to Alter do Chao","date":"2026-01-08","rating":5}],"destLat":-2.5104,"destLon":-54.9585},{"id":19,"lat":-3.0807,"lon":-41.445,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-07-11","comments":[{"text":"Great spot at the gas station, there is signal and you are at the intersection of two roads from where people might go to the east. A 4x4 took us in the back of his car to Jijoca de Jericoacoara.","date":"2025-07-11","rating":5}],"destLat":-2.9072,"destLon":-40.4383},{"id":23,"lat":-15.6545,"lon":-56.2069,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-05-28","comments":[{"text":"Perfect spot to go to the north west. There is a gas station on the other side of the road, and a lot of space for trucks to stop.","date":"2025-05-28","rating":5}],"destLat":-16.1987,"destLon":-57.5784},{"id":27,"lat":-23.4334,"lon":-45.0853,"rating":5,"reviews":1,"wait":40,"signal":"thumb","lastUsed":"2025-05-01","comments":[{"text":"Plenty of space right after rond point","date":"2025-05-01","rating":5}],"destLat":-23.3306,"destLon":-44.9114},{"id":29,"lat":-25.811,"lon":-48.5518,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-04-29","comments":[{"text":"Perfect spot, near the exit of Matinhos and accessible with the free city bus. In twenty minutes, we had one offer to take us for 80 R$, but we waited a bit more and received a valid hitch all the way to Curitiba! 👌","date":"2025-04-29","rating":5}],"destLat":-25.4689,"destLon":-49.2081},{"id":31,"lat":-12.4528,"lon":-40.6268,"rating":5,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-04-25","comments":[{"text":"Next to gas station \r\nPlenty of food and internet","date":"2025-04-25","rating":5}],"destLat":-12.471,"destLon":-41.0977},{"id":39,"lat":-2.9288,"lon":-40.8565,"rating":5,"reviews":1,"wait":70,"signal":"thumb","lastUsed":"2025-04-20","comments":[{"text":"Long walk to get to this optimum spotNext to posto and lanchonette and place for car to stop","date":"2025-04-20","rating":5}],"destLat":-3.0444,"destLon":-41.2446},{"id":40,"lat":-2.0564,"lon":-45.9543,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-04-20","comments":[],"destLat":-2.9076,"destLon":-40.8491},{"id":42,"lat":-2.8776,"lon":-40.9517,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-04-20","comments":[],"destLat":-2.8978,"destLon":-40.8523},{"id":51,"lat":-26.0292,"lon":-48.8593,"rating":5,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-04-15","comments":[],"destLat":-25.8801,"destLon":-48.5703},{"id":54,"lat":2.8106,"lon":-60.6105,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-03-31","comments":[{"text":"so hard to hitchhike in Brazil but as soon as you start talking to Guayanese folk it was easy enough guayanese in the gas station I marked heading to lethem that we had an easy time getting a ride","date":"2025-03-31","rating":5}],"destLat":3.3766,"destLon":-59.7917},{"id":56,"lat":-23.3185,"lon":-44.7226,"rating":5,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2025-03-12","comments":[{"text":"A car stopped as soon as we started to hitchike! He took us to a beach to surf, and then to São Paulo.","date":"2025-03-12","rating":5}],"destLat":-23.5642,"destLon":-46.6898},{"id":57,"lat":-23.2253,"lon":-44.7305,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-03-12","comments":[{"text":"We first tried to hitchike on the roundabout, but cars had little visibility to see where to stop. It's much better after the bridge when it's a long straight road ahead.","date":"2025-03-12","rating":5}],"destLat":-23.3183,"destLon":-44.7224},{"id":59,"lat":-22.8945,"lon":-43.6788,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-03-11","comments":[{"text":"Lots of traffic, and space for cars to stop. Accessible by the city bus 388 from the center of Rio for 5 R$. Our host invited us to do jet ski!!","date":"2025-03-11","rating":5}],"destLat":-23.0314,"destLon":-44.1715},{"id":61,"lat":-17.3034,"lon":-55.8655,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-04-21","comments":[],"destLat":-18.6514,"destLon":-50.0647},{"id":62,"lat":-24.07,"lon":-54.2486,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-01-10","comments":[{"text":"No se puede cruzar a pie. Un policía muy amable me consiguió una carona con un coche que iba pasando. Las personas tienen mucho miedo de quienes piden carona por el tráfico de drogas de esa zona, así que es mejor que un policía pida la carona por ustedes.","date":"2024-01-10","rating":5}],"destLat":-24.0536,"destLon":-54.3121},{"id":63,"lat":-15.5804,"lon":-47.5714,"rating":5,"reviews":1,"wait":8,"signal":null,"lastUsed":"2023-12-26","comments":[{"text":"Cheguei aí com uma carona. Todo mondo do Brasilia vai pra Formosa, então é melhor ir pra esse ponto e de aí peguei caona direito pra São Jorge na Chapada dos Veadeiros","date":"2023-12-26","rating":5}],"destLat":-14.1765,"destLon":-47.8098},{"id":64,"lat":-22.51,"lon":-47.3971,"rating":5,"reviews":1,"wait":14,"signal":null,"lastUsed":"2023-12-07","comments":[{"text":"Ponto ótimo pra Uberlandia e Brasília. Passei a noite no Limeira num posto (Castelo no se que) e peguei carona até o pedagio.","date":"2023-12-07","rating":5}],"destLat":-16.3775,"destLon":-47.8995},{"id":68,"lat":-19.8744,"lon":-44.0556,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-08-29","comments":[{"text":"Ótimo pra São Paulo. Infelizmente eu queria ir pra o Rio de Janeiro. Muitos camioneros pararam pra ofrecer carona ao São Paulo.\r\nPra o Rio peguei o ônibus e foi pra a 040 mais no sul.","date":"2023-08-29","rating":5}],"destLat":-24.0431,"destLon":-46.5967},{"id":69,"lat":-28.1287,"lon":-48.6927,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-02-15","comments":[{"text":"Eu estava precisando de uma carona da praia do rosa para Florianópolis. Nesta curva os carros que passam todos vão em direção a cidade que eu precisava e passam bem devagar pois é uma curva fechada. Tem um bom acostamento para poderem parar e te dar a carona. \r\n\r\nO terceiro carro que passou já parou e me deu carona.","date":"2023-02-15","rating":5}],"destLat":-27.5839,"destLon":-48.6152},{"id":81,"lat":-20.117,"lon":-40.3153,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-08-07","comments":[],"destLat":null,"destLon":null},{"id":115,"lat":-7.1411,"lon":-34.9217,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-07-01","comments":[],"destLat":null,"destLon":null},{"id":117,"lat":-9.6256,"lon":-35.6967,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-05-25","comments":[],"destLat":null,"destLon":null},{"id":118,"lat":-9.4307,"lon":-35.8367,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-05-22","comments":[],"destLat":null,"destLon":null},{"id":119,"lat":-9.0849,"lon":-35.2537,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[],"destLat":null,"destLon":null},{"id":136,"lat":-20.4222,"lon":-42.8986,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[],"destLat":null,"destLon":null},{"id":148,"lat":-9.7971,"lon":-36.1095,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2016-02-28","comments":[],"destLat":null,"destLon":null},{"id":165,"lat":-25.5605,"lon":-48.5845,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-12-08","comments":[],"destLat":null,"destLon":null},{"id":191,"lat":-20.5261,"lon":-43.7091,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":209,"lat":-30.2295,"lon":-54.7245,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[],"destLat":null,"destLon":null},{"id":254,"lat":-19.6352,"lon":-43.2399,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-12-12","comments":[],"destLat":null,"destLon":null},{"id":266,"lat":-23.6656,"lon":-52.577,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[],"destLat":null,"destLon":null},{"id":324,"lat":-17.8639,"lon":-40.1505,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":325,"lat":-16.3918,"lon":-39.5864,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":326,"lat":-16.3725,"lon":-39.5615,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":333,"lat":-12.968,"lon":-38.5189,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":334,"lat":-12.2734,"lon":-38.9336,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":335,"lat":-12.5865,"lon":-39.5195,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":336,"lat":-12.5108,"lon":-40.3016,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":337,"lat":-12.5046,"lon":-41.221,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":339,"lat":-12.1709,"lon":-43.1977,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":340,"lat":-12.0916,"lon":-45.7486,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":341,"lat":-11.7128,"lon":-47.7316,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":345,"lat":-2.7816,"lon":-42.3094,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":346,"lat":-2.9451,"lon":-41.7553,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":360,"lat":-2.0433,"lon":-60.0255,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2014-01-29","comments":[],"destLat":null,"destLon":null},{"id":362,"lat":-21.1971,"lon":-43.7986,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-26","comments":[],"destLat":null,"destLon":null},{"id":364,"lat":-2.9084,"lon":-40.4419,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":365,"lat":-3.7329,"lon":-38.7079,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":366,"lat":-4.7221,"lon":-37.5575,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":367,"lat":-5.5868,"lon":-36.9515,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":369,"lat":-6.815,"lon":-35.1393,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":370,"lat":-7.122,"lon":-34.9481,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":1,"lat":-12.4795,"lon":-41.3603,"rating":4.67,"reviews":3,"wait":5,"signal":"thumb","lastUsed":"2026-01-08","comments":[{"text":"Easy to get to Lancois","date":"2026-01-08","rating":4},{"text":"12 km to Lencois from there.","date":"2014-06-05","rating":5}],"destLat":-12.5606,"destLon":-41.3834},{"id":55,"lat":-23.6857,"lon":-46.8603,"rating":4.67,"reviews":3,"wait":15,"signal":"thumb","lastUsed":"2025-03-17","comments":[{"text":"We were hitchhiking at the end of the gas station. A car going out of the car station took us directly to Curitiba, but I believe the cars on the rodovia have enough space to stop. The gas station is accessible with the bus 032 from the métro station \"Vila Sonia\".","date":"2025-03-17","rating":4},{"text":"Posto Fase Quatro with Shell petrol station. You can get here by bus 164 from Terminal Tietê or from Metro Cidade Jardim, as well as bus 282 from Tietê or Metro Butanta.","date":"2014-07-11","rating":5}],"destLat":-25.4355,"destLon":-49.2575},{"id":3,"lat":-11.6872,"lon":-47.7226,"rating":4.33,"reviews":3,"wait":5,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"Easy to get a ride  to Dianopolis","date":"2026-01-08","rating":5},{"text":"Roundabout for rides direction Palmas.Dianópolis","date":"2014-03-05","rating":4}],"destLat":-11.6159,"destLon":-46.8251},{"id":73,"lat":-19.827,"lon":-43.8373,"rating":4,"reviews":4,"wait":49,"signal":null,"lastUsed":"2018-02-22","comments":[{"text":"Para chegar aqui eu fui até a estação São Gabriel, saí pelo lado da rua Jacuí e ali mesmo já peguei o ônibus Boa Vista que me deixou na barreira policial.","date":"2018-02-22","rating":4},{"text":"Dos melhores lugares pra se pedir carona saindo de BH para o leste mineiro (Ipatinga, Gov. Valadares), Salvador (BA) ou VitÃ³ria (ES) Ã© neste ponto. Aqui Ã© onde fica a PM RodoviÃ¡ria. O problema sÃ£o os Ã´nibus para chegar atÃ© aqui e o preÃ§o da passagem do Ã´nibus Ã© cerca de 1real mais cara. A outra opÃ§Ã£o Ã© pegar o Ã´nibus 5502b que te deixa alguns quilÃ´metros antes deste, que eu tambÃ©m marquei aqui no mapa.\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar qualquer um dos seguintes Ã´nib","date":null,"rating":4},{"text":"Dos melhores lugares pra se pedir carona saindo de BH para o leste mineiro (Ipatinga, Gov. Valadares), Salvador (BA) ou VitÃ³ria (ES) Ã© neste ponto. Aqui Ã© onde fica a PM RodoviÃ¡ria. O problema sÃ£o os Ã´nibus para chegar atÃ© aqui e o preÃ§o da passagem do Ã´nibus Ã© cerca de 1real mais cara. A outra opÃ§Ã£o Ã© pegar o Ã´nibus 5502b que te deixa alguns quilÃ´metros antes deste, que eu tambÃ©m marquei aqui no mapa.\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar qualquer um dos seguintes Ã´nib","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":76,"lat":-22.7383,"lon":-43.476,"rating":4,"reviews":3,"wait":75,"signal":null,"lastUsed":"2016-11-20","comments":[{"text":"Demorei duas horas para sair, numa sexta feira! Consegui carona para SP! Boa indicacao.","date":"2016-11-20","rating":4},{"text":"Esse posto é o lugar pra conseguir direto pra SP. Bastante fluxo de carro e caminhão. Com direito a água gelada, banheiro com chuveiro e cafézinho!","date":"2015-03-03","rating":4},{"text":"Estacion de gasolina shell. Consegui un ride a San Pablo en 2 horas preguntando a los camioneros. Para llegar aca tomar el tren en la estacion central de Rio de Janeiro direccion Japeri y bajar en Comendador Soares, despues caminar unos 2 kilometros hasta el puente que cruza la BR-116.","date":"2014-07-07","rating":4}],"destLat":null,"destLon":null},{"id":116,"lat":-20.3795,"lon":-43.4198,"rating":4,"reviews":3,"wait":null,"signal":null,"lastUsed":"2016-07-01","comments":[{"text":"A few meters past the bridge in rua do Catete, right by the lane where cars slow down. Where locals hitch a ride to Ouro_Preto","date":"2016-07-01","rating":4}],"destLat":null,"destLon":null},{"id":176,"lat":-30.1472,"lon":-50.5133,"rating":4,"reviews":3,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Posto da Policia Estadual","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":4,"lat":-10.7362,"lon":-48.4065,"rating":4,"reviews":2,"wait":10,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"Quite easy to get a ride but make sure you go at least to Chapada da Datividade or you’ll get stuck in between cities for a while ;)","date":"2026-01-08","rating":3}],"destLat":-11.6849,"destLon":-47.7247},{"id":70,"lat":-33.5298,"lon":-53.3442,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2019-07-30","comments":[{"text":"If it is often long waiting times til we hitch a ride from Chuí towards Pelotas. If that has been the case with you, I'd recommend writing on a paper the name of one of these places  on the way: Mangueiras or Quatro irmãos. These are some sort of farms on the way, there's absolutely nothing around these farms, but trucks come in and out loading stuff produced by in the region. This can be a way of moving some kilometers if you are stuck, since truck drivers might want to pick you up thinking tha","date":"2019-07-30","rating":4},{"text":"The entrance to Santa Victoria do Palmar is a good spot to hitch hike, cars and trucks go slowly, mostly to Porto Alegre, Pelotas or Rio Grande. It's very easy to hitch hike from Chui to here, and from here to the rest of the cities.","date":"2013-12-16","rating":4}],"destLat":null,"destLon":null},{"id":71,"lat":-33.6722,"lon":-53.4437,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2019-07-30","comments":[{"text":"If it is often long waiting times til we hitch a ride from Chuí towards Pelotas. If that has been the case with you, I'd recommend writing on a paper the name of one of these places  on the way: Mangueiras or Quatro irmãos. These are some sort of farms on the way, there's absolutely nothing around these farms, but trucks come in and out loading stuff produced by in the region. This can be a way of moving some kilometers if you are stuck, since truck drivers might want to pick you up thinking tha","date":"2019-07-30","rating":4},{"text":"You can trying hitching a ride to Brazilian cities from here. Me and a friend waited quite a while, but in the end asked one truck driver and he took us all the way to Porto Alegre.","date":"2011-12-07","rating":4}],"destLat":null,"destLon":null},{"id":72,"lat":-21.6358,"lon":-43.4402,"rating":4,"reviews":2,"wait":45,"signal":null,"lastUsed":"2018-10-16","comments":[{"text":"This is a very good point!!","date":"2018-10-16","rating":4},{"text":"To go from Juiz de Fora hitchhiking to Belo Horizonte you may go to the GetÃºlio Vargas avenue (on the downtown) in front of Mister Shopping and there take one of the following buses:\n- Paula Lima;\n- ChapÃ©u Duvas;\n- BR040; or\n- Dias Tavares\n\nand ask to get out in the Graal gas station (this place marked on the map) or after (this seems better) in the Police station..\n\nthere' some drives who pass by there everyday and they always takes the hitchhikers in this way.. i just can't say anything more","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":74,"lat":-23.6886,"lon":-46.8622,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2017-12-30","comments":[{"text":"Diffiicult since the area is mostly downhill and many people are likely to continue with the momentum but finally got a ride after about 3 hours of waiting","date":"2017-12-30","rating":4},{"text":"polícia rodoviária federal - cars usually slow down a bit there","date":"2015-01-08","rating":4}],"destLat":null,"destLon":null},{"id":78,"lat":-18.4165,"lon":-43.6905,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-08-22","comments":[{"text":"A carona anterior me deixou logo depois do Trevo de Datas. Sentido Curvelo, não havia muito fluxo de carros (por volta de 15h de uma segunda-feira). Ainda assim, ficamos menos de 10 minutos esperando. Não há posto nem quebra-molas no lugar. Ficamos perto do acostamento. Éramos duas pessoas com mochilas muito grandes.","date":"2016-08-22","rating":4}],"destLat":null,"destLon":null},{"id":80,"lat":-10.7314,"lon":-37.0839,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-08-15","comments":[{"text":"Good place for hitchhiking, safe, and with friendly people.","date":"2016-08-15","rating":4}],"destLat":null,"destLon":null},{"id":99,"lat":-13.349,"lon":-39.0607,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-16","comments":[{"text":"right in front of a gas station, I found shade under a tree and found a ride in under 15 minutes :D","date":"2016-07-16","rating":4}],"destLat":null,"destLon":null},{"id":100,"lat":-13.939,"lon":-39.1055,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-16","comments":[{"text":"Right in front of a gas station","date":"2016-07-16","rating":4}],"destLat":null,"destLon":null},{"id":104,"lat":-19.9316,"lon":-40.4055,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-14","comments":[{"text":"You can wait under the shade of a tree, right next to a place where you can buy a drink if thirsty, and there's space where cars can park in front.","date":"2016-07-14","rating":4}],"destLat":null,"destLon":null},{"id":110,"lat":-14.1032,"lon":-39.0123,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"Right in front of a gas station, you can buy something to drink or borrow their bathroom. Good Spot to get Barra Grande, Praia dos Algodoes or Saquaira.","date":"2016-07-13","rating":4}],"destLat":null,"destLon":null},{"id":111,"lat":-22.7093,"lon":-43.7363,"rating":4,"reviews":2,"wait":18,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"My tip is to pay attention to the car plates, to see where are they going. I asked several times for a ride to cars with São Paulo - SP or cities around São Paulo plates, but I could only get a ride with someone from Londrina - PR. If the car is in Rio and it's going to Paraná, it is most likely that he will pass thorugh São Paulo to get there. It worked for me!","date":"2016-07-13","rating":4},{"text":"There's a service station and a Bob's in here. This is a good spot as it is already common among students from the Rural University of Rio de Janeiro to come and hitchhike in here towards Sao Paulo. You know, where people are used to see students hitchhiking is always a place with higher chances to get a ride.\nTo get here you can take the bus 193c from the central station in Rio de Janeiro and ask to get off at Bob's (if he/she doesn't know where it is, just say it's the next gas station after t","date":"2016-05-12","rating":4}],"destLat":null,"destLon":null},{"id":113,"lat":-17.5241,"lon":-39.7079,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-10","comments":[{"text":"There's a bus stop a few metres away from where I stood, so there's space for the car to park.","date":"2016-07-10","rating":4}],"destLat":null,"destLon":null},{"id":125,"lat":-22.8943,"lon":-43.6765,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Great place to hitchhike from Rio de Janeiro to Paraty. \nI got there by train and feet.\nGot a train in Rio central Station to Santa Cruz and the walked to this spot in Br-101 Road (also knows as Rio-Santos road)","date":"2016-05-18","rating":4}],"destLat":null,"destLon":null},{"id":128,"lat":-22.4477,"lon":-44.4422,"rating":4,"reviews":2,"wait":5,"signal":null,"lastUsed":"2016-05-12","comments":[{"text":"To hitchhike towards Bocaina de Minas and such, this looks like a good spot. There's a bus stop here and because of this roundabout cars are passing very slowly. I was picked up by the first car passing by directly to Bocaina de Minas when I lifted my thumb here.","date":"2016-05-12","rating":4}],"destLat":null,"destLon":null},{"id":139,"lat":-21.1753,"lon":-43.9718,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"Good place to hitchhike with a long space for cars to stop.\nTook a ride to Barbacena with some cops in just a few minutes","date":"2016-03-10","rating":4}],"destLat":null,"destLon":null},{"id":141,"lat":-20.7548,"lon":-44.7737,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"good place to hitchhike to São João Del Rei, if someone leave you at the gas stations that are nearby you can walk to here, is not far.","date":"2016-03-10","rating":4}],"destLat":null,"destLon":null},{"id":144,"lat":-19.9472,"lon":-45.1574,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"There's not many cars passing here, but people are friendly and you'll probably get a ride to Perdigão in just a few minutes.\nAraujos is a very small city, i recommend that you aks were is the road that goes to perdigão and walk until the end of the city","date":"2016-03-10","rating":4}],"destLat":null,"destLon":null},{"id":146,"lat":-19.8859,"lon":-45.0015,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"You can walk to this place from BR-262. Is a good place to take a ride to perdigão or Araujos.\nDon't freak out, you won't see many cars, but people are friendly and you won't take long to get a ride.","date":"2016-03-10","rating":4}],"destLat":null,"destLon":null},{"id":153,"lat":-25.485,"lon":-48.8272,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-01-30","comments":[{"text":"Good place get a ride to Curitiba. Just stay next to the speed reducers, so that you  have plenty of time to wave and smile to the drivers. It took quite long to get a ride (over one hour) because I was not alone, but with two other friends. Most of the cars that stopped were actually heading to Paranaguá.","date":"2016-01-30","rating":4}],"destLat":null,"destLon":null},{"id":154,"lat":-20.384,"lon":-40.464,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-01-28","comments":[{"text":"Good place for cars to stop, many people passing by in the right direction. :) \nWould be good to take a bus to this place.(if only i knew which busses stop here)","date":"2016-01-28","rating":4}],"destLat":null,"destLon":null},{"id":155,"lat":-20.3903,"lon":-40.4638,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2016-01-28","comments":[{"text":"Neste local, o posto Flesha é bom para caronas sentido Rio de Janeiro, porém no fim de semana há muitos caminhões parados. E ultimamente eles têm mais dificuldade em conseguir carga para sair, o que pode fazer sua carona demorar mais que o esperado. Durante a semana é tranquilo.","date":"2016-01-28","rating":4},{"text":"Para chegar aqui pegue o onibus 901 - Viana lá do Terminal Campo Grande e peça para descer no ultimo ponto da BR-101. Depois vá andando até chegar no trevo com a BR-101 e a BR-262. Bom lugar pra conseguir uma carona sentido Rio (BR-101) ou sentido BH (BR-262)","date":"2015-02-22","rating":4}],"destLat":null,"destLon":null},{"id":157,"lat":-18.9157,"lon":-42.0118,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2016-01-25","comments":[{"text":"Nos deram uma carona de dentro da cidade até aqui porque aparentemente é um pouco mais comum ter gente pedindo carona aqui. Tem uma árvore onde dá pra se esconder do sol (essa região é bem quente). Pedimos (1homem+1mulher) carona num domingo à tarde e a maioria das pessoas interagiam com a gente fazendo algum sinal de porque nao dariam carona (carro cheio, vao virar logo à frente, etc), o que geralmente torna tudo menos entediante. De qualquer maneira rapidinho um caminhoneiro sulista vindo do n","date":"2016-01-25","rating":4}],"destLat":null,"destLon":null},{"id":158,"lat":-23.0057,"lon":-44.2971,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-01-18","comments":[{"text":"Standing right next to the busstop, and was there for only 15 minutes.","date":"2016-01-18","rating":4}],"destLat":null,"destLon":null},{"id":161,"lat":-30.0121,"lon":-51.3156,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-12-21","comments":[{"text":"first bus leaves to 6.30 in the morning 12-2015","date":"2015-12-21","rating":4},{"text":"to north florianopolis\ngood spot to hichhike, found a ride just in 30 min.\nto get here take a local bus from main bus station in porto alegre. ask a ticket to (posto ipiranga)really close to eldorado do sul and then walk just 1,5 km untill the gas station, the ticket was 5,05 reais (12-2015)\ngood luck! :)","date":"2015-12-21","rating":4}],"destLat":null,"destLon":null},{"id":163,"lat":-19.4867,"lon":-42.5152,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2015-12-14","comments":[{"text":"Grande tráfego de veículos, acostamento e ponto de ônibus coberto. Ônibus circulares de Ipatinga passam por ali.","date":"2015-12-14","rating":4}],"destLat":null,"destLon":null},{"id":168,"lat":-15.7382,"lon":-48.3974,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-30","comments":[{"text":"Bom lugar para quem deseja sair de Brasília sentido Pirenópolis-GO. Para chegar aí, deve se tomar um ônibus para \"GIRASSOL\". Lá será fácil pegar carona.","date":"2015-10-30","rating":4}],"destLat":null,"destLon":null},{"id":170,"lat":-16.3438,"lon":-48.9038,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-30","comments":[{"text":"Posto da Polícia Rodoviária Federal","date":"2015-10-30","rating":4}],"destLat":null,"destLon":null},{"id":174,"lat":-29.8762,"lon":-50.2575,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Ponto de caminhões cegonha","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":175,"lat":-29.8846,"lon":-50.2707,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Posto de combustivel","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":177,"lat":-29.886,"lon":-50.4487,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Pedágio","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":178,"lat":-30.1109,"lon":-50.942,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"pedágio","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":179,"lat":-29.8646,"lon":-51.2518,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Policia Rodoviária Federal","date":"2015-10-28","rating":4}],"destLat":null,"destLon":null},{"id":184,"lat":-30.2425,"lon":-54.9204,"rating":4,"reviews":2,"wait":38,"signal":null,"lastUsed":"2015-09-17","comments":[{"text":"Nesse ponto tem um posto da PRF (Policia Rodoviária Federal). Aqui os carros passam lentamente, ótimo pra conseguir carona até o Uruguai.","date":"2015-09-17","rating":4}],"destLat":null,"destLon":null},{"id":185,"lat":-29.7076,"lon":-53.8814,"rating":4,"reviews":2,"wait":45,"signal":null,"lastUsed":"2015-09-17","comments":[{"text":"Um ponto interessante para o conseguir carona até Rosário do Sul ou alguma outra cidade mais abaixo.  Recomendo chegar na parte da manhã.","date":"2015-09-17","rating":4}],"destLat":null,"destLon":null},{"id":196,"lat":-27.7287,"lon":-52.2814,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"Um ótimo ponto pra pegar carona, sentido Passo Fundo. Em Erechim você pode tomar um ônibus que vá para a universidade UFFS. Chegando aqui nesse local, existe um espaço para os carros pararem.","date":"2015-08-26","rating":4}],"destLat":null,"destLon":null},{"id":202,"lat":-27.4702,"lon":-48.6413,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-08-10","comments":[{"text":"Posto da polícia rodoviária federal. Para o Norte do país (Curitiba, São Paulo, Minas Gerais...), saindo de Florianópolis, pegar o ônibus no terminal antigo do centro (Terminal Cidade de Florianópolis) para Governador Celso Ramos. pedir para parar no posto da PRF.","date":"2015-08-10","rating":4}],"destLat":null,"destLon":null},{"id":204,"lat":-30.1901,"lon":-52.3743,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[{"text":"ponto de beira de estrada. Sentido Uruguaiana. 20 minutos pedindo carona","date":"2015-07-16","rating":4}],"destLat":null,"destLon":null},{"id":205,"lat":-30.0433,"lon":-51.3353,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[{"text":"Peguei um ônibus na rodoviária até Eldorado do Sul. Pedi para descer no posto da PRF desativado. Lá, consegui uma carona em 15 minutos até a entrada de Santa Cruz do Sul.","date":"2015-07-16","rating":4}],"destLat":null,"destLon":null},{"id":207,"lat":-30.2301,"lon":-54.7279,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[{"text":"Bom ponto de carona. Consegui carona em 10 minutos até São Gabriel.","date":"2015-07-16","rating":4}],"destLat":null,"destLon":null},{"id":208,"lat":-26.8397,"lon":-48.714,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[{"text":"beira de estrada. faça sua plaquinha e fique em frente ao posto (sentido norte). em 20 minutos conseguimos uma carona até Curitiba.","date":"2015-07-16","rating":4}],"destLat":null,"destLon":null},{"id":212,"lat":-2.0575,"lon":-60.0214,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-06-22","comments":[{"text":"Bomba de gasolina , no tiene banquina pero pueden hablar com los motoristas cuando paran o tener suerte que alguno los vea y entre a la estacion para darnos carona","date":"2015-06-22","rating":4}],"destLat":null,"destLon":null},{"id":213,"lat":-2.9349,"lon":-60.0339,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-06-22","comments":[{"text":"De Manaus se puede tomar el bus 305 que va hasta el KM 41 a una pequena villa , ahi es um buen punto para hacer carona hacia figueiredo y Venezuela , el bus 305 pasa por la avenida Nery , pero com una frecuencia larga","date":"2015-06-22","rating":4}],"destLat":null,"destLon":null},{"id":215,"lat":-20.381,"lon":-43.5227,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-05-28","comments":[{"text":"[PT]\n\nEsse é um ótimo local para pegar carona, se quiser ir para Belo Horizonte. O ponto é exatamente depois da lomba/quebra mola. \n\n[EN]\n\nThis is a great place to catch a hitchhiking, if you want go to Belo Horizonte. The point is just after the bump / spring break.","date":"2015-05-28","rating":4}],"destLat":null,"destLon":null},{"id":216,"lat":-27.689,"lon":-48.731,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-05-24","comments":[{"text":"There is an Ipiranga gas station on the right side of the road for hitching towards the interior. You may want to take a bus from Florianopolis suburban bus terminal (the price was BRL 5 in january 2015).","date":"2015-05-24","rating":4}],"destLat":null,"destLon":null},{"id":218,"lat":-19.6538,"lon":-57.0241,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-04-22","comments":[{"text":"It's far away from city, but when we walk in the place after 10 min. car stop & we go in Campo Grande whit guy, hwo ive in Campo Grande & work in Corumba.","date":"2015-04-22","rating":4}],"destLat":null,"destLon":null},{"id":219,"lat":-14.1789,"lon":-47.8148,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-03-26","comments":[{"text":"bom para caronar antes do almoço de segunda a sexta , ou conversar com turistas no distrito , que são muitos.","date":"2015-03-26","rating":4}],"destLat":null,"destLon":null},{"id":221,"lat":-30.1237,"lon":-51.3489,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-03-06","comments":[{"text":"Good spot for hitchhing! My friend and I have got a ride to a gas station 30 km south of Guaíba. There we've got a nice ride directly to Uruguai. There are many cars going South to Pelotas or Uruguai.","date":"2015-03-06","rating":4}],"destLat":null,"destLon":null},{"id":222,"lat":-19.8412,"lon":-43.8719,"rating":4,"reviews":2,"wait":15,"signal":null,"lastUsed":"2015-03-03","comments":[{"text":"Os onibus mudaram. Para chegar nesse ponto eu peguei o metro até a Estação São Gabriel. Lá eu peguei o onibus 832 - Capitão Eduardo. Peça para te avisar quando chegar no Posto Beija-Flor. Caronei alguns minutos na frente do posto e logo consegui uma carona para Ipatinga","date":"2015-03-03","rating":4},{"text":"Dos melhores lugares pra se pedir carona saindo de BH para o leste mineiro (Ipatinga, Gov. Valadares), Salvador (BA) ou VitÃ³ria (ES) Ã© neste ponto ou na PM RodoviÃ¡ria que estÃ¡ alguns quilÃ´metros pra frente depois do trevo pra Santa Luzia.\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar os Ã´nibus:\n- 5502B (sentido CapitÃ£o Eduardo) na Rua Dos CaetÃ©s em frente ao nÃºmero 619.\nPeÃ§a para descer no Ãºltimo ponto da BR, que fica em frente a um posto de gasolina.\n\n(vou marcar o ponto da PM Rodov","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":224,"lat":-31.6683,"lon":-52.3399,"rating":4,"reviews":2,"wait":60,"signal":null,"lastUsed":"2015-02-20","comments":[{"text":"Posto da Polícia Rodoviária Federal. Melhor lugar pra pegar indo pra Porto Alegre e além.","date":"2015-02-20","rating":4}],"destLat":null,"destLon":null},{"id":227,"lat":-23.3141,"lon":-46.5822,"rating":4,"reviews":2,"wait":15,"signal":null,"lastUsed":"2015-02-13","comments":[{"text":"Bom para pegar carona para Atibaia. Em Atibai é mais facil conseguir carona para Minas Gerais","date":"2015-02-13","rating":4},{"text":"To hitchhike from SP to BH you can come to here (use google maps to help you getting to MairiporÃ£ by buses or subways).. i came with a friend and we spent some minutes here.. then we got a ride to Pouso Alegre\n\njust be aware about the rain in this area.. when it starts to rain in SÃ£o Paulo it hardly stops..\n\nVIDEO - HITCHHIKING FROM MAIRIPORÃƒ (SP) TO BELO HORIZONTE (MG)\nhttp://www.youtube.com/watch?v=IAKrplt1hIg","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":232,"lat":-29.1786,"lon":-54.8491,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-31","comments":[{"text":"HUGE petrol station/parking lot with lots of trucks and showers and WiFi. Great spot for hitchhiking towards the east, average-bad (but not impossible) towards the Argentinean border / Sao Borja.","date":"2015-01-31","rating":4}],"destLat":null,"destLon":null},{"id":235,"lat":-21.4759,"lon":-51.5144,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-26","comments":[{"text":"Há um posto, um radar e uma rotatória. Ótimo para caronas com carros pequenos e razoável para caminhões","date":"2015-01-26","rating":4}],"destLat":null,"destLon":null},{"id":240,"lat":-15.2075,"lon":-48.7025,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-19","comments":[{"text":"otimo lugar para caronas., tem muitos restaurantes e pontos de paradas de caminhoneiros e carros viajantes. e onde passam muitos caminhoes vindos de brasilia para Belem -PA","date":"2015-01-19","rating":4}],"destLat":null,"destLon":null},{"id":243,"lat":-21.7195,"lon":-44.989,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-16","comments":[{"text":"Portal de São Thomé. Bom lugar pra pedir carona pra Três Corações.","date":"2015-01-16","rating":4}],"destLat":null,"destLon":null},{"id":245,"lat":-20.7369,"lon":-42.8639,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-14","comments":[{"text":"Great place to Hitchike if your trying to reach Ponte Nova, Ouro Preto or Mariana.\nViçosa ins't a big city so you can go there by feet, if you're to lazy to do that there are many buses that go there.\n\nThe place is a speed bump next to bus stop.","date":"2015-01-14","rating":4}],"destLat":null,"destLon":null},{"id":248,"lat":-22.2399,"lon":-45.8818,"rating":4,"reviews":2,"wait":200,"signal":null,"lastUsed":"2015-01-10","comments":[{"text":"FUCK THIS POINT\n\nI had to spend the night under a pine tree because no one ever stopped. Got there 4PM and left 9AM the other day.","date":"2015-01-10","rating":4},{"text":"An excellent hitchhiking spot, good to reach Belo Horizonte and Sao Paulo, and, if you are thirst, you can go to gas station called auto-posto fernando over the Sao Paulo-headed lane and go to the tire store to get free cold water.\n\nUm Ã³timo ponto de carona tanto para quem vai para Belo Horizonte, quanto para quem vai para SÃ£o Paulo. e quem estiver com cede, pode ir na borracharia do posto fernanÃ£o e beber agua gelada de graÃ§a.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":250,"lat":-22.8427,"lon":-45.2244,"rating":4,"reviews":2,"wait":20,"signal":null,"lastUsed":"2015-01-08","comments":[{"text":"Atravessando o Santuario você chega na Dutra, andando direção Rio tem um posto de gasolina que da pra pedi carona. Da pra pedi carona também no trecho.","date":"2015-01-08","rating":4}],"destLat":null,"destLon":null},{"id":251,"lat":-22.7185,"lon":-43.7004,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-04","comments":[{"text":"Posto Novo Pedagio, you can get to this gas station by bus 193C from the bus terminal next to Central Station. It's a small gas station, but some trucks and cars stop, you can hitchhike to São Paulo.","date":"2015-01-04","rating":4}],"destLat":null,"destLon":null},{"id":256,"lat":-18.0657,"lon":-46.4578,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-12","comments":[{"text":"Posto na MG 410. Bom pra quem sobe sentido Patos de Minas, ou vai sentido 040. Rodovia movimentada e bom fluxo de caminhões.","date":"2014-12-12","rating":4}],"destLat":null,"destLon":null},{"id":257,"lat":-21.6752,"lon":-45.3394,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-12","comments":[{"text":"ou carona até o posto ou de busão \"amadeu alguma coisa\" do centro até lá 2,40","date":"2014-12-12","rating":4},{"text":"Para chegar aqui, pegue na rodoviaria o onibus 09 - Amadeu Miguel, peça pro cobrador te avisar no Posto do Trevo. Água gelada e um bom movimento de caminhão.","date":"2014-12-12","rating":4}],"destLat":null,"destLon":null},{"id":260,"lat":-19.3545,"lon":-46.1348,"rating":4,"reviews":2,"wait":20,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Posto na Entrada de São Gotardo. Fluxo grande de caminhões que saem pra SP. O posto é tranquilo.","date":"2014-12-11","rating":4}],"destLat":null,"destLon":null},{"id":263,"lat":-18.6396,"lon":-46.4856,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Ponto na saída, sentido Fernão Dias. Pra sair da cidade pegue um coletivo Industrial, mas desça antes do trevo e caminhe até a Fábrica de cimentos. \nOu pegue um ônibus na rodoviária até a Pamonharia!","date":"2014-12-11","rating":4}],"destLat":null,"destLon":null},{"id":268,"lat":-15.8897,"lon":-48.0857,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"I'm not sure if there is a good place, the cars pass up 130 km/h, i guess the better idea go to Policia Rodoviária Station some kilometers ahead, taking a bus to Santo Antotônio do Descoberto. Like describle at the spot ahead.","date":"2014-12-11","rating":4},{"text":"Direction Goiania - take a metro to Sambaia and get off at the last station. From there it's a 15-min walk to the spot. When you reach the metro station, exit on the left side after the turnstiles (http://tinyurl.com/m6pykog), walk in the same direction that the train you came with is going until you reach Avenida 1 Norte. Follow it all the way until BR060.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":269,"lat":-15.5997,"lon":-47.678,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Take a bus to \"Planaltina\", ask to stop at \"ITIQUIRA GAS STATION\", there is a speed bumps.","date":"2014-12-11","rating":4}],"destLat":null,"destLon":null},{"id":270,"lat":-22.7899,"lon":-42.5419,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Been there twice with a friend and wait less then 30 minutes to get a ride to Rio de Janeiro. We took a bus at Estrada Araruama Rio Bonito that costs around R$ 5,00, you must left the bus right after Police Station.","date":"2014-12-11","rating":4}],"destLat":null,"destLon":null},{"id":271,"lat":-22.9283,"lon":-49.9093,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Bom lugar para pegar carona, para quem estiver indo para São Paulo (Capital) ou o norte do Paraná.\nEste posto é 24h. Da para tentar pegar carona durante a noite.\nJá tive que passar a noite neste posto, todavia eu estava sem barraca. Fiquei na lanchonete, até o amanhecer. Creio que seja tranquilo para quem for acampar, é só conversar com o pessoal do posto.\n\nhttp://relatosdeummochileiro.blogspot.com.br/","date":"2014-12-11","rating":4}],"destLat":null,"destLon":null},{"id":272,"lat":-23.4086,"lon":-46.5807,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-10-31","comments":[{"text":"There is a gas station. It is not very big, but you can definitely get a ride till the next bigger one.\nIt is easy to get there with a bus, it takes, however, a lot of time (around an hour ride).\nBus 1783-10 you can take from the metro L1 Santana station, it departs every 20 minutes. Bus 2023-10 departs from the same metro line L1, but three stations further north, Tucuruvi. Check google maps to be sure where to take the bus, and if the route still exists. Ask the driver for Rodoviaria Fernão Di","date":"2014-10-31","rating":4}],"destLat":null,"destLon":null},{"id":273,"lat":-22.0518,"lon":-47.8667,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-09-04","comments":[{"text":"Google maps: -22.052808, -47.867515\nGood spot. I got a ride to Bauru in less than 30 min.","date":"2014-09-04","rating":4}],"destLat":null,"destLon":null},{"id":274,"lat":-21.7863,"lon":-47.0659,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-09-04","comments":[{"text":"Very good spot to go to Sao Carlos","date":"2014-09-04","rating":4}],"destLat":null,"destLon":null},{"id":275,"lat":-21.4946,"lon":-47.0139,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-09-04","comments":[{"text":"Coordinates google maps: -21.493487, -47.013346\nGood spot. I got a ride to Casa Branca in 30 min.","date":"2014-09-04","rating":4}],"destLat":null,"destLon":null},{"id":276,"lat":-23.1254,"lon":-46.953,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-09-04","comments":[{"text":"-23.129553, -46.950233","date":"2014-09-04","rating":4}],"destLat":null,"destLon":null},{"id":278,"lat":-30.0235,"lon":-51.2185,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-08-18","comments":[{"text":"There place is one of the majors exits of the city, where many drivers go to take the Highway BR-290 to West or East, or the Highway BR-116 to North.\n\nThe best place to ask a ride is in front of the Continental Hotel because it is between two traffic lights and the drivers go slowly and they can stop for you.","date":"2014-08-18","rating":4}],"destLat":null,"destLon":null},{"id":279,"lat":-29.9959,"lon":-51.1885,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-08-18","comments":[{"text":"There is a gas station where drivers stop before going to North (Highway BR-116) and East (Highway BR-290), mainly at weekends.\n\nIt's not allowed to ask a ride near the fuel pumps, but you can do it on the gas station exit. It's a secure place, with many surveillance cameras.","date":"2014-08-18","rating":4}],"destLat":null,"destLon":null},{"id":280,"lat":-20.0772,"lon":-43.9824,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-10","comments":[{"text":"There is a good gas station where truckers stop to sleep and you can find many of them early in the morning toward Rio de Janeiro. I got there at 9AM and there were just few of them. I recomend getting there at 6 AM. I got a ride in 1 hour. To get there you have to take a bus 3933 or 3910 in Belo Horizonte in front of the \"Parque Municipal\".","date":"2014-06-10","rating":4}],"destLat":null,"destLon":null},{"id":282,"lat":-22.5168,"lon":-43.23,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Take a bus 100 (dir. Terminal Bingen) from the rodoviaria in the city center and go until the end of the line (2,80 reais). The highway is just in front of the terminal. It's not a very safe place, the road has many turnings and there's no point walking up the road because there are no safer spots anywhere nearby. Our driver pulled over just because nobody would probably stop in such a dangerous place.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":283,"lat":-13.7829,"lon":-50.3392,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"A lot of place for the cars to stop but but a lot of traffic, 1,5 h waiting and a ride to the Araguacu (TO), invited to his place and brought to Alvorada the following day.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":292,"lat":-14.2143,"lon":-39.5164,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Small town, not many cars, better to hitch while walking.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":294,"lat":-13.8716,"lon":-40.0454,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"For rides direction Ipiau, walk all you can until you see there are no more residential areas. There are some slightly outside the city and many drivers were indicating they were turning soon.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":295,"lat":-12.4811,"lon":-49.116,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Towards Peixe and Natividade. This is a small road, sometimes in very bad condition and with not much traffic but we managed to get a ride to Natividade in less than 10 minutes.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":299,"lat":-15.9303,"lon":-50.1377,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"An easy walk from the center to reach a spot direction Nova Crixas. Not so much traffic though.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":300,"lat":-16.3442,"lon":-48.9731,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Direction Neropolis. No point going too far along the road since it's quite curvy with limited visibility.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":306,"lat":-21.1001,"lon":-47.7887,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Endereço Posto do Trevo - gas station at the city exit, asking around was futile but standing on the road with a sign scored us a ride to Uberlandia in 20 minutes.","date":"2014-06-05","rating":4}],"destLat":null,"destLon":null},{"id":310,"lat":-10.1436,"lon":-48.8859,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-03","comments":[{"text":"Even though this spot is in the north of Paraiso, there is a good gas station  (I was told it is the best one) to get a ride to the south. There is also in front of the gas station a speed bump, ideal to hitchhike. I got a ride to Brasilia in around 1 hour.","date":"2014-06-03","rating":4}],"destLat":null,"destLon":null},{"id":311,"lat":-14.9798,"lon":-40.9195,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-05-27","comments":[{"text":"O melhor ponto para pedir carona em Vitoria da Conquista sentido Minas é um posto policial que fica as margens da 116 a cerca de 2.¹/² Km do Atacadão e do anel viário, Boa sorte!","date":"2014-05-27","rating":4}],"destLat":null,"destLon":null},{"id":314,"lat":-1.3655,"lon":-48.3353,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-05-23","comments":[{"text":"It's a good spot to go to north-east (Fortaleza, Recife, Maranhao). There is a gas station full of tracks. I wanted to go to  the south, but I was offered 3 rides to go to north-east. After many hours I got a ride to the south. To get there from the center you can get a bus to Marituba that drop you off one block from the gas station.","date":"2014-05-23","rating":4}],"destLat":null,"destLon":null},{"id":316,"lat":-11.2843,"lon":-37.4507,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2014-04-10","comments":[{"text":"Where the BR 101 connects to what becomes the BR 99. There is a 24 hour gas station with nice employees, not too much movement in the gas station but you can hold a sign right outside to go North to Aracajú, Maceio, and Recife or South to Salvador and Feira de Santana). The only thing I didn't like about this place is that its still in the middle of the city so at night it might not be so fun as a girl alone. But got rides within 30 minutes north and south","date":"2014-04-10","rating":4}],"destLat":null,"destLon":null},{"id":317,"lat":-20.4788,"lon":-54.7658,"rating":4,"reviews":2,"wait":90,"signal":null,"lastUsed":"2014-04-07","comments":[{"text":"gas station\nI think it's a very good spot to go to Bolivia or Corumba\nthe problem is that drugs come from Bolivia to Brasil on this road so be carreful!\n\nI get some difficulty to get a lift because I hitchhiked a sunday, when everyone is ont the church or doing some bbq","date":"2014-04-07","rating":4}],"destLat":null,"destLon":null},{"id":319,"lat":-15.6572,"lon":-55.9816,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2014-04-03","comments":[{"text":"Very good spot!\nbig gas station with a lot or trucks!\ngo early in the morning caus truck are leaving around 4 and 7 am\nmost of the truck are going north, but you can get a ride to rononopolis","date":"2014-04-03","rating":4}],"destLat":null,"destLon":null},{"id":321,"lat":-12.4459,"lon":-37.9504,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-03-26","comments":[{"text":"North or south, the Linha Verde BR 099 goes from Salvador to Estância in Sergipe, South of Aracajú. From Salvador to Conde most cars are going short distances, going for the small beach towns, So I spent a few hours waiting  but everyone wanted to talk to me and help me out.\n\nO BR 099 vai de Salvador até Estância em Sergipe, perto de Aracajú (lá encontra com o BR101). De Salv até Conde a maioria dos carros estão indo pra praias e não estão indo muito longe. Esperei algumas horas esperando, más t","date":"2014-03-26","rating":4}],"destLat":null,"destLon":null},{"id":338,"lat":-12.5569,"lon":-41.3801,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[{"text":"Walk until the end of the town for rides to BR242.","date":"2014-03-05","rating":4}],"destLat":null,"destLon":null},{"id":359,"lat":-27.5262,"lon":-48.6348,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-02-03","comments":[{"text":"Posto Ampesan\nThe gas station is large and full of stopping cars and trucks going in both directions.\nTo get there from Florianópolis, take a bus from TICEN bus terminal or the  Terminal Cidade de Florianópolis. The bus company is called Biguaçu: http://www.biguacutransportes.com.br/","date":"2014-02-03","rating":4}],"destLat":null,"destLon":null},{"id":368,"lat":-5.8675,"lon":-35.3681,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-01-09","comments":[],"destLat":null,"destLon":null},{"id":372,"lat":-16.2459,"lon":-47.9059,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-01-01","comments":[{"text":"Pegue um ônibus para Luziânia, peça para desçer em frente a garagem da VIAÇÃO ANAPOLINA, caminhe alguns metros de volta a BR 040, lá é um bom lugar.","date":"2014-01-01","rating":4}],"destLat":null,"destLon":null},{"id":373,"lat":-22.9067,"lon":-47.0584,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-12-16","comments":[{"text":"Going to Sao Paulo, you can stand in the road where the Don Pedro II crossis a urban avenue. Many cars take the avenue, so in that point you meet directly with cars and trucks going to Sao Paulo. I got there by car, so don't know exactly how to do it by public transportation. It's further than the shopping.","date":"2013-12-16","rating":4}],"destLat":null,"destLon":null},{"id":375,"lat":-28.6812,"lon":-49.3758,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2013-12-16","comments":[{"text":"On the road BR 101, in the area of Criciuma, there is a gas station Ipiranga. Employees can talk to truck drivers and hitch hike for you if you are nice, smile and seem to be quiet.","date":"2013-12-16","rating":4}],"destLat":null,"destLon":null},{"id":377,"lat":-15.5748,"lon":-54.3252,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-12-03","comments":[{"text":"Fuel station called Alvorada. You find there trucks a lot. The problem is so many are waiting for taking on the freight, but you find road sure.","date":"2013-12-03","rating":4}],"destLat":null,"destLon":null},{"id":378,"lat":-20.3626,"lon":-40.4295,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-10-22","comments":[{"text":"Transportadora Belmok (near transportadora Jolivan). Take the street by Jolivan and after 150 m you find Belmok. There you can find trucks to Bahia, Sao Paulo, Rio de Janeiro, Belo Horizonte, Brasilia.... everywhere. You can talk with watchman and he left you stay in the door of the company (more or less 30 trucks for day).  In Jolivan is the same. In front of Jolivan there is a gasoline station with too many trucks too.","date":"2013-10-22","rating":4}],"destLat":null,"destLon":null},{"id":381,"lat":-20.1329,"lon":-42.466,"rating":4,"reviews":2,"wait":45,"signal":null,"lastUsed":"2013-09-07","comments":[{"text":"cidade muito quente. E depois que você sai da BR de maior fluxo de carros, a via que leva você até a cidade de Vitória, o tempo de carona aumenta consideravelmente.","date":"2013-09-07","rating":4},{"text":"Para sair de Raul Soares pedindo carona, você pode vir até esse ponto. Para chegar aqui, você precisa informar a quem estiver te levando que você deseja ir até o quebra-molas da Fazenda Santana. Se você não tiver ninguém que possa te trazer até aqui, a opção que te resta é ir caminhando pela cidade indo rumo ao Parque de Exposição, daí você vai pedindo carona por todo o caminho, talvez vc consiga antes de chegar lá. Se você chegar lá e ainda assim estiver difícil, você pode caminhas uns quilômet","date":"2012-12-18","rating":4}],"destLat":null,"destLon":null},{"id":384,"lat":-9.0131,"lon":-35.2252,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Um bom posto de combustível para se pegar carona para quem está indo rumo à Recife. Demorei em torno de uns 45 minutos, pois o fluxo de automóveis estava fraco.\n\nhttp://relatosdeummochileiro.blogspot.com.br/","date":"2013-07-29","rating":4}],"destLat":null,"destLon":null},{"id":404,"lat":-21.8205,"lon":-43.3763,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-01-14","comments":[{"text":"It's very easy to hitchhike to Rio from this spot. I'v tried several times, and I never stayed more than 15min.","date":"2013-01-14","rating":4},{"text":"I hitchhiked here with a friend... well, we just took a bus from the Juiz de Fora downtown to Salvaterra.\n\nOUR EXPERIENCE:\nit was afternoon and we were two guys. maybe that were the problem. we spent something like 2hours hitching rides there, and we walked many meters ahead and had to keep distant one from the other to make it more easy to get a ride (coz they wouldn't think we were together).\nso, two cars stoped and they were both going to Rio.. we gone with the second one with 2 places.\n\nso, ","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":407,"lat":-27.7828,"lon":-50.2533,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-01-11","comments":[{"text":"Good for leaving Lages and going to Florianópolis.","date":"2013-01-11","rating":4}],"destLat":null,"destLon":null},{"id":408,"lat":-28.4999,"lon":-50.919,"rating":4,"reviews":2,"wait":20,"signal":null,"lastUsed":"2013-01-11","comments":[{"text":"Plenty of cars going in many directions, specially Lages and the coast.","date":"2013-01-11","rating":4}],"destLat":null,"destLon":null},{"id":410,"lat":-28.3862,"lon":-53.2589,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-01-11","comments":[{"text":"There is a good shade under a tree close to the roundabout where you can wait for cars.","date":"2013-01-11","rating":4}],"destLat":null,"destLon":null},{"id":414,"lat":-19.8383,"lon":-43.1844,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2012-12-18","comments":[{"text":"people heading to Belo Horizonte use to hitchhike here. there's a place to the cars to stop for you after a bump. i'm seen in the map that there's another junction just some kilometers after this spot (Av. Alberto Lima) maybe that's a better place to hitchhike as a lot people not leaving the city must be filtered here. \n\nIn the spot i pointed, i guess i generally wait around 40minutes for someone to stop.","date":"2012-12-18","rating":4}],"destLat":null,"destLon":null},{"id":415,"lat":-20.2103,"lon":-42.6609,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2012-12-18","comments":[{"text":"To get off Rio Casca you should come to this junction where the cars going to Belo Horizonte goes straight and the cars going to Ponte Nova/Ouro Preto turn the left and you get less people telling you \"I'm not going to your direction, sorry\"","date":"2012-12-18","rating":4}],"destLat":null,"destLon":null},{"id":421,"lat":-27.6007,"lon":-48.4813,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-07","comments":[{"text":"If you're up here for the view, the paragliding or just stopped to rest, this is a good place to get a ride to almost anywhere. Many people stop to see the Lagoa from the vantage point, shop, etc. If you're up here, it's the most obvious place.","date":"2011-10-07","rating":4}],"destLat":null,"destLon":null},{"id":422,"lat":-27.5298,"lon":-48.5137,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-07","comments":[{"text":"Good place to hitch-hike from if you're making your way South. It offers space and some cars tend to go slower since it's a the top of the elevation.","date":"2011-10-07","rating":4}],"destLat":null,"destLon":null},{"id":425,"lat":-27.6192,"lon":-48.5283,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"Entrance of the parking area is good for anyone going to South of the island.","date":"2011-10-04","rating":4}],"destLat":null,"destLon":null},{"id":427,"lat":-27.5754,"lon":-48.5263,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"Good place to go to many directions since it is both the exit of a pretty cheap gas station and a very large supermarket","date":"2011-10-04","rating":4}],"destLat":null,"destLon":null},{"id":428,"lat":-27.5731,"lon":-48.513,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"Great place to hitchhike to the Northern part of the island since it's on the main state road and offers plenty of space for drivers to stop.","date":"2011-10-04","rating":4}],"destLat":null,"destLon":null},{"id":429,"lat":-27.5972,"lon":-48.4909,"rating":4,"reviews":2,"wait":10,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"Big area for the bus to stop. Makes a good location since the only way people are going is at least towards Lagoa da Conceicao.","date":"2011-10-04","rating":4}],"destLat":null,"destLon":null},{"id":430,"lat":-27.6001,"lon":-48.5164,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"You might have to compete with university students during peak times.","date":"2011-10-04","rating":4},{"text":"You can always get a ride to Lagoa here in less than 10 minutes.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":438,"lat":-22.771,"lon":-42.9159,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2010-12-02","comments":[{"text":"I left Niteroi by bus to take a ride to Casimiro de Abreu. I wait less the 1h.","date":"2010-12-02","rating":4}],"destLat":null,"destLon":null},{"id":439,"lat":-5.6109,"lon":-36.881,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"A gas station, with free cofee, free bath and wather and cheap food.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":441,"lat":-27.6387,"lon":-48.6667,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"From Floripa hitching south take a Bus to Palhoca and go to the last station, it is close to the BR101 and there is also a gasstation!","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":443,"lat":-19.9934,"lon":-43.959,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"Saindo de BH para o Ouro Preto (MG) ou para o Rio de Janeiro vocÃª pode pedir carona aqui. Este Ã© o trevo onde a BR040 e BR356 se encontram. JÃ¡ pedi carona aqui com uma garota, e outra vez com um garoto, e ambas as vezes levou um pouco mais de tempo que o comum (nÃ£o que tenha demorado muito..)\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar os Ã´nibus:\n- S10 em qualquer lugar no Anel RodoviÃ¡rio\n- 2004 em pontos da av. Afonso Pena ou PraÃ§a da Liberdade\n- 3050 na rua Rio Grande do Norte nÃºmer","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":444,"lat":-19.9874,"lon":-44.2042,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"O melhor lugar pra se pedir carona saindo de BH para o TriÃ¢ngulo Mineiro (Uberaba, UberlÃ¢ndia) ou para SÃ£o Paulo Ã© neste ponto, no trevo onde a BR262 e BR381 se separam e os carros sÃ£o filtrados, cada um segue pro seu lado.\n\nCOMO CHEGAR\nPra chegar aqui, vocÃª pode pegar Ã´nibus para a Morada do Trevo (Betim) na av. OlegÃ¡rio Maciel, 742 no centro de BH. NÃ£o tenho certeza do nÃºmero do Ã´nibus, mas Ã© um desses trÃªs (vocÃª deve perguntar pra ter certeza!): 3292, 3297 ou 3298. PeÃ§a para de","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":445,"lat":-22.121,"lon":-43.1575,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"From TrÃªs Rios to Juiz de Fora or Belo Horizonte you can hitchhike here..\nthere's a police and a gas station here and it were really easy to get a ride here (but the driver said the police here are boring)","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":2,"lat":-11.6278,"lon":-46.781,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"There is a speed bump by the gas station  perfect to hitchhike, I found a truck driver all the way to Palmeiras ( Bahia)","date":"2026-01-08","rating":4}],"destLat":-12.4792,"destLon":-41.3577},{"id":7,"lat":-3.1785,"lon":-52.1839,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"Got a ride in 5 min. I was asking people directly at the gas station and got a ride to Maraba","date":"2026-01-08","rating":4}],"destLat":-5.3463,"destLon":-49.1007},{"id":8,"lat":-2.4799,"lon":-54.682,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"Was hitchhiking with a sign on the road outside of the gas station ( no much traffic at the gas station) and a car drove me alll the way to Altamira ( Para)","date":"2026-01-08","rating":4}],"destLat":-3.2041,"destLon":-52.21},{"id":10,"lat":-18.9295,"lon":-48.1912,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-10-25","comments":[{"text":"Depoia de tentar por mais de três horas debaixo das mangueiras da rotatória anterior, aqui encontrei minha sorte. Uma direra pra BH, comecei a pegar gosta pela Adrnalina, ainda mais depois que começamos a entrar na metropolitana. Nunca tinha visto uma metropolitana tão industrial, tensa e intensa na minha vida. Com tantos morros e desmorros.","date":"2025-10-25","rating":4}],"destLat":-19.9448,"destLon":-44.0409},{"id":12,"lat":-18.6929,"lon":-48.1816,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-10-25","comments":[{"text":"Me deixarem ba prf porque pensei que tivesse um quebra-molas. Mas ele parecia bem esbagaçado então não reduzia em nada a velocidade. Não sei hoje. Alternarivas seriam o quebra-molas na saída de Araguari antes da BR e o Posto se Gasolina. Achar alguém indo a Uberlândia ou mesmo Uberaba deve ser bem fácil.","date":"2025-10-25","rating":4}],"destLat":-18.912,"destLon":-48.2238},{"id":13,"lat":-18.183,"lon":-47.9433,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-10-23","comments":[{"text":"Minha primeira carona notrna, indo pra Araguari a partir de Gyn, Aqui deveria ter um quebra-molas e ou um sensor de velocidade.  Tentei depois da rotatória e não foi muito bom, na saída do posto JK também é possível. Mas se ainda houver um dos dois reguladores de velocidade será bem melhor.  Aqui usei uma plaquinha. Me parou uma mãe com uma filha cantora que tentaria the voice brasil, mas nunca vi, Não sei qual foi o resultado.\r\n\r\nPassaria por Catalão algumas outras vezes na minha vida. Quase se","date":"2025-10-23","rating":4}],"destLat":-18.658,"destLon":-48.1935},{"id":20,"lat":-2.9556,"lon":-41.7227,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-07-11","comments":[{"text":"We got there by taxi with the app \"Ubiz car Brazil\" for 16R$. There are not so many cars but they all go in the right direction and don't go that fast. There is no signal but \"bar do limão\" might have Wi-Fi.","date":"2025-07-11","rating":4}],"destLat":-3.0807,"destLon":-41.445},{"id":22,"lat":-16.1986,"lon":-57.5783,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-05-28","comments":[{"text":"Trucks are coming out of the quarry regularly. There is a restaurant, Wi-Fi, and a bathroom. The vehicles on the road pass by fast, but you can ask the truck drivers going out of the quarry. Beware of the sun!","date":"2025-05-28","rating":4}],"destLat":-8.7995,"destLon":-63.837},{"id":25,"lat":-25.3445,"lon":-51.4422,"rating":4,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-05-02","comments":[{"text":"We wanted to go to Foz do Iguaçu so it may have been better to hitch at the exit of Guarapuava instead of the entrance. The spot near the roundabout is great because it's after a speed bump on the highway. You can signal to the drivers on the highway, and those who exit the gas station. There is enough space for cars and truck to park for a few minutes.\r\n\r\nWe got a ride from a truck driver to Foz do Iguaçu! 🚚","date":"2025-05-02","rating":4}],"destLat":-25.454,"destLon":-54.4201},{"id":26,"lat":-25.041,"lon":-50.2674,"rating":4,"reviews":1,"wait":null,"signal":"ask","lastUsed":"2025-05-02","comments":[{"text":"We talked with truck drivers while looking for a cardboard. One of them proposed to take us to Guaratuba!","date":"2025-05-02","rating":4}],"destLat":-25.3446,"destLon":-51.4422},{"id":28,"lat":-25.4335,"lon":-49.4088,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-04-30","comments":[{"text":"Accessible by bus J62 from Curitiba, a lot of truck drivers stop there as it's the first gas station after Curitiba.","date":"2025-04-30","rating":4}],"destLat":-25.0796,"destLon":-50.1878},{"id":30,"lat":-12.4711,"lon":-41.0976,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-04-25","comments":[{"text":"Bus stop to shelter from rain or sun","date":"2025-04-25","rating":4}],"destLat":-12.5622,"destLon":-41.39},{"id":33,"lat":-12.1473,"lon":-40.3685,"rating":4,"reviews":1,"wait":100,"signal":"thumb","lastUsed":"2025-04-24","comments":[{"text":"Perfect spot, place to stop and car have to slow down but very few traffic","date":"2025-04-24","rating":4}],"destLat":-12.2953,"destLon":-40.5154},{"id":36,"lat":-11.3918,"lon":-40.0164,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-04-24","comments":[{"text":"Lots of bumper to slow down cars\r\nA motorcycle took me for a long ride \r\nHappy I’m still alive","date":"2025-04-24","rating":4}],"destLat":-11.6126,"destLon":-40.1375},{"id":37,"lat":-3.0784,"lon":-41.2558,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-04-20","comments":[{"text":"State border office\r\nCar have to slow down\r\nBathrooms available","date":"2025-04-20","rating":4}],"destLat":-2.918,"destLon":-41.7546},{"id":67,"lat":-13.5119,"lon":-40.0488,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-10-03","comments":[{"text":"Posto 24 horas para pernoitar caso não consiga carona, porém com muitos caminhoneiros que param aqui","date":"2023-10-03","rating":4}],"destLat":-13.5119,"destLon":-40.0488},{"id":77,"lat":-27.5437,"lon":-48.5226,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-09-03","comments":[],"destLat":null,"destLon":null},{"id":84,"lat":-21.3179,"lon":-41.8665,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-07-24","comments":[],"destLat":null,"destLon":null},{"id":106,"lat":-18.3003,"lon":-39.9574,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[],"destLat":null,"destLon":null},{"id":135,"lat":-23.434,"lon":-46.4259,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[],"destLat":null,"destLon":null},{"id":137,"lat":-20.1574,"lon":-43.9615,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[],"destLat":null,"destLon":null},{"id":149,"lat":-9.7738,"lon":-35.8526,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-02-22","comments":[],"destLat":null,"destLon":null},{"id":159,"lat":-19.9916,"lon":-44.2073,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-01-12","comments":[],"destLat":null,"destLon":null},{"id":162,"lat":-23.0921,"lon":-46.5728,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-12-15","comments":[{"text":"Peguei no posto gigio foi bem tranquilo e rápido.","date":"2015-12-15","rating":4}],"destLat":null,"destLon":null},{"id":186,"lat":-19.84,"lon":-43.1802,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-09-02","comments":[],"destLat":null,"destLon":null},{"id":188,"lat":-20.6815,"lon":-44.0544,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":189,"lat":-20.6269,"lon":-43.9563,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":192,"lat":-20.3878,"lon":-43.4269,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":193,"lat":-29.9689,"lon":-51.1668,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":200,"lat":-21.1003,"lon":-42.9492,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"Plaquinhas para Viçosa sempre dão uma força na hora de conseguir, por mais que o seu destino seja antes ou depois.","date":"2015-08-26","rating":4}],"destLat":null,"destLon":null},{"id":210,"lat":-26.8885,"lon":-48.7217,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[],"destLat":null,"destLon":null},{"id":220,"lat":-23.4729,"lon":-47.43,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2015-03-25","comments":[],"destLat":null,"destLon":null},{"id":225,"lat":-32.0771,"lon":-52.2724,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-02-20","comments":[],"destLat":null,"destLon":null},{"id":226,"lat":-2.548,"lon":-44.26,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-02-15","comments":[],"destLat":null,"destLon":null},{"id":230,"lat":-21.2634,"lon":-43.1664,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-02-05","comments":[],"destLat":null,"destLon":null},{"id":252,"lat":-22.8227,"lon":-43.0388,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-12-27","comments":[],"destLat":null,"destLon":null},{"id":255,"lat":-23.6517,"lon":-46.5796,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-12-12","comments":[],"destLat":null,"destLon":null},{"id":265,"lat":-23.6829,"lon":-52.6183,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[],"destLat":null,"destLon":null},{"id":323,"lat":-17.8302,"lon":-40.3639,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":327,"lat":-14.6181,"lon":-39.3312,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":328,"lat":-14.7529,"lon":-39.0675,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":329,"lat":-14.4774,"lon":-39.0318,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":331,"lat":-13.0449,"lon":-39.006,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":332,"lat":-12.9503,"lon":-38.632,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":344,"lat":-2.7279,"lon":-42.5309,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":347,"lat":-1.2174,"lon":-47.1963,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":348,"lat":-2.098,"lon":-45.9191,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":349,"lat":-2.5148,"lon":-45.0828,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":352,"lat":-2.5223,"lon":-54.7229,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":353,"lat":-8.3398,"lon":-55.0972,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":354,"lat":-10.3698,"lon":-54.5671,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":355,"lat":-10.1873,"lon":-54.944,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":357,"lat":-9.2824,"lon":-49.9518,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":361,"lat":2.8589,"lon":-60.6985,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2014-01-29","comments":[],"destLat":null,"destLon":null},{"id":390,"lat":-27.6073,"lon":-48.5198,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-07-28","comments":[],"destLat":null,"destLon":null},{"id":403,"lat":-27.6328,"lon":-48.4716,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-02-03","comments":[],"destLat":null,"destLon":null},{"id":417,"lat":-22.7183,"lon":-42.0226,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2012-11-22","comments":[],"destLat":null,"destLon":null},{"id":418,"lat":-29.248,"lon":-51.2051,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2011-10-23","comments":[],"destLat":null,"destLon":null},{"id":431,"lat":-20.756,"lon":-43.0312,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2011-04-30","comments":[],"destLat":null,"destLon":null},{"id":434,"lat":-14.8235,"lon":-39.2924,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2011-04-01","comments":[],"destLat":null,"destLon":null},{"id":5,"lat":-10.7281,"lon":-48.9036,"rating":3.5,"reviews":2,"wait":5,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"Easy to get a ride to Porto National with a sign ( 5min )","date":"2026-01-08","rating":4}],"destLat":-10.7348,"destLon":-48.3989},{"id":287,"lat":-18.8319,"lon":-41.9892,"rating":3,"reviews":4,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Not very good for rides south, the posto is just before a curve with not much space for the cars to stop.","date":"2014-06-05","rating":1},{"text":"Este posto é otimo para se pegar carona. Peguei carona para ir rumo ao Nordeste pela BR-116, quanto para ir à Ipatinga - Mg.","date":"2013-07-29","rating":5}],"destLat":null,"destLon":null},{"id":6,"lat":-5.3616,"lon":-49.0781,"rating":3,"reviews":3,"wait":20,"signal":"sign","lastUsed":"2026-01-08","comments":[{"text":"I was Hitchiking with a sign outside  of the gas station , on the road directly because  there is almost no traffic at the gas station. Got picked up by aa Truckdriver who was  going to Mina Girais but jumped out at Oliveira de Fatima because  was going  to Bahia","date":"2026-01-08","rating":3},{"text":"Although there is a good place for cars to park and cars go slow throw here, this spot is not so good, because there is no gas station here and according to my experience in Brasil, is pretty hard hitchhiking on the road. However I was lucky and I got a car that took me to Sao Domingo, where there is a direct road to the south.","date":"2014-05-27","rating":3}],"destLat":-10.7287,"destLon":-48.9042},{"id":389,"lat":-23.2764,"lon":-51.2401,"rating":3,"reviews":3,"wait":null,"signal":null,"lastUsed":"2013-07-29","comments":[{"text":"Para quem está indo à Assis - SP, este posto de gasolina não é muito bom para pegar carona, na próxima vez irei pela BR-369, pois fiquei esperando 1h30 por uma carona. Para quem vai para Curitiba, há um grande fluxo de caminhões que saem deste posto para lá.","date":"2013-07-29","rating":3}],"destLat":null,"destLon":null},{"id":87,"lat":-12.8597,"lon":-38.2863,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-23","comments":[{"text":"In Shell gas station","date":"2016-07-23","rating":3}],"destLat":null,"destLon":null},{"id":90,"lat":-20.2116,"lon":-40.3184,"rating":3,"reviews":2,"wait":60,"signal":null,"lastUsed":"2016-07-21","comments":[{"text":"Good place for hitchhikers , region passing vehicles to the northeast, south and southeast. The good place is the output of the gas station and direct approach to drivers stopped at the station . The vehicles do not pass many slowly , so eye contact is impaired.\n\nTo reach the site should take any bus in Carapina terminal passing through the CONTOURNO and jump in Serramar post.","date":"2016-07-21","rating":3}],"destLat":null,"destLon":null},{"id":102,"lat":-20.1764,"lon":-40.2656,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-14","comments":[{"text":"Locals menntioned this gas staion is a good spot to hitchhike north.","date":"2016-07-14","rating":3}],"destLat":null,"destLon":null},{"id":103,"lat":-20.1815,"lon":-40.2652,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-14","comments":[{"text":"There's a gas station a bit far north that make more sense but there's space for cars to stop here. I waited about 20 min","date":"2016-07-14","rating":3}],"destLat":null,"destLon":null},{"id":105,"lat":-18.7149,"lon":-39.8771,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-14","comments":[{"text":"You can find locals hitchhiking north too. There's no shade but I only waited 15 min or so...","date":"2016-07-14","rating":3}],"destLat":null,"destLon":null},{"id":108,"lat":-14.4639,"lon":-39.0402,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"A few meters passed a bus stop, safe place where cars can stop and slow down near a bumper","date":"2016-07-13","rating":3}],"destLat":null,"destLon":null},{"id":109,"lat":-14.2277,"lon":-39.0933,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-13","comments":[{"text":"Didn't hitch here but locals said it was a good spot to get to Camamu, where it's easier/faster to get a boat to Barra Grande. or just hitch north towards Salvador, or south to Ilheus/Itacare","date":"2016-07-13","rating":3}],"destLat":null,"destLon":null},{"id":126,"lat":-31.4167,"lon":-52.1719,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-15","comments":[{"text":"I am not sure if it is this point, but... \nIt is in front of a gas station where there are many trucks. Depending of the time, they are going to Pelotas or Camaquã. We were there around 1pm and trucks were going to Camaquã and cars are full of families or people in their fancy and empty cars.. ahhaha.. so we wait for 1 hour.","date":"2016-05-15","rating":3}],"destLat":null,"destLon":null},{"id":130,"lat":-8.3988,"lon":-35.0614,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-04-28","comments":[{"text":"Encontrei dificuldade porque o pessoal de lá não foi nada amigável.","date":"2016-04-28","rating":3}],"destLat":null,"destLon":null},{"id":140,"lat":-21.1455,"lon":-44.2296,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"Althought the other person said it's not a very good place, i took a ride to Barroso in about 30 minutes.\n\nPeguei uma carona pra barroso em cerca de 30 minutos, não me pareceu um mal lugar. Porém realmente não tem acostamento =/","date":"2016-03-10","rating":3},{"text":"Not a very good spot, first you pass some markets and houses, then you reach a little bridge and there's some space right in front of it. No point going any further, there's no lane for the cars to stop and it's full of curves. Got a ride almost to Sao Paulo though.","date":"2014-06-06","rating":3}],"destLat":null,"destLon":null},{"id":145,"lat":-19.9557,"lon":-45.0673,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"Not the best of the places to hitch hike, but you can get a ride from here do divinopolis.\nPerdigão is a very small city so you won't have problem to walk to this place.\nJust ask where is the road to divinopolis and walk until the end of the city.","date":"2016-03-10","rating":3}],"destLat":null,"destLon":null},{"id":147,"lat":-22.7295,"lon":-43.5656,"rating":3,"reviews":2,"wait":120,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"There's a gas station here, it isn't a very goo place to hitchhike but when i'm going from Rio de Janeiro to São Paulo this is where I hitchhike.\nTo get here you can take the train that goes to Japeri in the central station in Rio de Janeiro, it costs less than 4 reais.\nYou'll leave the train in queimados, after that you can walk for 30 minutes to this place or catch a bus. I prefer to walk.\nTheres a gas station 5 Km ahead that is a great place to get rides with truckers, if someone ofers you a ","date":"2016-03-10","rating":3}],"destLat":null,"destLon":null},{"id":167,"lat":-18.2392,"lon":-43.6216,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-11-06","comments":[{"text":"O spot para conseguir Boleia para Sete Lagoas e Belo Horizonte Demorei mais de uma hora para conseguir Boleia.","date":"2015-11-06","rating":3}],"destLat":null,"destLon":null},{"id":171,"lat":-30.0043,"lon":-50.1696,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Sinaleira","date":"2015-10-28","rating":3}],"destLat":null,"destLon":null},{"id":180,"lat":-29.9239,"lon":-51.1764,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-28","comments":[{"text":"Ponto de caminhoneiros","date":"2015-10-28","rating":3}],"destLat":null,"destLon":null},{"id":201,"lat":-25.0391,"lon":-50.2805,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-08-25","comments":[{"text":"Trevo na saída que leva sentido Maringá e Londrina para direita e Guarapuava, Cascavel e Foz do Iguaçu para a esquerda.\nPara quem vai para essa rota da esquerda, tem uma Policia Rodoviária a uns 300 metros, o que ajuda muito para quem vai por esse caminho.","date":"2015-08-25","rating":3}],"destLat":null,"destLon":null},{"id":203,"lat":-27.4965,"lon":-48.6597,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-30","comments":[{"text":"Local adequado: Polícia Rodoviária Federal","date":"2015-07-30","rating":3},{"text":"There is a very famous gas station on the road previous to arrive to Biguacu. People think it's a good spot, but they had bad experiences so they don't allow hitch hiker to stay there. It's not longer a good point to hitch hike. If you happen to be there, the best option is going to Biguacu and walked down the road a few blocks, until you cross a bridge over a river. It's not the best option, but I hitch hiked there to Sao Paulo in 10 minutes.","date":"2013-12-16","rating":3}],"destLat":null,"destLon":null},{"id":206,"lat":-30.3326,"lon":-54.3529,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-07-16","comments":[{"text":"Na sorte, consegui carona com um cegonheiro. Lugar complicado para caronas, logo após uma subida.","date":"2015-07-16","rating":3}],"destLat":null,"destLon":null},{"id":214,"lat":-25.6101,"lon":-49.1723,"rating":3,"reviews":2,"wait":63,"signal":null,"lastUsed":"2015-06-01","comments":[{"text":"Por ter pista marginal fica praticamente impossivel pegar carona na beira da estrada. O movimento de caminhões no posto é pequeno porque alguns quilômetros a frente tem outro posto que é maior, mais movimentado e tem acostamento (quando paro nesse posto peço carona pra la)","date":"2015-06-01","rating":3},{"text":"Curitiba is known among hitchhikers as a hard city to hitchhike. But for me and a friend (a girl) in a SUNDAY, next to Christmass holyday (dec 23th) and almost raining, on the way going to Florianópolis, it was incradible easy. Didn't take 5minutes to truck stop for us.\n\nHOW TO GET IN THIS SPOT:\n- Take a bus to the Boqueirão bus station\n- Take a bus to Central bus station of São José dos Pinhais\n- Take the bus to Jardim Carmen (maybe the bus going to São Marcos also can take you somewhere next t","date":"2012-12-25","rating":3}],"destLat":null,"destLon":null},{"id":223,"lat":-23.1888,"lon":-46.5835,"rating":3,"reviews":2,"wait":60,"signal":null,"lastUsed":"2015-03-03","comments":[{"text":"Posto 22.\nPosto com um fluxo moderado de veiculos. Uma outra carona me trouxe até aqui então não sei como chegar por condução.\nConsegui uma carona pra Pouso Alegre aqui após 1 hora e meia.","date":"2015-03-03","rating":3}],"destLat":null,"destLon":null},{"id":233,"lat":-21.808,"lon":-46.4698,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-26","comments":[{"text":"Posto da Policia Rodoviaria Federal","date":"2015-01-26","rating":3}],"destLat":null,"destLon":null},{"id":236,"lat":-27.6605,"lon":-48.6778,"rating":3,"reviews":2,"wait":28,"signal":null,"lastUsed":"2015-01-25","comments":[{"text":"I went to Posto Catarinão and talked to some workers and truck drivers about a ride to Porto Alegre (south). Very difficult to get a ride going South. After that, I waited on the hard shouder for 40 min (maybe more), so I decided to walk 4 km to South until PRF (Polícia Rodoviária Federal) station. After 10 min waiting, I got a ride straight to Porto Alegre.","date":"2015-01-25","rating":3},{"text":"Posto Catarinão. You can get here by public bus from Terminal Centro in Florianópolis (the end of platform C). Good spot for hitching south to Porto Alegre. Ask around or hitch on the merge lane of the entrance to the motorway.","date":"2014-07-10","rating":3}],"destLat":null,"destLon":null},{"id":239,"lat":-27.0004,"lon":-48.6436,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-22","comments":[{"text":"NOT a good place to do it. Although my friend and I (we were two boys) got a ride in 30 min. The truck driver said there is a better place 1 km going south on the road. Good luck!!","date":"2015-01-22","rating":3}],"destLat":null,"destLon":null},{"id":246,"lat":-21.8587,"lon":-42.6613,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-14","comments":[{"text":"Enquanto tentava uma carona para MG na BR-116 percebi um grande fluxo de carros e caminhões na BR-393 indo para o Espirito Santo, parece um bom lugar para pegar carona, diferentemente da Br-116.\n\nPode-se chegar de onibus até o local, em 2015 a tarifa era de R$2,65. Existem várias linhas até o local.","date":"2015-01-14","rating":3}],"destLat":null,"destLon":null},{"id":249,"lat":-6.2712,"lon":-35.2088,"rating":3,"reviews":2,"wait":60,"signal":null,"lastUsed":"2015-01-08","comments":[{"text":"I tried here at the exit of the gas station. Not the best spot because you miss the traffic going on the BR-101 but after about an hour I got a ride to Recife.","date":"2015-01-08","rating":3}],"destLat":null,"destLon":null},{"id":253,"lat":-20.2083,"lon":-40.3146,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-22","comments":[{"text":"Desk TIMS. This position receives truck toward the Northeast, Southeast, South and other regions of Brazil.\n\nTo get at the gas station: If you are in the city of Serra should go to the Terminal de Carapina and take the bus 540 (Terminal de Campo Grande) and ask to get off at Gas Station TIMS.\n\nIf in Cariacica or Viana you should go to the Terminal de Campo Grande and take the bus 540 (Terminal de Carapina).\n\nIf you are on another City of Grande Vitória Region (Vila Velha and Vitória) just go to ","date":"2014-12-22","rating":3}],"destLat":null,"destLon":null},{"id":261,"lat":-18.9925,"lon":-46.2666,"rating":3,"reviews":2,"wait":30,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Sentido Patos>Fernão Dias\nA rodovia é movimentada, mas o lugar não é muito bom. \nSem estrutura, e carros passam meio rápido.","date":"2014-12-11","rating":3}],"destLat":null,"destLon":null},{"id":262,"lat":-18.7717,"lon":-46.4191,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-12-11","comments":[{"text":"Ponto sentido Patos>Fernão Dias.\nTrevo de Lagoa Formosa. Lugar tranquilo mas sem estrutura. Rodovia movimentada!","date":"2014-12-11","rating":3}],"destLat":null,"destLon":null},{"id":277,"lat":-19.8745,"lon":-44.0542,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-08-31","comments":[{"text":"Façam uma plaquinha para 7 lagoas e a carona será mais facil!","date":"2014-08-31","rating":3},{"text":"Ã‰ difÃ­cil sair de BH pra BrasÃ­lia de carona. Alguns amigos meus jÃ¡ fizeram e tambÃ©m foi um pouco difÃ­cil pra eles.\nMas deixo entÃ£o dicas:\nEm relaÃ§Ã£o a pontos pra pedir carona neste sentido, nÃ£o sei dizer bem, porque sÃ³ fui uma vez. Eu desci no primeiro posto de gasolina (local marcado no mapa) depois do CEASA, passava muitos carros e ninguÃ©m parava! Era de tarde, levei um tempo maior pra alguÃ©m parar.\n\nCOMO CHEGAR ATÃ‰ AQUI:\ntem alguns Ã´nibus na rua Oiapoque (em frente ao Shopping ","date":null,"rating":3}],"destLat":null,"destLon":null},{"id":284,"lat":-14.0877,"lon":-50.335,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Walk until the end of the town. Not much traffic, 3 h until we got a ride.","date":"2014-06-05","rating":3}],"destLat":null,"destLon":null},{"id":288,"lat":-14.2952,"lon":-39.0516,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"In the direction of Salvador, there's a covered bus stop but traffic is very low. There are more cars going the opposite direction to Itacare.This spot is better for rides the opposite way, to Itacare.","date":"2014-06-05","rating":3}],"destLat":null,"destLon":null},{"id":290,"lat":-14.7612,"lon":-39.0641,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"A long walk from the center until there aren't many houses around. The spot around here is still a long way before the road splits in 2 directions - Itacare and Urucuca. A driver gave us a ride from there to a better spot in the beginning of BA001.","date":"2014-06-05","rating":3}],"destLat":null,"destLon":null},{"id":303,"lat":-15.6878,"lon":-47.8536,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"To go north take any bus along the Axa Norte/Sul going to Posto Colorado in Lago Norte. You'll have the gas station on your right, but most of the traffic seems local, better to walk along the highway for a few hundred m and hitch there.","date":"2014-06-05","rating":3}],"destLat":null,"destLon":null},{"id":308,"lat":-22.8883,"lon":-47.1126,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-04","comments":[{"text":"Campinas - there's a gas station there, first tried getting a ride around 8 pm, with no luck. The other day spent around 3 h asking around until the driver who brought us to the same place the day before rescued us and gave a ride to Ribeirao Preto.","date":"2014-06-04","rating":3}],"destLat":null,"destLon":null},{"id":315,"lat":-21.8085,"lon":-43.3768,"rating":3,"reviews":2,"wait":120,"signal":null,"lastUsed":"2014-05-20","comments":[{"text":"Peguei carona próximo à Churrascaria Potência do Sul, logo após o quebra mola, o que faz com que os carros estejam em menor velocidade e te vejam com mais facilidade. \nPeguei no sentido para Além Paraíba mas muitos passam ali indo para o Rio de Janeiro.\n\nPara chegar:\nBasta pegar um dos ônibus (Salvaterra, Monte Verde, Torreoes) na cidade e descer no pronto em frente a Churrascaria. \n\nTempo:\n1h30 - 2h30","date":"2014-05-20","rating":3}],"destLat":null,"destLon":null},{"id":379,"lat":-25.365,"lon":-49.0875,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-09-26","comments":[{"text":"Look at for \"Posto Cupim\"... Definitly is the best option.","date":"2013-09-26","rating":3}],"destLat":null,"destLon":null},{"id":392,"lat":-23.5371,"lon":-46.7414,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-07-03","comments":[{"text":"CEASA: There's a train (CPTM - ESMERALDA LINE) that takes you here easily. You have to take the YELLOW LINE of the METRO and then do the combination. Get down in CEASA station. (In every station you can ask for a map of lines). Here is not the best option for those who want a fast ride. Take your time, be amazed with this huge (HUGE!!) space full of truckers, fruits, greens, fish, and lots of other foods and talk with EVERYONE. When I say everyone, i mean EVERYONE (not only truckers). Say them w","date":"2013-07-03","rating":3}],"destLat":null,"destLon":null},{"id":397,"lat":-23.5175,"lon":-46.9344,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-05-30","comments":[{"text":"Existe um posto de gasolina (da Petrobras) em torno de 3,4 km após este ponto (o posto não apareceu neste mapa, de uma olhada no Google Maps, só procurar por Faculdade Alfacastelo, que já aparece este cruzamento), ótimo para se conseguir carona para quem está indo em direção à Ourinhos e ao norte do Paraná (Londrina/Maringá), consegui uma carona em torno de 5 minutos. Há um ponto de circular dentro do posto (não sei qual circular deve se pegar para chegar ao posto, devido ter me perdido).\nhttp:/","date":"2013-05-30","rating":3}],"destLat":null,"destLon":null},{"id":401,"lat":-22.7247,"lon":-47.6051,"rating":3,"reviews":2,"wait":15,"signal":null,"lastUsed":"2013-02-12","comments":[{"text":"Os carros passam muito rápido, vários caminhoneiros disseram que entrariam em Piracicaba. E faz sentido, olhando no mapa agora é evidente a razão: há várias entradas para a cidade ainda depois desse ponto. Ainda assim consegui uma carona em 10 minutos, não foi exatamente para a cidade de destino, mas para a rodoviária de Piracicaba e de lá peguei um busão para o destino. Se eu andasse 10 km, provavelmente, estaria em um ponto melhor para pegar caronas para o destino que eu queria: Capivari.\n\nThe","date":"2013-02-12","rating":3}],"destLat":null,"destLon":null},{"id":409,"lat":-28.2385,"lon":-52.3572,"rating":3,"reviews":2,"wait":60,"signal":null,"lastUsed":"2013-01-11","comments":[{"text":"Waited here for cars that were slowing down due to construction on the road. Drivers gave me many suspicious looks and it wasn't very easy to get a ride.","date":"2013-01-11","rating":3}],"destLat":null,"destLon":null},{"id":412,"lat":-28.6757,"lon":-53.5944,"rating":3,"reviews":2,"wait":30,"signal":null,"lastUsed":"2013-01-10","comments":[{"text":"Decent place, but there is nothing to make the cars slow down.","date":"2013-01-10","rating":3},{"text":"I've driven past some people hitching from here to Santa Maria. Tomorrow I'll give it a try too!","date":"2013-01-05","rating":3}],"destLat":null,"destLon":null},{"id":423,"lat":-27.4982,"lon":-48.5103,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-07","comments":[{"text":"This toll station has not been active for a few years now (it was built and never used). If you happen to be here it's a spot, although drivers will slow down only a little.","date":"2011-10-07","rating":3}],"destLat":null,"destLon":null},{"id":424,"lat":-27.5838,"lon":-48.6152,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"Small gas station just before the entrance of the BR 101 (consider standing before the gas station perhaps). All cars going from Florianopolis to any town North must pass here.","date":"2011-10-04","rating":3}],"destLat":null,"destLon":null},{"id":426,"lat":-27.6135,"lon":-48.5272,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-10-04","comments":[{"text":"From here you can hitchhike downtown or to the South of the island (like the airport) since there are many cars coming from the university area or South Bay neighborhoods.","date":"2011-10-04","rating":3}],"destLat":null,"destLon":null},{"id":433,"lat":-20.2259,"lon":-40.2854,"rating":3,"reviews":2,"wait":60,"signal":null,"lastUsed":"2011-04-01","comments":[{"text":"There is a busstop here that is also on the BR-101, but almost nobody stops... But basically there is space for cars and trucks to stop","date":"2011-04-01","rating":3}],"destLat":null,"destLon":null},{"id":440,"lat":-5.867,"lon":-35.3992,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"gas station. Free bath and wather.","date":null,"rating":3}],"destLat":null,"destLon":null},{"id":11,"lat":-18.9123,"lon":-48.2199,"rating":3,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-10-25","comments":[{"text":"Antigamente por aqui depois ou antes deste microviaduto tinha um quebra-molas. Num sei hoje.","date":"2025-10-25","rating":3}],"destLat":-18.9245,"destLon":-48.1996},{"id":14,"lat":-17.7405,"lon":-48.1617,"rating":3,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-10-23","comments":[{"text":"Quando tentei em 2015 era mais fácil porque o trevo era mais simples. Mas ainda tem lugar pra parar indo pra Catalão. Fácil. Se for pra depois peça que lhe deixem na br pelo menos.","date":"2025-10-23","rating":3}],"destLat":-18.1815,"destLon":-47.9419},{"id":15,"lat":-17.3169,"lon":-48.2759,"rating":3,"reviews":1,"wait":40,"signal":"thumb","lastUsed":"2025-10-23","comments":[{"text":"Peguei logo depois do posto, mas acredito que após o cruzamento da Go 020 com Br 352 seja bem melhor. Indo de Gyn até Araguari.","date":"2025-10-23","rating":3}],"destLat":-17.7307,"destLon":-48.1519},{"id":16,"lat":-16.9701,"lon":-48.9625,"rating":3,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-10-23","comments":[{"text":"Terceira carona da vida.  Indo de Gyn até Araguari. Peguei o Bus 582, O bus 580 por Hidrolândia também é um caminho possível como tentaria em outra oportunidade. \r\n\r\nAcredito que o posto adiante depois do trevo da GO 219 deva ser bem melhor, mas minha inexperiência me levou por aqui e funcionou.","date":"2025-10-23","rating":3}],"destLat":-17.3151,"destLon":-48.2788},{"id":17,"lat":-16.3524,"lon":-48.9163,"rating":3,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-10-23","comments":[{"text":"Seguda carona da vida. Não do melhor lugar, mas deu certo. Fui deixado nas proximidades e fui tentando, até chegar embaixo de um destas passarelas e conseguir com um pequeno caminhão. O melhor lugar são os quebramo-las poucos kms antes. Direto pra Goiânia.","date":"2025-10-23","rating":3}],"destLat":-16.6761,"destLon":-49.2427},{"id":18,"lat":-15.9253,"lon":-48.167,"rating":3,"reviews":1,"wait":90,"signal":"thumb","lastUsed":"2025-10-23","comments":[{"text":"Primeira carona da minha vida, quem me passou o Bisu foi O PR do \"Onde tu vai, doido?\" Que acora virou onde tu vai, Paulo Ricardo.  Mas como eu não sabia, fiquei quase duas horas debaixo de chuva esperando na bosrda do posto, nem na entrada e nem na saída, bem na borda. O pessoal ia até ceres e me deixaram em Anápolis. Mas se voc~e tentar depois da Polícia ou até mesmo logo depois do sensro de velocidade é mais fácil pegar direto pra Goiânia. Mas logo depois da polícia é o melhor. Dá pra pegar a","date":"2025-10-23","rating":3}],"destLat":-16.3538,"destLon":-48.9285},{"id":24,"lat":-20.2963,"lon":-54.5016,"rating":3,"reviews":1,"wait":16,"signal":"thumb","lastUsed":"2025-05-24","comments":[{"text":"We got there by Uber. It's quite empty but the trucks have a lot of time to see you and space to stop. We found a ride with Rodrigo who took us all the way to Cuiabá. Good luck!","date":"2025-05-24","rating":3}],"destLat":-15.6772,"destLon":-55.934},{"id":32,"lat":-12.2953,"lon":-40.5153,"rating":3,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2025-04-25","comments":[{"text":"Got my ride further on the road but this a the best spot, car have to slow down and many space to stop","date":"2025-04-25","rating":3}],"destLat":-12.4528,"destLon":-40.6265},{"id":34,"lat":-11.9689,"lon":-40.1963,"rating":3,"reviews":1,"wait":120,"signal":"thumb","lastUsed":"2025-04-24","comments":[{"text":"Got exited and walked to the junction.\r\nMaybe works better closer to town when slower !","date":"2025-04-24","rating":3}],"destLat":-12.1392,"destLon":-40.3596},{"id":35,"lat":-11.6107,"lon":-40.1361,"rating":3,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-04-24","comments":[{"text":"Was raining so stayed under the roof of these picnic tables","date":"2025-04-24","rating":3}],"destLat":-11.9584,"destLon":-40.188},{"id":41,"lat":-2.8775,"lon":-40.8514,"rating":3,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-04-20","comments":[],"destLat":-2.8793,"destLon":-40.9575},{"id":43,"lat":-1.7923,"lon":-46.3029,"rating":3,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-04-16","comments":[],"destLat":-2.0492,"destLon":-45.9609},{"id":47,"lat":-1.2151,"lon":-47.1783,"rating":3,"reviews":1,"wait":3,"signal":"thumb","lastUsed":"2025-04-16","comments":[{"text":"Most of the car at the gas station are not leaving town","date":"2025-04-16","rating":3}],"destLat":-1.521,"destLon":-46.9022},{"id":58,"lat":-23.0313,"lon":-44.1715,"rating":3,"reviews":1,"wait":60,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Good visibility for cars, but many people told us that it would be easier to go to Angra dos Reis with the city bus that comes every 30 mins. We were lucky enough to catch a ride to Paraty 😄","date":"2025-03-11","rating":3}],"destLat":-23.2227,"destLon":-44.7312},{"id":60,"lat":-19.3289,"lon":-48.9063,"rating":3,"reviews":1,"wait":60,"signal":"ask-sign","lastUsed":"2024-05-22","comments":[{"text":"Lots of trucks. I didnt speak portuguese so communication was harder. Took a car with two drivers that didnt speak english. Fun people","date":"2024-05-22","rating":3}],"destLat":-19.7376,"destLon":-47.9412},{"id":83,"lat":-20.4861,"lon":-54.4515,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-07-28","comments":[],"destLat":null,"destLon":null},{"id":98,"lat":-14.7881,"lon":-39.2534,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-07-16","comments":[],"destLat":null,"destLon":null},{"id":150,"lat":-9.7665,"lon":-35.851,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-02-22","comments":[],"destLat":null,"destLon":null},{"id":151,"lat":-9.6953,"lon":-35.7757,"rating":3,"reviews":1,"wait":20,"signal":null,"lastUsed":"2016-02-22","comments":[],"destLat":null,"destLon":null},{"id":152,"lat":-30.0006,"lon":-51.2864,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-02-17","comments":[],"destLat":null,"destLon":null},{"id":187,"lat":-20.9933,"lon":-44.1482,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":199,"lat":-21.1175,"lon":-42.9566,"rating":3,"reviews":1,"wait":30,"signal":null,"lastUsed":"2015-08-26","comments":[],"destLat":null,"destLon":null},{"id":320,"lat":-33.6784,"lon":-53.4475,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-31","comments":[],"destLat":null,"destLon":null},{"id":322,"lat":-31.7568,"lon":-52.4335,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-21","comments":[],"destLat":null,"destLon":null},{"id":342,"lat":-12.3786,"lon":-46.4001,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":343,"lat":-3.7423,"lon":-43.3631,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":350,"lat":-2.4849,"lon":-44.7896,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":351,"lat":-2.5022,"lon":-44.5232,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":356,"lat":-9.3139,"lon":-50.3253,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":358,"lat":-10.1958,"lon":-48.8767,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2014-03-05","comments":[],"destLat":null,"destLon":null},{"id":86,"lat":-12.8534,"lon":-38.2836,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-23","comments":[{"text":"Waited over an hour until I changed my sign to Posto Br, and hitched to a better spot","date":"2016-07-23","rating":2}],"destLat":null,"destLon":null},{"id":101,"lat":-13.9413,"lon":-39.1036,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-07-16","comments":[{"text":"found a shade near the bus stop and there's space for cars to stop. waited more than twenty minutes. The post a few blocks north makes more sense...","date":"2016-07-16","rating":2}],"destLat":null,"destLon":null},{"id":143,"lat":-20.161,"lon":-44.9171,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-03-10","comments":[{"text":"Terrible place to hitchhike, there's not much space for the cars to stop.\nOn the other hand, this is a police station, so the cars pass slowly and it's safe.\nLuckly got a ride to the 381 road in 1hour.\n\nIF YOU CAN, use a sign with the name of the place you intend to go, it may make easier to get a ride\n\nmay be a good place to go to Formiga, just walk a few meters to BR 0-50","date":"2016-03-10","rating":2}],"destLat":null,"destLon":null},{"id":156,"lat":-12.9339,"lon":-38.6237,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-01-25","comments":[{"text":"Heading to south, trying to get a lift in the village.","date":"2016-01-25","rating":2}],"destLat":null,"destLon":null},{"id":164,"lat":-30.4804,"lon":-50.4637,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-12-09","comments":[{"text":"Lugar ruim, poucos carros passando, e os que passam não vão a Mostardas, mas sim a fazendas próximas.\n---\nBad place, few cars passing, and those who are passing arent going to Mostardas, but to nearby farms.","date":"2015-12-09","rating":2}],"destLat":null,"destLon":null},{"id":198,"lat":-25.5508,"lon":-49.305,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-08-26","comments":[{"text":"descendo de São Paulo a Santa Catarina, minha carona me deixou em um dos piores lugares para seguir viagem. Andei alguns km até esse local, a noite, levei 1 hora e meia até conseguir carona para SC. sem acostamento, pouca iluminação, muita velocidade. Só com muita sorte.","date":"2015-08-26","rating":2}],"destLat":null,"destLon":null},{"id":247,"lat":-21.8581,"lon":-42.6618,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-01-14","comments":[{"text":"Pegando carona para Cataguazes/ Ubá e Viçosa em MG.\n\nPior lugar que já peguei carona, cheguei às 4 da tarde e só sai de lá no dia seguinte às 12h.","date":"2015-01-14","rating":2}],"destLat":null,"destLon":null},{"id":405,"lat":-28.9473,"lon":-49.5057,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-01-12","comments":[{"text":"Tem o posto de gasolina Mazzoco II aqui. Quando chegamos, parecia um excelente ponto pra pedir carona, mas trem um cruzamento aqui perto que faz o trânsito virar a maior zona que você já viu na sua vida. Eu e um amigo mofamos aqui por algumas horas, até que um pessoal que trabalha por perto resolveu pegar a gente e nos deixar no posto rodoviário uns 4km à frente. Aí no posto conseguimos carona em no máximo 30minutos!!","date":"2013-01-12","rating":2}],"destLat":null,"destLon":null},{"id":411,"lat":-28.3499,"lon":-53.5032,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-01-10","comments":[{"text":"This might seem like a good place because of all the crossings, but it's also the spot where prostitutes (aka \"china\") wait for their customers. After many dirty looks I walked 500 meters up the road and was picked up quickly and the driver told me about the prostitution thing.","date":"2013-01-10","rating":2}],"destLat":null,"destLon":null},{"id":45,"lat":-1.6853,"lon":-46.7073,"rating":2,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2025-04-16","comments":[],"destLat":-1.7603,"destLon":-46.5445},{"id":49,"lat":-1.2948,"lon":-47.8894,"rating":2,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-04-16","comments":[{"text":"Still in town.\r\nOften want to drop you at a bus station","date":"2025-04-16","rating":2}],"destLat":-1.342,"destLon":-47.5644},{"id":50,"lat":-1.3648,"lon":-48.2817,"rating":2,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-04-16","comments":[{"text":"Gas station, First Guy I asked","date":"2025-04-16","rating":2}],"destLat":-1.2965,"destLon":-47.9246},{"id":52,"lat":-2.053,"lon":-60.0236,"rating":2,"reviews":1,"wait":95,"signal":"ask","lastUsed":"2025-03-31","comments":[{"text":"found a guy that originally said no to us in manaus ride was though had to hop out and walk around multiple security and weigh stations also he said that he couldn't take us all the way to boa vista so he dropped us off in Mucajai like 2 hours out of boa vista","date":"2025-03-31","rating":2}],"destLat":2.4505,"destLon":-60.9184},{"id":121,"lat":-10.1133,"lon":-36.2812,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2016-05-18","comments":[{"text":"Estrada pouco movimentada à frente, sentido Teotonio Vilela! Pista de terra, sem movimento algum, apenas uma usina de cana de açucar poucos kilometros a frente!","date":"2016-05-18","rating":1}],"destLat":null,"destLon":null},{"id":281,"lat":-22.8193,"lon":-43.2836,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"Pointless hitchhiking there, it's still not any close to getting out of the city. Got there following the advice of a man who told us there's a big rmarket from where trucks go to all directions after unloading. There are many truck drivers but the place is too big and would probably take a lot of time to find a ride. We were lucky because a guy we asked for directions offered to take us to a spot down the road. Otherwise, don't waste your time there.","date":"2014-06-05","rating":1}],"destLat":null,"destLon":null},{"id":301,"lat":-16.3526,"lon":-48.9313,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-05","comments":[{"text":"From here it's an easy walk to the center of Anapolis, no point hitchhiking there.","date":"2014-06-05","rating":1}],"destLat":null,"destLon":null},{"id":307,"lat":-21.2416,"lon":-47.7574,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-04","comments":[{"text":"Gas station before the city. Asked around for a few h, tried our luck on the highway (there's a turning to the city right after the gas station, make sure to stay on the right road), came back to the gas station and asked around until somebody told us there's a better spot around 4 km after the city where more trucks stop.","date":"2014-06-04","rating":1}],"destLat":null,"destLon":null},{"id":436,"lat":-13.9476,"lon":-39.1129,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2011-04-01","comments":[{"text":"Waiting for a long time and nobody gave us a ride. But there is a cheap local bus that goes and can take you to the BR-101","date":"2011-04-01","rating":1}],"destLat":null,"destLon":null},{"id":21,"lat":-2.9303,"lon":-41.7522,"rating":1,"reviews":1,"wait":null,"signal":"sign","lastUsed":"2025-07-11","comments":[{"text":"This spot looked great as it's a gasoline stop on the way to the east, but it's in the city center and almost none of the cars go out of the city. It's better to try somewhere outside of the city.","date":"2025-07-11","rating":1}],"destLat":null,"destLon":null},{"id":38,"lat":-3.047,"lon":-41.2455,"rating":1,"reviews":1,"wait":240,"signal":"ask","lastUsed":"2025-04-20","comments":[{"text":"Car goes too fast \r\nNot many stop at pump station. \r\nStore available","date":"2025-04-20","rating":1}],"destLat":-3.0785,"destLon":-41.2559},{"id":44,"lat":-1.8106,"lon":-46.4359,"rating":1,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-04-16","comments":[],"destLat":-1.7937,"destLon":-46.3052},{"id":46,"lat":-1.5354,"lon":-46.889,"rating":1,"reviews":1,"wait":100,"signal":"thumb","lastUsed":"2025-04-16","comments":[],"destLat":-1.6848,"destLon":-46.7108},{"id":48,"lat":-1.3337,"lon":-47.5357,"rating":1,"reviews":1,"wait":100,"signal":"thumb","lastUsed":"2025-04-16","comments":[],"destLat":-1.2125,"destLon":-47.1834},{"id":53,"lat":-2.9655,"lon":-60.0211,"rating":1,"reviews":1,"wait":500,"signal":"ask-sign","lastUsed":"2025-03-31","comments":[{"text":"so many people say no tough crowd, eventually we found somebody to take us to presidente. figueiredo it was a bit easier from there had to hop out and go around government stops idk what the time was exactly but it was early morning when the truckers were leaving","date":"2025-03-31","rating":1}],"destLat":-2.0529,"destLon":-60.0236},{"id":190,"lat":-20.5581,"lon":-43.8254,"rating":1,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-08-31","comments":[],"destLat":null,"destLon":null},{"id":382,"lat":-26.8952,"lon":-48.596,"rating":1,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-08-18","comments":[],"destLat":null,"destLon":null}]}