{"country":"LU","name":"Luxembourg","totalSpots":34,"totalReviews":122,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":16,"lat":50.1558,"lon":6.0521,"rating":5,"reviews":3,"wait":7,"signal":"sign","lastUsed":"2024-08-13","comments":[{"text":"Easy to stop\r\nGood space\r\nCars going slowly\r\nTowards Belgium...\r\nGet a ride towards st vith or verviers. Both have spots near highway driver can easily stop at. You continue from there.\r\n\r\nAlso should be good to go north to netherlands","date":"2024-08-13","rating":5},{"text":"The Shell petrol station is really clean to wash up if you need to.\nGot a ride within 1 minute after standing there @ 8.00 in the morning. First car, immediate ride. I use a sign Luxembourg and thumb.","date":"2012-07-09","rating":5},{"text":"Direction: Towards the city Luxembourg.\nPlace: Right after the exit of the roundabout.\nThere are 2 Petrol station nearby, where you can also easily ask anybody.","date":"2012-07-09","rating":5}],"destLat":50.4921,"destLon":5.8583},{"id":32,"lat":49.7706,"lon":6.0837,"rating":5,"reviews":3,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"Petrol station for Germany.","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":21,"lat":49.8508,"lon":6.1149,"rating":5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2015-09-08","comments":[{"text":"Bus stop. A lot of place to stop. Bus stop is covered and almost closed so good for bad weather conditions.","date":"2015-09-08","rating":5}],"destLat":null,"destLon":null},{"id":28,"lat":49.503,"lon":6.1307,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2012-10-28","comments":[{"text":"To Bettembourg / Luxembourg / Metz.","date":"2012-10-28","rating":5}],"destLat":null,"destLon":null},{"id":31,"lat":49.6232,"lon":6.0287,"rating":5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2011-05-07","comments":[{"text":"took me like 40 min to hitch a ride at 2 am. not bad!","date":"2011-05-07","rating":5},{"text":"Petrol Station for Belgium, etc.","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":33,"lat":49.6232,"lon":6.2787,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"Petrol station for Germany.","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":34,"lat":49.5727,"lon":6.1131,"rating":5,"reviews":2,"wait":1,"signal":null,"lastUsed":null,"comments":[{"text":"For those who stay at the camping Kockelschauer and want to save some change on public transport - hitching at the nearby bus stop worked perfect for me, got a lift to the city centre within literally one minute.","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":19,"lat":49.6263,"lon":6.1619,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-05-21","comments":[],"destLat":null,"destLon":null},{"id":22,"lat":49.5438,"lon":5.8195,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2015-07-23","comments":[],"destLat":null,"destLon":null},{"id":25,"lat":49.5416,"lon":6.1178,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-02-01","comments":[],"destLat":null,"destLon":null},{"id":7,"lat":49.5429,"lon":6.1178,"rating":4.89,"reviews":27,"wait":26,"signal":"sign","lastUsed":"2025-09-01","comments":[{"text":"i slept in the forest next to the station, theres a metal grid fence that you can easily climb in the truck stop area next to the highway. just make sure to wake up early to climb it up again with no one seeing. got a ride to metz by a nice belgian couple on their way to italy. lots of people were willing to take me but their cars were full of luggage.","date":"2025-09-01","rating":5},{"text":"Great spot with loads of traffic. If you're getting here via Berchem station and want to cross the bridge, don't trust google maps. Had to take the long way to the gas station. \r\nLuckily didn't take too long to get a ride. Legend drove me all the way to Chambéry","date":"2025-04-26","rating":5},{"text":"Got a ride to Barcelona (our final destination!) on a Saturday morning. \r\nStood with « Lyon/Dijon » near the Auchan in a point where roads from the gas station and parking merge, there is space for cars to pull over. Lots of drivers from, L, NL, D, F and B.","date":"2024-03-30","rating":5},{"text":"Well, we wanted to go to france from trier so we decided to go to berchem by train and start our journey here since the reviews and everything looked great. And it is a great stop. BUT what surprised us - the bridge across the autobahn got demolished but is still shown on google maps. We discovered this when we got there (lol) and luckily they already built another one in sight, but we still had to walk about an hour more than planned. When we got to the station we had to cross/ get through 3 fe","date":"2023-09-22","rating":3},{"text":"Started here many times since I live in Luxembourg. Luck varies: from 2 minutes to 1h. Lots of long distance traffic I guess but no one ever took me further than Nancy/Toul...","date":"2023-05-27","rating":4}],"destLat":49.2171,"destLon":6.1722},{"id":5,"lat":49.6367,"lon":5.9716,"rating":4.57,"reviews":14,"wait":50,"signal":"sign","lastUsed":"2025-09-18","comments":[{"text":"Mid spot. (1 M, 1 F)","date":"2025-09-18","rating":3},{"text":"Fantastic spot to get to Belgium but be careful when walked from the Capellen station, there was a fence and closed gate. It was not an easy climb.","date":"2025-07-20","rating":4},{"text":"On a monday afternoon we tried to get to NL Took quite long till we got a ride.","date":"2025-04-28","rating":2},{"text":"Great spot to hitchhike to Belgium - especially Brussels. I was hitching to Amsterdam and started Friday at 19:00. Within 30 minutes I had 7 offers to go to Brussels. Eventually I accepted a ride to Maastrict and went from there to Amsterdam. Great spot!","date":"2017-04-12","rating":5},{"text":"Excellent spot for hitchhiking to Belgium. Got ride to Brussels after 30 min waiting. Heaps of cars and trucks stop here to rest and fill a tank.","date":"2015-08-22","rating":5}],"destLat":49.6533,"destLon":5.8191},{"id":9,"lat":49.5796,"lon":6.1288,"rating":4.5,"reviews":2,"wait":25,"signal":"sign","lastUsed":"2025-08-31","comments":[{"text":"To me this place was not that good, but I got a ride. Keep an eye for cars from the parking, got a ride with one of these. Big sign FR. Sunday evening","date":"2025-08-31","rating":4},{"text":"There are many cars in different ways, but they go slowly and can see you well. You need to have a sign. We went in direction Metz.","date":"2025-03-04","rating":5}],"destLat":49.1111,"destLon":6.196},{"id":4,"lat":49.619,"lon":6.0842,"rating":4.4,"reviews":5,"wait":18,"signal":null,"lastUsed":"2025-09-20","comments":[{"text":"Before the ramp for the highway there is a turn off for a couple businesses. Stood there at 18h with a Belgique sign and was picked up in less than 10 minutes and taken to Namur","date":"2025-09-20","rating":5},{"text":"From now on everything is free in Luxembourg, don't hitchhack, takea bus or a train!","date":"2025-03-06","rating":5},{"text":"Amazing spot to get to the huge petrol station Aire de Capellen Su. I waited here not even one minute. The 5th car that passed me stopped. I hitched here on a Friday around 18:30.","date":"2017-04-12","rating":4},{"text":"it took not to long to get a ride to the petrol station mentioned, and from there 5 min for a ride to Brussels.","date":"2013-07-21","rating":4},{"text":"A pretty long walk out of town (~4 km, can *partly* use Bus 7) Used several times. It is possible to get a direct ride to Brussels.\n\nAbout 10km from this place there is a big petrol station, 'Aire de Capellen', you might want to get a sign to get there!","date":null,"rating":4}],"destLat":50.4693,"destLon":4.862},{"id":17,"lat":49.6352,"lon":5.9701,"rating":4.33,"reviews":9,"wait":58,"signal":"thumb","lastUsed":"2024-05-27","comments":[{"text":"Mots of the people go to luxembourg city but if u target french car you've good chance of finding a good one to go to Metz /. Nancy / ...","date":"2024-05-27","rating":5},{"text":"Eazy pezy tto Lyon","date":"2023-08-01","rating":5},{"text":"Started at 11h30, got a ride to Nancy at 13h, but we weren't positioned well, at the end with the EV chargers we got picked up in 10 minutes (and dancing to our music made most good people smile which kept up morale)","date":"2023-07-06","rating":5},{"text":"Got a ride after 10 minutes withhout even bothering straight to Lure close to Switzerland which was where I needed to go. Lovely","date":"2017-09-03","rating":4},{"text":"For me it was an excellent spot.\nI catch a car almost to the Montpellier. It was a long ride but great.","date":"2016-09-12","rating":4}],"destLat":48.6616,"destLon":6.1593},{"id":2,"lat":49.6412,"lon":6.2173,"rating":4,"reviews":3,"wait":null,"signal":null,"lastUsed":"2025-10-21","comments":[{"text":"As of 2025, this spot doesn't serve Trier!","date":"2025-10-21","rating":4},{"text":"Waited about an hour for a ride towards Trier. Not a lot of space for the cars to stop but very visible. About an hour hike from the hostel.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":18,"lat":50.0515,"lon":6.1215,"rating":4,"reviews":2,"wait":20,"signal":null,"lastUsed":"2016-08-16","comments":[{"text":"Direction Marnach. Very visible, enough place to stop. Every car going west goes through Marnach.","date":"2016-08-16","rating":4}],"destLat":null,"destLon":null},{"id":20,"lat":49.5138,"lon":6.2932,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2015-10-06","comments":[],"destLat":null,"destLon":null},{"id":24,"lat":49.6131,"lon":6.138,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-08-03","comments":[],"destLat":null,"destLon":null},{"id":11,"lat":49.6198,"lon":6.1449,"rating":3.8,"reviews":5,"wait":28,"signal":"sign","lastUsed":"2025-08-11","comments":[{"text":"We were standing before the traffic light, after Europarliament, and got a ride with a guy from Trier working in Luxembourg City. Even on a Sunday around 2pm, we didn't wait a lot.","date":"2025-08-11","rating":5},{"text":"Good place to get to Treir as a lot of people working in Luxembourg live there. Waited 25 minutes even though I was a little early (around 2pm) so around time people finish work you should have more luck. Decided to get off at Wasserbillig but I think it might be better to go to Trier.","date":"2025-06-04","rating":5},{"text":"10 Minutes for a ride to Trier","date":"2016-12-05","rating":3},{"text":"I waited in Luxembourg for one hour. Everybody has expensive car, but they don't like hitchhikers.","date":"2012-06-26","rating":3},{"text":"Very good place when heading to the A1 (Wasserbillig, Trier)","date":null,"rating":3}],"destLat":49.759,"destLon":6.6459},{"id":12,"lat":49.5413,"lon":6.1199,"rating":3.75,"reviews":8,"wait":81,"signal":"sign","lastUsed":"2025-06-04","comments":[{"text":"A lot of cars with Belgian or Dutch license plates so might be easier to go there. I was trying to go towards Trier and got a ride from an Irish guy on British license plates who said he would take me there but when we started riding he said some story about being robbed and asked if I could take out money with my card for him and that he would transfer me the money, after I showed him I had just 20€ on my account he left me at central station in Luxembourg City and said he'll go to the bank and","date":"2025-06-04","rating":4},{"text":"Lots of tourists - might be a pro or a con.","date":"2024-03-05","rating":3},{"text":"Probably a good spot, but with years it is very complicate since Covid  in France and Belgium","date":"2023-08-25","rating":2},{"text":"1st car asked towards brussels, at 7 in the morning!","date":"2014-06-19","rating":4},{"text":"Best place how to go to Brussels,  I've been there couple of times, never wait more then 30 minutes","date":"2012-12-02","rating":4}],"destLat":49.5997,"destLon":6.1334},{"id":13,"lat":49.6379,"lon":6.1324,"rating":3.67,"reviews":3,"wait":30,"signal":null,"lastUsed":"2025-03-06","comments":[{"text":"2015, ok, but from now on everything is free in Lux, so don't hitchhack, take a bus or a train if you want to go north!","date":"2025-03-06","rating":5},{"text":"ok, however mostly local traffic","date":"2015-09-08","rating":3},{"text":"For going north. Long parking space so a lot of place to stop. However mostly local traffic.","date":"2015-09-08","rating":3}],"destLat":null,"destLon":null},{"id":26,"lat":49.7286,"lon":6.4914,"rating":3,"reviews":5,"wait":32,"signal":null,"lastUsed":"2013-01-04","comments":[{"text":"Heavy traffic with 90% returning to Germany - most to Trier, some actually a lot further north. Finding someone going to France: frustrating, but doable.","date":"2013-01-04","rating":3},{"text":"A lot of German cars coming for cheap gas. One guy took me to Trier and left me at a roundabound/ramp for a next ride direction Saarbrucken. He gave me a lighter.","date":"2012-05-27","rating":3},{"text":"I wanted to go to Paris and waited there a whole sad hour finding cars only coming from and returning to Germany. Few people were going to Lyon or Metz, so it must be possible to find people for these directions. But I met two girls towards Lyon who had been there for 2 hours... We found together someone to the next petrol station. Much better...","date":"2011-08-24","rating":3},{"text":"first car stopped for a direct lift to lyon","date":"2011-06-14","rating":3},{"text":"Almost all the cars come from and will return to Germany, because they only want to get the cheap fuel and cigarettes here. \nRather difficult to find a car heading south (berchem, france...)","date":null,"rating":3}],"destLat":null,"destLon":null},{"id":1,"lat":49.7266,"lon":6.4915,"rating":3,"reviews":4,"wait":83,"signal":"sign","lastUsed":"2025-10-21","comments":[{"text":"The amount of traffic can feel overwhelming. Many people are headed towards Cologne, but it's tricky to find spots on the way to continue on a long-distance journey. Took a ride to Koblenz.\r\n\r\nYou can sleep in the rickety playhouse behind Burger King.","date":"2025-10-21","rating":4},{"text":"Easy to get here as many people are going to Trier but difficult to go any further (I think people are a little afraid of Police checks at the border in Germany), be careful where you get dropped off because I got desperate after waiting over 2 hours and took a ride to some random exit between Trier and Wittlich. Try at least to get to Wittlich, then Mayen and if you're lucky you'll make it to Koblenz.","date":"2025-06-04","rating":2},{"text":"I'd waited here for more than one hour to catch anyone going in direction koblenz/frankfurt/saarbrucken","date":"2011-09-07","rating":3},{"text":"Petrol station for Germany.","date":null,"rating":3}],"destLat":50.2911,"destLon":7.2427},{"id":30,"lat":49.617,"lon":6.0952,"rating":3,"reviews":2,"wait":20,"signal":null,"lastUsed":"2012-06-25","comments":[{"text":"Yes, you have to take bus no. 8 but for me it didn't work so well even the place is good.","date":"2012-06-25","rating":3},{"text":"This was spot to get to brussels. i waited for about ten minutes to get a ride. you can get to this gas station by taking the bus. i think it was the bus number 8","date":"2011-10-20","rating":3}],"destLat":null,"destLon":null},{"id":6,"lat":49.618,"lon":6.0886,"rating":2.67,"reviews":3,"wait":38,"signal":null,"lastUsed":"2025-09-06","comments":[{"text":"No hope here in a couple hours :(","date":"2025-09-06","rating":2},{"text":"Heaps of cars drive past but not so many stop to this station.","date":"2015-08-22","rating":3},{"text":"Last gas station before the highway starts. Good location to get cars towards NL / B. Waited here for 15 minutes before being taken to Cappellen gas station.","date":"2015-08-08","rating":3}],"destLat":null,"destLon":null},{"id":29,"lat":49.4802,"lon":6.3634,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2012-10-11","comments":[{"text":"To get into Luxembourg this ramp is probably not very good - I tried twice and waited 60-80 minutes. There is not too much space to stop. There is a much frequented pertrol station, but I guess most people are Germans coming just for this. \n\nAlso the onramp is for two directions.","date":"2012-10-11","rating":2}],"destLat":null,"destLon":null},{"id":3,"lat":49.6412,"lon":6.2197,"rating":2,"reviews":1,"wait":40,"signal":null,"lastUsed":"2025-10-21","comments":[{"text":"We somehow ended up here trying to go towards Germany. Traffic is low and there isn't really much stopping space. Avoid.","date":"2025-10-21","rating":2}],"destLat":null,"destLon":null},{"id":10,"lat":49.6145,"lon":6.1665,"rating":2,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-08-28","comments":[{"text":"Not a lot of traffic leaving Luxembourg in the morning.","date":"2025-08-28","rating":2}],"destLat":49.5464,"destLon":6.3653},{"id":14,"lat":49.5817,"lon":6.125,"rating":2,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-03-04","comments":[{"text":"Bad point. Drivers don't see you. They go out from tunnel. Many cars then turn right. We changed position.","date":"2025-03-04","rating":2}],"destLat":null,"destLon":null},{"id":15,"lat":49.6347,"lon":5.9714,"rating":2,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2024-08-14","comments":[{"text":"++\r\nMany cars\r\nExcellent for Sleeping: we asked the workers and they allowed us to sleep in a upstairs area were it was warm and private. I even took some pillows from a sofa there.\r\n\r\n—\r\nAlmost no cars going to Germany. Here is how to we got to Germany: walk along the highway for 5 minutes (direction luxembourg) and exit the highway onto the first bridge that comes up. From there walk left and you will reach a train station that will take you to luxembourg for free. From there use your Deutschl","date":"2024-08-14","rating":2}],"destLat":null,"destLon":null},{"id":23,"lat":49.5987,"lon":6.125,"rating":2,"reviews":1,"wait":null,"signal":null,"lastUsed":"2013-11-03","comments":[{"text":"Waited a long time (at least 3h), asking to go to Berchem motorway rest area.\nThe only person who took us was not from Luxembourg. He explained us that he saw us waiting there 2 hours before, and chose to make a detour especially to bring us to Berchem.","date":"2013-11-03","rating":2}],"destLat":null,"destLon":null},{"id":27,"lat":49.6297,"lon":6.1672,"rating":2,"reviews":1,"wait":null,"signal":null,"lastUsed":"2012-11-08","comments":[],"destLat":null,"destLon":null},{"id":8,"lat":50.1805,"lon":6.0242,"rating":1,"reviews":1,"wait":90,"signal":"sign","lastUsed":"2025-08-31","comments":[{"text":"To be honest you are much better taking public transport. It is free and runs quite often. Gas station asking is kinda pointless, many Belgians going for cheap cigarettes. So getting to central Luxembourg is almost impossible.","date":"2025-08-31","rating":1}],"destLat":null,"destLon":null}]}