{"country":"MK","name":"Macédoine du Nord","totalSpots":71,"totalReviews":354,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":65,"lat":41.9416,"lon":21.6203,"rating":5,"reviews":7,"wait":9,"signal":"sign","lastUsed":"2025-04-23","comments":[{"text":"Perfect place to leave from Skopje towards Greece. It is a bit tricky to get there with the Skopje local bus - only go from the Skopje central bus station, do NOT try other bus stops because it is a fucking chaos. If you get to the Petrovec toll gate, everybody is going the right direction and it is fairly easy to get a ride.","date":"2025-04-23","rating":5},{"text":"Used a VE sign and got. a ride even further in less than 30 min. Good supermarket in Petrovec. Shadow beneath the bridge.","date":"2024-05-29","rating":5},{"text":"Can also recommend this place! Took the bus #53 (had to get a dayticket for 120 Dinar) to Petrovec (bus takes around 50 minutes from the transportation center), walked to the toll station and right after the toll station I was picked up after a few minutes, under the eyes of a police car haha. Also had a sign which said \"Veles\".","date":"2023-09-06","rating":5},{"text":"Super easy to get ride to Tetovo","date":"2018-08-07","rating":5},{"text":"take bus 53 from transportation center to Petrovez.","date":"2016-11-18","rating":5}],"destLat":40.6082,"destLon":22.9326},{"id":26,"lat":41.808,"lon":20.9067,"rating":5,"reviews":2,"wait":8,"signal":"thumb","lastUsed":"2025-10-20","comments":[{"text":"I was at the exit ramp from station to cover cars from main road also. It didn't take a lot of time to get a ride.","date":"2025-10-20","rating":5},{"text":"This gas station is magic. We've hitchhiked here twice and the Coffee waiter we found cars twice","date":"2025-05-18","rating":5}],"destLat":41.5011,"destLon":20.9525},{"id":64,"lat":42.138,"lon":21.3054,"rating":5,"reviews":2,"wait":8,"signal":"thumb","lastUsed":"2025-04-29","comments":[{"text":"Got taken to Skopje very quickly inspite of it being already dark. Border guards were friendly and I could just stand behind the station.","date":"2025-04-29","rating":5},{"text":"Easy.","date":"2024-12-02","rating":5}],"destLat":42.0115,"destLon":21.429},{"id":3,"lat":41.1375,"lon":20.821,"rating":5,"reviews":1,"wait":60,"signal":null,"lastUsed":"2026-02-03","comments":[{"text":"Extreme count of cars passing by. ait is absolutely worth it to walk to the gas station here.","date":"2026-02-03","rating":5}],"destLat":41.0232,"destLon":21.337},{"id":10,"lat":41.6286,"lon":22.456,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-11-12","comments":[{"text":"Quick pick up no problem, Strumica","date":"2025-11-12","rating":5}],"destLat":41.437,"destLon":22.6444},{"id":13,"lat":41.6232,"lon":20.6066,"rating":5,"reviews":1,"wait":40,"signal":null,"lastUsed":"2025-11-03","comments":[{"text":"From Bigorski to Debar with Charlie","date":"2025-11-03","rating":5}],"destLat":41.5228,"destLon":20.526},{"id":14,"lat":41.6977,"lon":20.7494,"rating":5,"reviews":1,"wait":40,"signal":null,"lastUsed":"2025-11-03","comments":[{"text":"Perfect spot to Bigorski Monastery. Hitchhiking with mr. CHARLIECARLIE","date":"2025-11-03","rating":5}],"destLat":41.6232,"destLon":20.6068},{"id":16,"lat":41.7946,"lon":20.8853,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-11-02","comments":[{"text":"Hitchhiked with mr. CharlieCarlie","date":"2025-11-02","rating":5}],"destLat":41.6993,"destLon":20.7531},{"id":18,"lat":41.9842,"lon":20.9583,"rating":5,"reviews":1,"wait":40,"signal":null,"lastUsed":"2025-11-01","comments":[{"text":"Good spot to hitchhike. Hitchhiked with my friend Charlie","date":"2025-11-01","rating":5}],"destLat":41.7949,"destLon":20.9141},{"id":21,"lat":42.1968,"lon":22.3114,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-10-20","comments":[{"text":"Not sure why nobody has used this, much better than the far side of the town. Was there not to long, cars/trucks are slow. Lots of Bulgarian trucks and some cars, enough space to stop. Great spot to get to the border","date":"2025-10-20","rating":5}],"destLat":42.2204,"destLon":22.4574},{"id":31,"lat":41.019,"lon":21.3415,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-09-21","comments":[{"text":"Was still walking in the Park Not even at the street and yet I got picked up :)\r\nThough the driver told me there wherent many cars on that street so might take way longer","date":"2025-09-21","rating":5}],"destLat":40.7804,"destLon":21.4101},{"id":37,"lat":42.0069,"lon":21.3343,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-09-02","comments":[{"text":"Got a direct ride from here to Ohrid within seconds","date":"2025-09-02","rating":5}],"destLat":41.1195,"destLon":20.81},{"id":41,"lat":42.0538,"lon":21.381,"rating":5,"reviews":1,"wait":1,"signal":"sign","lastUsed":"2025-08-27","comments":[{"text":"Used this spot to hitch a ride into Skopje. I ended up just focussing on the people coming off the A2 highway, as traffic already on the road was driving too quickly and no space to pull over. But it works out perfectly because all drivers coming from the A2 have to come to a complete stop and wait until traffic is clear so enough time to make some hand signals and get some real eye contact.","date":"2025-08-27","rating":5}],"destLat":42.0043,"destLon":21.3904},{"id":44,"lat":41.1841,"lon":20.6723,"rating":5,"reviews":1,"wait":15,"signal":"ask","lastUsed":"2025-08-23","comments":[{"text":"Good spot to Albania lots of Albanians cars going shopping here. We asked one albanian Guy and he took us to Albania","date":"2025-08-23","rating":5}],"destLat":41.0694,"destLon":20.5515},{"id":47,"lat":41.9604,"lon":21.2959,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-10","comments":[{"text":"Nice people took us back to Skopje. To go to Canyon i reccomend using bus, its worth the pain getting there by hitchhinking","date":"2025-08-10","rating":5}],"destLat":42.0157,"destLon":21.4103},{"id":48,"lat":42.0397,"lon":21.4546,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-10","comments":[{"text":"In 5 mins we got ride to the city center with starting rapper going to Pristina to the festival!","date":"2025-08-10","rating":5}],"destLat":41.9952,"destLon":21.4369},{"id":53,"lat":41.0149,"lon":21.3452,"rating":5,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-07-23","comments":[{"text":"Not a lot of people going by, but we were taken by a couple (Greek - Czech), probably one of the first cars that were actually crossing the border (most of the people seem to be locals)","date":"2025-07-23","rating":5}],"destLat":40.3001,"destLon":21.7869},{"id":56,"lat":41.1378,"lon":20.6277,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-07-05","comments":[{"text":"first car took me directly over the border into Albania, I reckon most cars go there","date":"2025-07-05","rating":5}],"destLat":41.0868,"destLon":20.5722},{"id":59,"lat":41.0085,"lon":21.3565,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-06-06","comments":[{"text":"Lukoil gas station.\r\n\r\nNot much traffic, actually a gas station worker hitched me a ride, by asking people in Greek if they can give me a ride, and an old couple agreed to drive me to border","date":"2025-06-06","rating":5}],"destLat":40.9201,"destLon":21.4161},{"id":60,"lat":41.5094,"lon":20.513,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-05-16","comments":[{"text":"As always, we didn't expect at all. This country is the best by far to hitchhike. Yet we were completely soaked and full of mud!","date":"2025-05-16","rating":5}],"destLat":41.1166,"destLon":20.7985},{"id":62,"lat":42.1712,"lon":22.1572,"rating":5,"reviews":1,"wait":null,"signal":"ask","lastUsed":"2025-04-29","comments":[{"text":"The family I hitched a ride the day before invited me to sleep in their house and the day after took me to a very good place towards the border after showing me the local monastery.","date":"2025-04-29","rating":5}],"destLat":42.2121,"destLon":22.3459},{"id":68,"lat":41.7962,"lon":20.889,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-02-07","comments":[{"text":"Didn't wait long, most people are headed to Skopje","date":"2025-02-07","rating":5}],"destLat":41.9993,"destLon":21.4382},{"id":69,"lat":41.1642,"lon":20.7505,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-02-07","comments":[{"text":"Excellent spot","date":"2025-02-07","rating":5}],"destLat":41.7937,"destLon":20.8836},{"id":72,"lat":41.18,"lon":20.7473,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-02-07","comments":[{"text":"Immediatly an Albanian picked us up just outside the airport","date":"2025-02-07","rating":5}],"destLat":41.178,"destLon":20.68},{"id":84,"lat":42.0057,"lon":21.3328,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-10-24","comments":[{"text":"Got a ride to canyon Matka very quickly. Lotsof cars going there","date":"2023-10-24","rating":5}],"destLat":41.959,"destLon":21.2955},{"id":89,"lat":41.5919,"lon":21.9139,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-09-06","comments":[{"text":"I did just get out of my last ride, who dropped me of right behind the toll station, and the next ride was literally already waiting for me. I couldn't even put my thumb out. Was brought directly to the border!","date":"2023-09-06","rating":5}],"destLat":41.1332,"destLon":22.5488},{"id":91,"lat":42.2212,"lon":22.4577,"rating":5,"reviews":1,"wait":14,"signal":null,"lastUsed":"2023-08-26","comments":[{"text":"Right after the border crossing. Got a ride straight to Skopje.","date":"2023-08-26","rating":5}],"destLat":41.9808,"destLon":21.433},{"id":92,"lat":41.8199,"lon":20.9176,"rating":4.75,"reviews":4,"wait":18,"signal":null,"lastUsed":"2023-08-09","comments":[{"text":"Good spot. I still waited around forty minutes, then got a ride to my destination, Skopje center.","date":"2023-08-09","rating":4},{"text":"great spot to mavrovo - 10 min","date":"2018-08-07","rating":5},{"text":"Waited for 20min to get a ride to the junction to Mavrovo further south. A good spot were all cars has to stop. A lot of place for stopping as well!","date":"2015-03-18","rating":5},{"text":"Toll booths on the A2 towards skopje.","date":"2014-08-27","rating":5}],"destLat":41.9859,"destLon":21.4375},{"id":5,"lat":41.7733,"lon":22.1409,"rating":4.67,"reviews":3,"wait":19,"signal":"sign","lastUsed":"2026-01-14","comments":[{"text":"Got a ride to Skopje after it was already dark","date":"2026-01-14","rating":4},{"text":"Here is you can find car for both Skopje and Kumanova directions.","date":"2014-03-10","rating":5}],"destLat":41.9988,"destLon":21.4382},{"id":49,"lat":42.2346,"lon":21.7034,"rating":4.5,"reviews":4,"wait":31,"signal":null,"lastUsed":"2025-08-10","comments":[{"text":"Got to the border with driver who continued to Skopje but there was a queue, he suggested us to walk through and try hitchhike and if we wouldnt be lucky he will take us as he cross the border. And that happened :D The place is good in theory but we werent lucky.","date":"2025-08-10","rating":3},{"text":"Got to wait two minutes at the border until two people picked me to Skopje","date":"2023-08-09","rating":5},{"text":"Helpfull boarder guards. A lot of traffic, most to Skopje or Greece.\nThe boarder guard organized us a lift in a bus in the direction of Ohrid.","date":"2014-09-26","rating":5}],"destLat":42.0402,"destLon":21.4545},{"id":73,"lat":41.1242,"lon":20.7896,"rating":4.5,"reviews":2,"wait":23,"signal":"sign","lastUsed":"2025-01-26","comments":[{"text":"There were lots of cars but none of them stopped. Then I had a short drive to the intersection of the road going to Struga and the one to Sköpje. I was dropped off by the motorway under construction.","date":"2025-01-26","rating":4},{"text":"Rather local traffic, but that's the main way to Skopje. Good to have a sign \"Skopje\"","date":"2024-07-22","rating":5}],"destLat":41.1602,"destLon":20.7511},{"id":79,"lat":41.9593,"lon":22.7863,"rating":4.5,"reviews":2,"wait":25,"signal":"ask","lastUsed":"2024-11-13","comments":[{"text":"Gas station staff approached the customers and was very friendly. I stood parallel to the street. Could have even gone to Sofia, but just wanted to go to the other side of the border. Were not many cars but not 5 minutes waited.","date":"2024-11-13","rating":5},{"text":"Good spot to reach the border crossing. People at the gas station were helpful and asking the customers if they were going our direction","date":"2024-06-05","rating":4}],"destLat":42.0099,"destLon":23.0735},{"id":75,"lat":42.0014,"lon":21.4931,"rating":4.33,"reviews":6,"wait":19,"signal":"sign","lastUsed":"2024-12-07","comments":[{"text":"I waited 20 minutes, almost nobody was stopping in the pouring rain but the guys at the nearby bar were very kind ask helped me find quickly a ride","date":"2024-06-19","rating":5},{"text":"-----2024----\r\nBest place to go to GREECE\r\nThere's a lane for cars to stop on this giant road; you can see the cars coming from far, far away. After 20 minutes I found a woodcutter who took me to a toll booth near the border.\r\nInfo: I'm a young man of 23.","date":"2024-04-04","rating":3},{"text":"Maybe I was lucky. Waited a minute before a Macedonian speaking Italian guy stopped me for a lighter and then to come with him to the border because his house is at gevgelija, then we set for a couple of beers ND the restaurant at the North Macedonian side","date":"2023-08-10","rating":5},{"text":"This spot worked very well for me. Lots of space for the cars to stop and cars can see you from far away.","date":"2018-05-01","rating":4},{"text":"A good HHing spot if you are going to Veles and then to Greece, f.e. Thessaloniki. Good amount of cars, good visibility, lots of space for the people to stop and even a small market where drivers stop to shop for small things so you can go and talk straight to the drivers.\nTake bus 65B from the Skopje central rail station and hop out somewhere close to this part of the city, after the gas station that you'll see on the left (it's marked as a HH spot 1km before this one).\nGood luck!","date":"2016-01-25","rating":4}],"destLat":41.7473,"destLon":21.7697},{"id":17,"lat":41.0461,"lon":21.2893,"rating":4.33,"reviews":3,"wait":19,"signal":null,"lastUsed":"2025-11-01","comments":[{"text":"Not much space but cars are passing slow. Got a ride to Ohrid with an albanian truck driver in less than 10 minutes","date":"2025-11-01","rating":5},{"text":"Walked a while to the spot and got a ride to Resen on a beautiful road","date":"2024-02-18","rating":4}],"destLat":41.1158,"destLon":20.7985},{"id":27,"lat":42.0039,"lon":21.4786,"rating":4.29,"reviews":7,"wait":28,"signal":"ask-sign","lastUsed":"2025-10-20","comments":[{"text":"Easy to get to kumanov and closer to the Bulgaria border","date":"2025-10-20","rating":5},{"text":"I saw a few plates with KU and only talked to them while having a sign as well. Second person I asked took me.","date":"2025-08-28","rating":5},{"text":"Not a very good spot for Kumanovo, even though it seems like it should be. Asking at the gas station, it took me about 2 hours to find a ride.","date":"2016-07-06","rating":4},{"text":"I was standing there for about an hour before the gas station and asked the people in the gas station for 30-45minutes, either I was very unlucky or the spot is pretty bad if you're trying to get to the south - Thessaloniki, Athens, etc. I would suggest going half a kilometer further, where the road splits and all the traffic mostly goes south to Veles and HHing on the road there. I've marked the spot.","date":"2016-01-25","rating":4},{"text":"We got picked up after 30 minutes until the the Bulgarian border.","date":"2015-07-18","rating":4}],"destLat":42.143,"destLon":21.7159},{"id":19,"lat":42.0077,"lon":21.3296,"rating":4.25,"reviews":12,"wait":27,"signal":"thumb","lastUsed":"2025-11-01","comments":[{"text":"Me and my friend Charlie got picked up here as 2 guys and it only took 15 mins, good spot if ur going to Tetovo","date":"2025-11-01","rating":5},{"text":"I didn't like this spot, because drivers can't see you properly from this curve and they are speeding there. After 10min I moved to spot just after the traffic lights and it was much better. Everyone can see you from far away and cars are slower.","date":"2025-10-19","rating":3},{"text":"Je n'ai jamais été prise si rapidement en stop !!","date":"2025-05-14","rating":5},{"text":"Nobody stopped for about 50 minutes, then we found a ride to Tetovo with a very nice man.","date":"2024-08-26","rating":4},{"text":"Got picked up after and hour of waiting, I got here early at 7:30am as it’s the height of the summer. Enough room for cars to pull over on gravel, but they do start to speed up here to hit the highway. Got a ride all the way to Ohrid, it’s a beautiful road there.","date":"2024-07-24","rating":4}],"destLat":42.0068,"destLon":20.9717},{"id":90,"lat":41.1246,"lon":20.7893,"rating":4.25,"reviews":4,"wait":43,"signal":null,"lastUsed":"2023-08-27","comments":[{"text":"Got a ride straight away to Struga","date":"2023-08-27","rating":5},{"text":"Good spot for Skopje, got a ride there in about half an hour on a Wednesday morning","date":"2016-07-06","rating":4},{"text":"Seems like a good spot, but we were standing here with SKOPJE board for 2 hours on sunday morning (11-13) and we left to the bus station at the end because no one even stopped.","date":"2015-09-23","rating":4},{"text":"Seems like a good spot to Skopje since it's petrol station after traffic lights on the main road.","date":"2015-09-23","rating":4}],"destLat":41.1804,"destLon":20.6748},{"id":20,"lat":41.184,"lon":20.6756,"rating":4,"reviews":9,"wait":23,"signal":"thumb","lastUsed":"2025-10-21","comments":[{"text":"Mostly local traffic, but there are also Albanian cars, aim for them.","date":"2025-10-21","rating":4},{"text":"Very quick stop, traffic towards orhid and lots of space. Wouldn’t suggest trying to find a ride farther than Ohrid though","date":"2025-10-15","rating":5},{"text":"It looked like a nice spot, a lot of place to stop for cars right after the roundabout, traffic goes slow. Nobody wanted to pick me up for a while, but after some time of waiting, a very open-minded couple picked me up and drove me all the way to Bitola, offered place to sleep and introduced me to their friends!","date":"2025-06-05","rating":4},{"text":"There I barely waited 10 seconds and I didn't even have time to raise my inch by the time a car stopped for my last kilometers to Ohrid.","date":"2025-01-26","rating":5},{"text":"Sunday afternoon waited for more than 40 minutes","date":"2023-08-27","rating":2}],"destLat":41.0655,"destLon":20.6086},{"id":50,"lat":42.1073,"lon":21.6985,"rating":4,"reviews":7,"wait":33,"signal":"thumb","lastUsed":"2025-08-07","comments":[{"text":"Good spot because a lot of traffic was at the start (5pm) but then dropped very fast (6pm). Was standing with a sign bulgaria/k.palanka. Maybe a bit far saying signs but there is no other place kinda to go there on that road. Also maybe i was not that lucky because i was trying kinda late in the evening. But eventually very nice truck driver who was paying a toll(stramge because all others had the autamic one) took me all the way to sofia.","date":"2025-08-07","rating":4},{"text":"The best place for going to Bulgaria along a route which is not too frequented. I stayed at the barrier and simply asked drivers with Bulgarian numbers (not big letters BG, which is Belgrade) while they were paying their tickets. Toll workers don't pay attention, but be respectful of course. This way got direct drives to Sofia even in the evening!","date":"2023-06-07","rating":4},{"text":"I took the bus to Kumanovo for 100 dinars and i dropp off in toll gates with a sign. I wait 15 min to got a ride directly to Belgrade. A lucky day","date":"2014-03-11","rating":4},{"text":"after 10minutes i got a lift to nis","date":"2012-09-10","rating":4},{"text":"We had bad luck so we waited for 1h 50 mins before being picked up by a truck that took us just 10km to the border. There are many cars and trucks but for some reason they didn't stop this time, but I think this paytoll is a very good hh spot.","date":"2012-08-15","rating":4}],"destLat":42.7278,"destLon":23.244},{"id":42,"lat":41.1341,"lon":22.5489,"rating":4,"reviews":5,"wait":95,"signal":"sign","lastUsed":"2025-08-27","comments":[{"text":"Got picked up by a truck while standing in the grass on the left side the road (driver side). Used a sign with Skopje. Little shade but the post of a tall sign was just about big enough to hitch partly shaded. People drive slow here and you're very visible","date":"2025-08-27","rating":5},{"text":"We were 2 guys. A lot of cars passing through, they are going slow so they can clearly see you. When we were there, it was the middle of July so must of the cars were families going home from vacation so cars were full. After like 2 hours we declined 1 ride to Gevgelija. After another 2 hours we finally got a ride and it was all the way to Belgrade, we had a sign Serbia. Before we also tried with sign Skopje.","date":"2025-07-22","rating":4},{"text":"This place is gold, lots of cars of all different nationalities going almost every direction north, passed on a couple of short rides to eventually find one taking me all the way into romanie!","date":"2024-09-23","rating":5},{"text":"This place is just averagely hitchhikeable. I needed to head to the general direction of Skopje but it was still hard to find a ride. Don't bother with Greek cars as they're just going to the casino. It is possible to find a ride though, so don't give up!","date":"2015-07-14","rating":3},{"text":"There is enough space at the parking right after the border to stop. Cars are slowly and they still have an open window, so it's easy to talk to them. The biggest problem are the cars from greece going to the casino which is next to the border. You have to be patient.","date":"2011-09-29","rating":3}],"destLat":42.0538,"destLon":21.3813},{"id":30,"lat":41.9764,"lon":20.9568,"rating":4,"reviews":4,"wait":14,"signal":"thumb","lastUsed":"2025-10-19","comments":[{"text":"It was dark so I was before the toll, there is lighting there.","date":"2025-10-19","rating":4},{"text":"It is good to hitch on the pay tolls in Macedonia","date":"2016-06-19","rating":4},{"text":"Just left one car and another one picked me up in less than 40 seconds. Got a ride Gostivar.","date":"2015-03-18","rating":4},{"text":"Just behind the toll booth. Check for the license plates on the cars to see where they are probably going.\nBooth employees were very friendly.","date":"2012-05-15","rating":4}],"destLat":41.916,"destLon":20.942},{"id":55,"lat":41.3573,"lon":21.5822,"rating":4,"reviews":3,"wait":32,"signal":null,"lastUsed":"2025-07-15","comments":[{"text":"Not the perfect stop, people pass really fast. But there is a lot of traffic so you will find fast. We were 3","date":"2025-07-15","rating":4},{"text":"there is no shadow, but the traffic was quite busy, so we got a ride pretty fast. there is also a gasstation nearby.","date":"2016-08-16","rating":4}],"destLat":41.4376,"destLon":22.0152},{"id":9,"lat":41.4382,"lon":22.6497,"rating":4,"reviews":2,"wait":15,"signal":null,"lastUsed":"2025-11-12","comments":[{"text":"Good spot if you are going down towards the Greek Border","date":"2025-11-12","rating":4}],"destLat":41.3962,"destLon":22.6079},{"id":24,"lat":42.0031,"lon":21.4906,"rating":4,"reviews":2,"wait":19,"signal":"thumb","lastUsed":"2025-10-20","comments":[{"text":"Not much traffic but not to bad, going to be hard to go farther than kumovo, just use a sign that says KU","date":"2025-10-20","rating":3},{"text":"Stood here for a ride for Kumanovo. A woman first stopped and asked where I was going and came back a few minutes later and took me to Kumanovo over the highway. Probably better to wait at the entrance of the Highway then here.","date":"2025-04-29","rating":5}],"destLat":42.1492,"destLon":21.7227},{"id":39,"lat":41.1731,"lon":20.6539,"rating":4,"reviews":2,"wait":25,"signal":null,"lastUsed":"2025-08-30","comments":[{"text":"Doesnt look like good spot but Albanian dude took us through the border. With sign that said Albania. Male and female 2025","date":"2025-08-30","rating":5},{"text":"This didn't look like a good spot to hitch, but since I was already there I've decided to give it a shot. An Albanian dude took me pass the border to Prrenjas.","date":"2023-08-27","rating":3}],"destLat":41.0706,"destLon":20.553},{"id":4,"lat":40.911,"lon":20.7392,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2026-02-03","comments":[{"text":"Not many cars passing by, but they will take you because of that. Astoninshing views of the mountins while you are waiting.","date":"2026-02-03","rating":4}],"destLat":41.108,"destLon":20.8124},{"id":6,"lat":41.91,"lon":22.4545,"rating":4,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2026-01-14","comments":[{"text":"With a sign for Veles, not ideal but car have some space to pull over","date":"2026-01-14","rating":4}],"destLat":41.7873,"destLon":22.1405},{"id":8,"lat":41.3965,"lon":22.6079,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-11-12","comments":[{"text":"Hitch to Dojran lake on the border with Greece","date":"2025-11-12","rating":4}],"destLat":41.1864,"destLon":22.721},{"id":11,"lat":41.7342,"lon":22.1811,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2025-11-12","comments":[{"text":"Hitchhiked to Radoviš from here","date":"2025-11-12","rating":4}],"destLat":41.633,"destLon":22.4579},{"id":12,"lat":41.5142,"lon":20.5151,"rating":4,"reviews":1,"wait":100,"signal":null,"lastUsed":"2025-11-03","comments":[{"text":"We waited an hour and a half for a hitch, but it paid off a local picked us off and even took us to dinner in a nearby restaurant on the way to Struga","date":"2025-11-03","rating":4}],"destLat":41.178,"destLon":20.6898},{"id":15,"lat":41.6513,"lon":20.7363,"rating":4,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-11-03","comments":[{"text":"Local drove us from the skislopes to the dam. With CharlieCarlie","date":"2025-11-03","rating":4}],"destLat":41.6936,"destLon":20.7471},{"id":25,"lat":41.5003,"lon":20.9508,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-10-20","comments":[{"text":"This spot is good enough, I didn't feel like I needed to go to next station. There is great visibility from the road and a lot of place to stop - there are two lanes changing to one lane and additional lane from the station. There is local traffic mostly, so it needs some patience but after 30min I got a ride to Ohrid.","date":"2025-10-20","rating":4}],"destLat":41.1167,"destLon":20.8023},{"id":32,"lat":41.0859,"lon":21.0197,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-09-21","comments":[{"text":"Nice spot in the shadow, cars go slow because of the corner :)","date":"2025-09-21","rating":4}],"destLat":41.0322,"destLon":21.3357},{"id":57,"lat":41.1074,"lon":20.813,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-06-28","comments":[{"text":"Good spot, space to stop for the cars and shadow during the afternoon","date":"2025-06-28","rating":4}],"destLat":40.9146,"destLon":20.7565},{"id":63,"lat":42.1468,"lon":22.0023,"rating":4,"reviews":1,"wait":25,"signal":"thumb","lastUsed":"2025-04-29","comments":[{"text":"Got dropped of at the restaurant a few meters up the road, but it'd be really hard to get a ride from there. There is a straight stretch of street just a hundred meters further which works much better. Got a ride with a family that invited me for lunch and eventually also to stay the night with them. Great people!","date":"2025-04-29","rating":4}],"destLat":42.1713,"destLon":22.1573},{"id":66,"lat":42.0565,"lon":21.3779,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-02-07","comments":[{"text":"Didn't wait long, caught a ride to Prishtina","date":"2025-02-07","rating":4}],"destLat":42.6474,"destLon":21.1576},{"id":71,"lat":41.1806,"lon":20.6915,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-02-07","comments":[{"text":"Decent spot to head towards Ohrid","date":"2025-02-07","rating":4}],"destLat":41.1253,"destLon":20.8151},{"id":77,"lat":42.0134,"lon":21.5168,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-12-04","comments":[{"text":"Maybe an easier way to go to Kumanovo. The cars are slow.","date":"2024-12-04","rating":4}],"destLat":42.1353,"destLon":21.7071},{"id":81,"lat":41.1539,"lon":22.5124,"rating":4,"reviews":1,"wait":45,"signal":null,"lastUsed":"2024-02-09","comments":[{"text":"Direction Skopje, Kumanovo. It's on the highway, not so many traffic","date":"2024-02-09","rating":4}],"destLat":42.0891,"destLon":21.7104},{"id":85,"lat":42.0086,"lon":20.9732,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-10-24","comments":[{"text":"There is not much space for cars to stop but you can get a ride quickly here towards the Skopje","date":"2023-10-24","rating":4}],"destLat":42.0066,"destLon":21.3329},{"id":87,"lat":41.1184,"lon":20.7991,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-10-20","comments":[{"text":"Not much space for cars to stop but not so bad. After 20 minutes of saying no we do not want taxi or bus we got a ride on the better place where cars go only on direction to Skopje","date":"2023-10-20","rating":4}],"destLat":41.1611,"destLon":20.7507},{"id":94,"lat":42.0018,"lon":21.4906,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-06-02","comments":[{"text":"Good spot bcs cars are coming from left and right. When you are 2 you can stop them from both sides.","date":"2023-06-02","rating":4}],"destLat":42.2263,"destLon":21.7035},{"id":7,"lat":41.9735,"lon":22.7716,"rating":3.67,"reviews":3,"wait":6,"signal":"sign","lastUsed":"2025-12-05","comments":[{"text":"Easy to get rides west","date":"2025-12-05","rating":5},{"text":"people where very nice and offer me food, also police was nice. nobody got me out of the city though.\nbehind the gas station there are toilets and nice grass area where you cant put your tent if needed.","date":"2015-09-10","rating":3}],"destLat":41.9101,"destLon":22.4557},{"id":52,"lat":42.0324,"lon":21.4038,"rating":3.67,"reviews":3,"wait":37,"signal":null,"lastUsed":"2025-07-24","comments":[{"text":"Good spot and fairly busy, got a dude from Geneva that dropped me into a town in Kosovo, you can see the license plates so that helps too.","date":"2025-07-24","rating":5},{"text":"Here is a petrol station for both ways. Workers also so nice and helpful. We two guys hitch-hiked towards Kosova. In 30 hours we found a car until border.","date":"2014-03-30","rating":3}],"destLat":42.3663,"destLon":21.158},{"id":78,"lat":42.0585,"lon":21.3765,"rating":3.67,"reviews":3,"wait":33,"signal":null,"lastUsed":"2024-12-03","comments":[{"text":"walked here after 3 hours waiting at the spot furth to the south. the walk wasnt fun but is doable. there is some space to stop in the entrance road to the gas station. friendly albanians picked me up, and spoke english. this was way harder than i expected.","date":"2024-12-03","rating":3},{"text":"Took me 20 minutes to find a ride to Prishtina here.","date":"2016-07-06","rating":4},{"text":"Direction Kosovo, either ask people at the gas station (but it's quiet, so I wouldn't advise that), or hitch directly on the road with plenty of place to stop and good visibility.","date":"2016-07-06","rating":4}],"destLat":42.3286,"destLon":21.2064},{"id":23,"lat":42.1575,"lon":21.728,"rating":3.6,"reviews":5,"wait":35,"signal":"thumb","lastUsed":"2025-10-20","comments":[{"text":"Do not recommend, cars are going fast and not wanting to stop to go towards Bulgaria, that being said there isn’t a better spot so I agree with the other commenter saying eventually you will be picked up. Use a sign that says KP","date":"2025-10-20","rating":3},{"text":"Cars are going fast, but after some time someone will stop.","date":"2025-04-29","rating":4},{"text":"Ok spot… Not idea but works eventually. To Palanka/BG","date":"2024-12-04","rating":3},{"text":"Direction Kriva Palanka and Bulgaria, traffic is not very high, but the spot itself is fine.","date":"2015-07-31","rating":4}],"destLat":42.1567,"destLon":22.0543},{"id":61,"lat":42.2128,"lon":22.3464,"rating":3.6,"reviews":5,"wait":83,"signal":"thumb","lastUsed":"2025-04-29","comments":[{"text":"Got very lucky here and didn't have to wait at all as the first car immediately stopped and some local guys took me to the border.","date":"2025-04-29","rating":5},{"text":"Found a ride for Sofia. Pretty good!","date":"2024-12-08","rating":5},{"text":"We gave up after waiting for three hours, and were actually picked up while walking up the mountain road.\r\nLocals don't stop because they assume you are for the border, and Bulgarians assume it's a local thing. Mornings there is huge amount of traffic to a mine (рудник) so put up a sign \"5km\" or something of the sort. From where the road of the mine goes off the main road it is just a few bends of the road to the top where the border is (and you can find path that cut those bends).\r\n\r\nBut genera","date":"2023-06-07","rating":2},{"text":"Low traffic, but there are no alternatives. I waited approximately 30 minutes and a man took me directly to the border","date":"2014-09-15","rating":3},{"text":"Place to hitchhike towards the border with Bulgaria. Visibility is okay, traffic is generally slow here. Place is at the end of a town, where road starts going uphill. Waiting time can be high but most vehicles definitely go to the border and further to Kyustendil","date":"2014-05-18","rating":3}],"destLat":42.2214,"destLon":22.4573},{"id":38,"lat":41.1255,"lon":20.787,"rating":3.57,"reviews":7,"wait":111,"signal":"sign","lastUsed":"2025-08-30","comments":[{"text":"Tried with sign that said Albania, but few cars from albania were passing, wrote struga and had a ride in like 5 minutes. If you want to go to Albania definitely go from Struga, you’ll save yourself time.","date":"2025-08-30","rating":4},{"text":"No one stopped","date":"2025-02-07","rating":1},{"text":"Waited there for 6 hours on a sunday in December. Visibility is good and there is plenty of space to stop. Traffic was okay. I guess there was just not that many people going the distance.","date":"2024-12-07","rating":4},{"text":"40 mins to get ride to skopje","date":"2018-08-07","rating":4},{"text":"lond waiting time.. after two hours i was taken by a small motorbike to the main road on gas station","date":"2016-08-03","rating":4}],"destLat":41.1767,"destLon":20.6799},{"id":36,"lat":42.0115,"lon":21.4274,"rating":3.5,"reviews":2,"wait":9,"signal":"thumb","lastUsed":"2025-09-10","comments":[{"text":"I have used this spot also two years ago, don’t remember how long we waited back then, but this time I didn’t wait long at all and got directly to Prizren.","date":"2025-09-10","rating":5},{"text":"Not the best spot, guy just dropped us to a gas station","date":"2025-02-07","rating":2}],"destLat":42.2134,"destLon":20.7358},{"id":29,"lat":42.0068,"lon":21.333,"rating":3.33,"reviews":3,"wait":47,"signal":"thumb","lastUsed":"2025-10-19","comments":[{"text":"Got a ride to Tetovo, even though it was already dark","date":"2025-10-19","rating":4},{"text":"Get a lift to pay toll on the road to Ohrid.1 hour of waiting","date":"2016-06-19","rating":3},{"text":"got a lift to ohrid from here.\nyou could also ask people at the petrolstation.\nsign nieeded.\nwaiting time: 2h","date":"2014-10-08","rating":3}],"destLat":42.0075,"destLon":20.9767},{"id":80,"lat":41.33,"lon":21.5575,"rating":3.33,"reviews":3,"wait":40,"signal":null,"lastUsed":"2024-02-18","comments":[{"text":"Quick ride to Bitola before we even walked onto the main road","date":"2024-02-18","rating":4},{"text":"main road goes by the town. walk to this junction, 10 mins from the centre. okay for both directions.","date":"2011-07-04","rating":3}],"destLat":41.0294,"destLon":21.3278}]}