{"country":"MR","name":"MR","totalSpots":20,"totalReviews":27,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":16,"lat":20.8979,"lon":-17.0592,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-06-15","comments":[{"text":"I hitched the train all the way to Zouerat in January 2015. The night was very cold. Better go in the wagon with other people, especially if you want to stop before Zouerat, to know when is it. I missed my stop in Choum and finished in Zouerat.","date":"2015-06-15","rating":5},{"text":"ONLY for jumping the train to Choum. Make sure you bring some goggles and wear something around your mouth, for the intense dust...\n\nIt was a free-for-all last time I was there in '06.","date":"2012-05-01","rating":5}],"destLat":null,"destLon":null},{"id":20,"lat":18.3382,"lon":-16.0215,"rating":5,"reviews":2,"wait":null,"signal":null,"lastUsed":null,"comments":[{"text":"DIRECTION NOUADIBOU - MOROCCO\nPosition : find the police stop at the end of the city, become friend or bring something and next ask for a ride, they will find for you\nWaiting : 5 min\nSpeed : Police stop every car\nTraffic : 4 Cars / 1min","date":null,"rating":5}],"destLat":null,"destLon":null},{"id":1,"lat":18.1614,"lon":-16.0092,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-10-28","comments":[{"text":"Got a ride from Nouakchott to Agadir , same driver , 3 days ,2000km","date":"2025-10-28","rating":5}],"destLat":30.4181,"destLon":-9.5982},{"id":6,"lat":20.2739,"lon":-13.1836,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Back of pickup truck ride. Free, he gave is food, said he was going only 2km, turned out to be 2 hrs. Just after the police checkpoint.","date":"2024-01-05","rating":5}],"destLat":19.7423,"destLon":-14.3836},{"id":8,"lat":20.5762,"lon":-12.4558,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Scored a free ride with ngo to oudane. Very fast, your experience may vary,","date":"2024-01-05","rating":5}],"destLat":20.9295,"destLon":-11.6184},{"id":9,"lat":20.0486,"lon":-13.038,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Epic pickup truck ride with tourists to the junction, best to leave early, but I left it to late afternoon and it still worked. Free","date":"2024-01-05","rating":5}],"destLat":20.2738,"destLon":-13.1844},{"id":12,"lat":19.5359,"lon":-14.6691,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Stood by the side of the road, got a ride into Central Nouakchott in 5 mins, didn't ask for payment.","date":"2024-01-05","rating":5}],"destLat":18.0873,"destLon":-15.974},{"id":13,"lat":19.7303,"lon":-14.3997,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Just after the police checkpoint, got a ride in a truck for 30km down the road","date":"2024-01-05","rating":5}],"destLat":19.5429,"destLon":-14.6535},{"id":14,"lat":22.7077,"lon":-12.464,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-08-10","comments":[{"text":"This is the place where they form the train towards to Nouadhibou. We came here around 12pm. Some people are gathering around passenger wagon. If you want to ride on the top of iron ore watching all the desert landscapes just move further and find a car that suits you. Train moved to Fedrick in 1,5h or so and also stopped there for around 30min, so we could change the car closer to the train head. The time might be different, so it's better to get here earlier. Make sure you bring warm clothes a","date":"2023-08-10","rating":5}],"destLat":21.0091,"destLon":-17.0323},{"id":17,"lat":21.2983,"lon":-16.9753,"rating":4,"reviews":3,"wait":45,"signal":null,"lastUsed":"2015-06-15","comments":[{"text":"I changed my driver by crossing the border because my past Malian driver was about to be escort directly to Mali border. So I found a french camping-van who was going to Nouadhibou.","date":"2015-06-15","rating":4},{"text":"The Border at Mauritania side close at 18:00 so please try to arrive there earlier. I got there at 17:00 and there is no place to sleep on the Mauritania side only in the Morocco side (at least when i was there Summer 2013)","date":"2015-04-27","rating":4},{"text":"FRONTIERE AND NO MAN'S LAND BETWEEN MAURITANIA AND MOROCCO\nYou will wait a long time with your driver to pass this frontiere, so this is the place to change your plan\nSign : ask for everywhere, I found a ride for more than 2000 km\nWaiting : 2/3 hours for all the process and the crossing of the no man's land\nSpeed : very low","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":3,"lat":16.7503,"lon":-16.1005,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-04-16","comments":[{"text":"I wanted to hitchhike towards Diama border crossing but then i saw that bus with people sitting on a roof and i didnt want to miss my chance for this experience especially when the guy said it costs 2000 senegalese francs, which is like 3 euros. At the end of the ride i realised he ment 10000 (fuck french, srsly), but he got 7500 (guess i still overpaid). Well it was a nice safari, i saw acrocodille, monkeys, wild pigs. But also had to pay 200 MRU for the national park as a white skin tax. If yo","date":"2024-04-16","rating":4}],"destLat":16.2075,"destLon":-16.4143},{"id":4,"lat":18.5411,"lon":-11.44,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-04-13","comments":[{"text":"A police checkpoint, again the police does the job for you. The police in Tidjikja is friendly and had no problem with me camping wild and hitchhiking. Sadly i had some brain failure when the policemen stopped a minubus and said this one goes to Nouakchott for 800, i just took it. I consider it as a mistake, but the fact is that up until Sangrave the road was deserted. If you are in a hurry you can take a bus to there and then continue hitchhiking. But also, there are beautifull places around Nb","date":"2024-04-13","rating":4}],"destLat":18.0699,"destLon":-15.9744},{"id":5,"lat":20.2611,"lon":-13.1017,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2024-04-13","comments":[{"text":"Going from Terjit to Tidjikja during ramadan I came to the police checkpoint. After a short dispute with the policemen he understood i wanna hitchhike but didnt let me, instead of it he hitchhiked for me. He got me a free ride in a truck. Was a nice ride, just had to keep watching the driver who was falling asleep cause of fasting in 40 degrees. The fact i got in with a help of police made passing further checkpoints easier (they called the terjit checkpoint to verify). The road to Tidjikja is p","date":"2024-04-13","rating":4}],"destLat":18.5379,"destLon":-11.439},{"id":15,"lat":20.5064,"lon":-13.0571,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-06-15","comments":[{"text":"Go to the police control and ask them to find you a lift. Even with them, it took me half day to find one. They usually wait for a mini bus with some spare seat. There is also lot of army guys doing this, you may wait them to leave before you go.","date":"2015-06-15","rating":3},{"text":"At the end of the town, at the police control.","date":"2015-06-15","rating":3}],"destLat":null,"destLon":null},{"id":18,"lat":20.8875,"lon":-17.0567,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-06-07","comments":[{"text":"There's no need to pay for rides, it's definitely possible to find someone who will take you for free. (I've been there in 2011 and 2012)","date":"2014-06-07","rating":3},{"text":"ask the drivers for Dakhla or Nouakshoot, they will help you mostly, but dont pay more then 200 dirams to Dakhla or 60 dirams to Nouakshoot.\nDont drive with the people from Marocco group, they are really criminals, they want more for the way back as for the way to Nouakshoot.look for european plates.","date":"2007-09-05","rating":3}],"destLat":null,"destLon":null},{"id":19,"lat":18.1434,"lon":-16.0069,"rating":3,"reviews":2,"wait":630,"signal":null,"lastUsed":"2011-05-16","comments":[{"text":"There's a police check point around here, as of March 2011, the folks here are very friendly and will do all the hitching for you. The latter will take some time, though.","date":"2011-05-16","rating":3}],"destLat":null,"destLon":null},{"id":7,"lat":20.5762,"lon":-12.4554,"rating":3,"reviews":1,"wait":60,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Nice Arab tourist picked me up. 2nd car to pass, first one demanded payment.","date":"2024-01-05","rating":3}],"destLat":20.6353,"destLon":-12.2978},{"id":11,"lat":20.5263,"lon":-13.0116,"rating":3,"reviews":1,"wait":120,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Walked out of atar beyond the checkpoint. Most of the cars just going to a small village or are shared taxis. One guy stopped but demanded payment, then a nice tourist stopped and took me to chinguetti. Long wait but it worked.","date":"2024-01-05","rating":3}],"destLat":20.4638,"destLon":-12.3662},{"id":2,"lat":21.2687,"lon":-16.8926,"rating":2,"reviews":1,"wait":300,"signal":null,"lastUsed":"2024-04-16","comments":[{"text":"Waited for a really long time in sandy wind. Cars asking for payment or signalling they go locally. Finally a guy stopped cause he thought we have some problem. We wanted to nouakchott but his backdoor broke so he went back to nouadhibou, we decjded to go with him and got a dinner invitation.","date":"2024-04-16","rating":2}],"destLat":20.8769,"destLon":-17.0692},{"id":10,"lat":20.9246,"lon":-11.6522,"rating":2,"reviews":1,"wait":400,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Very few cars leave oudane, most in the morning so get up super early. I missed most of the cars, two stopped but demanded payment (quite rudely). The a couple where full, but for hours on end there was nothing. I hiked out further and got a lift with some tourists in late afternoon. Be willing to pay or wait, and get up early.","date":"2024-01-05","rating":2}],"destLat":20.505,"destLon":-12.8513}]}