{"country":"MR","name":"MR","totalSpots":10,"totalReviews":27,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":1,"lat":18.1614,"lon":-16.0092,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-10-28","comments":[{"text":"Got a ride from Nouakchott to Agadir , same driver , 3 days ,2000km","date":"2025-10-28","rating":5}],"destLat":30.4181,"destLon":-9.5982},{"id":6,"lat":20.2739,"lon":-13.1836,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Back of pickup truck ride. Free, he gave is food, said he was going only 2km, turned out to be 2 hrs. Just after the police checkpoint.","date":"2024-01-05","rating":5}],"destLat":19.7423,"destLon":-14.3836},{"id":8,"lat":20.5762,"lon":-12.4558,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Scored a free ride with ngo to oudane. Very fast, your experience may vary,","date":"2024-01-05","rating":5}],"destLat":20.9295,"destLon":-11.6184},{"id":9,"lat":20.0486,"lon":-13.038,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Epic pickup truck ride with tourists to the junction, best to leave early, but I left it to late afternoon and it still worked. Free","date":"2024-01-05","rating":5}],"destLat":20.2738,"destLon":-13.1844},{"id":12,"lat":19.5359,"lon":-14.6691,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Stood by the side of the road, got a ride into Central Nouakchott in 5 mins, didn't ask for payment.","date":"2024-01-05","rating":5}],"destLat":18.0873,"destLon":-15.974},{"id":13,"lat":19.7303,"lon":-14.3997,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-01-05","comments":[{"text":"Just after the police checkpoint, got a ride in a truck for 30km down the road","date":"2024-01-05","rating":5}],"destLat":19.5429,"destLon":-14.6535},{"id":14,"lat":22.7077,"lon":-12.464,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-08-10","comments":[{"text":"This is the place where they form the train towards to Nouadhibou. We came here around 12pm. Some people are gathering around passenger wagon. If you want to ride on the top of iron ore watching all the desert landscapes just move further and find a car that suits you. Train moved to Fedrick in 1,5h or so and also stopped there for around 30min, so we could change the car closer to the train head. The time might be different, so it's better to get here earlier. Make sure you bring warm clothes a","date":"2023-08-10","rating":5}],"destLat":21.0091,"destLon":-17.0323},{"id":3,"lat":16.7503,"lon":-16.1005,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-04-16","comments":[{"text":"I wanted to hitchhike towards Diama border crossing but then i saw that bus with people sitting on a roof and i didnt want to miss my chance for this experience especially when the guy said it costs 2000 senegalese francs, which is like 3 euros. At the end of the ride i realised he ment 10000 (fuck french, srsly), but he got 7500 (guess i still overpaid). Well it was a nice safari, i saw acrocodille, monkeys, wild pigs. But also had to pay 200 MRU for the national park as a white skin tax. If yo","date":"2024-04-16","rating":4}],"destLat":16.2075,"destLon":-16.4143},{"id":4,"lat":18.5411,"lon":-11.44,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-04-13","comments":[{"text":"A police checkpoint, again the police does the job for you. The police in Tidjikja is friendly and had no problem with me camping wild and hitchhiking. Sadly i had some brain failure when the policemen stopped a minubus and said this one goes to Nouakchott for 800, i just took it. I consider it as a mistake, but the fact is that up until Sangrave the road was deserted. If you are in a hurry you can take a bus to there and then continue hitchhiking. But also, there are beautifull places around Nb","date":"2024-04-13","rating":4}],"destLat":18.0699,"destLon":-15.9744},{"id":5,"lat":20.2611,"lon":-13.1017,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2024-04-13","comments":[{"text":"Going from Terjit to Tidjikja during ramadan I came to the police checkpoint. After a short dispute with the policemen he understood i wanna hitchhike but didnt let me, instead of it he hitchhiked for me. He got me a free ride in a truck. Was a nice ride, just had to keep watching the driver who was falling asleep cause of fasting in 40 degrees. The fact i got in with a help of police made passing further checkpoints easier (they called the terjit checkpoint to verify). The road to Tidjikja is p","date":"2024-04-13","rating":4}],"destLat":18.5379,"destLon":-11.439}]}