{"country":"MW","name":"MW","totalSpots":3,"totalReviews":7,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":3,"lat":-9.5979,"lon":33.7723,"rating":5,"reviews":2,"wait":60,"signal":null,"lastUsed":"2013-01-10","comments":[{"text":"Oh and the fine for my drivers was about 10.000 MWK. Which tripled my total price for going to Lilongwe. Agreed to pay 5.000 at first.","date":"2013-01-10","rating":5},{"text":"Very good spot for going south into Malawi. Alot of Malawians import their cars from Tanzania and will be happy to take you.\nThey will expect some kind of payment though, DO NOT tell this to the police/army checkpoints, it is not allowed to take someone and have them pay since it will be seen as a taxi service, and the car doesnt have a taxi permit.\nJust wait outside on the left side of the immigration building, coming from Tanzania. All cars have to pass through there eventually. If you're gett","date":"2013-01-10","rating":5}],"destLat":null,"destLon":null},{"id":2,"lat":-15.4537,"lon":34.4531,"rating":4,"reviews":3,"wait":180,"signal":null,"lastUsed":"2015-10-07","comments":[{"text":"a paid lift is not it's not an hitch hitchhiking lift by definition: it's a business.","date":"2015-10-07","rating":4},{"text":"That's good to know. Thanks","date":"2010-12-21","rating":4},{"text":"Hitching is a little different in Malawi.  You are expected to pay a little bit towards gas, but other then that, hitching is a very culturally exceptable way to get around.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":1,"lat":-11.4709,"lon":33.9893,"rating":1,"reviews":2,"wait":null,"signal":null,"lastUsed":"2015-10-07","comments":[{"text":"A good spot but the worst place ever to hitchhicke on the 65 cultures I went, from asia to america. Only expats (whites, Pakistani, Indians). Most Malawite will try to take advantage of your situation to make you pay (even if they are richer than you), begging is the national sport. Be aware that they can agree to take you for free but will change their mind one you will have make a couple of km with them, and they sometime become quite violent (on guy threatened me with iron rod). It's sad, but","date":"2015-10-07","rating":1}],"destLat":null,"destLon":null}]}