{"country":"NO","name":"Norvège","totalSpots":395,"totalReviews":1805,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":47,"lat":70.4325,"lon":24.5015,"rating":5,"reviews":7,"wait":24,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Easy ride to Alta.","date":"2024-06-27","rating":5},{"text":"Great for Hammerfest, North Cape and Alta.","date":"2017-08-22","rating":5},{"text":"I hitchhiked at the gas station exit and got a direct ride to Nordkapp early in the morning. Don't expect a lot of traffic though.","date":"2016-07-15","rating":5},{"text":"Good spot for Hammerfest or to the NorthCape :)","date":"2015-06-27","rating":5},{"text":"good place to go north or to hammerfall too","date":"2012-06-24","rating":5}],"destLat":69.9772,"destLon":23.2932},{"id":466,"lat":63.3222,"lon":10.3029,"rating":5,"reviews":7,"wait":12,"signal":"sign","lastUsed":"2024-07-16","comments":[{"text":"Great spot for going south to Oslo, we got a hitch to Elverum, maybe worth waiting for a longer ride?","date":"2024-07-16","rating":5},{"text":"Update: As of summer 2017 there is construction work on the E6 all the way from Trondheim and further south. There is NO space for cars to stop here but if you walk down south there will be a small dirt road that turns off the E6 where cars can stop though it's not very big. I got lucky and a lorry just stopped in the middle of the road for me.","date":"2017-08-22","rating":5},{"text":"Great spot to go south! I got picked up after only 10 minutes and dropped off in Dombas!","date":"2016-07-27","rating":5},{"text":"Statoil gas station just near the roundabout, where it is worth to go and ask the many truck drivers filling gas there. Waited 5 minutes for a truck going to Dombas.","date":"2015-07-14","rating":5},{"text":"Great spot for going west on the E39 or south on the E6. Take the bus 310, 340 or 410 and stop at Storler, it costs 50 NOK.","date":"2014-08-05","rating":5}],"destLat":60.8783,"destLon":11.5302},{"id":253,"lat":59.3864,"lon":10.7519,"rating":5,"reviews":6,"wait":8,"signal":"sign","lastUsed":"2025-07-29","comments":[{"text":"the other gas station in Moss sucks but from here i got a ride to Oslo almost instantly, even if theres not a lot of space. plenty of traffic.","date":"2025-07-29","rating":5},{"text":"Not much space to pull over, but not a problem at all (!), much traffic to Oslo.","date":"2024-08-01","rating":5},{"text":"Good place catch a  ride after few minutes towards Oslo","date":"2016-06-26","rating":5},{"text":"nice long road from the airport. we were picked up before we even made it the crossroad (like 5 minutes max.)","date":"2013-09-20","rating":5},{"text":"I was so lucky to get a ride in 40 seconds :-)","date":"2012-05-15","rating":5}],"destLat":59.8957,"destLon":10.7564},{"id":265,"lat":59.7714,"lon":10.2639,"rating":5,"reviews":5,"wait":8,"signal":"sign","lastUsed":"2025-07-27","comments":[{"text":"Gas station and restaurants, lots of people, easy to get rides anywhere South. Mosser and his three children Jacob, Maria and David, picked me up on a ride to Horten, and conversed about Norwegian social structures.","date":"2025-07-27","rating":5},{"text":"Asked around and found a car going to Stavanger after trying with 3 cars","date":"2025-03-15","rating":5},{"text":"I stood at the exit of the gas station, where the parking lot starts. Got a ride to Tonsberg in a few minutes.","date":"2015-07-20","rating":5},{"text":"Waited 15 minutes for a hitch-hike to Skien.","date":"2013-04-28","rating":5},{"text":"Gasstation by E18, the main road between Oslo and Kristiansand. This is a very good spot if you are going south!","date":"2013-04-28","rating":5}],"destLat":59.4226,"destLon":10.3654},{"id":600,"lat":69.643,"lon":18.9772,"rating":5,"reviews":5,"wait":15,"signal":null,"lastUsed":"2023-06-14","comments":[{"text":"It was quick ! Lots of cars passing by with a good spot to stop if needed","date":"2023-06-14","rating":5},{"text":"Easy to spot. Cars are coming fairly slow. Got a ride here to Fagernes in 10 mins","date":"2018-11-27","rating":5},{"text":"Hitchhiked from here twice, and never had to wait longer than 30 mins!","date":"2016-07-27","rating":5},{"text":"Walk past the roundabout and you will find a little spot for cars to pull over, so perfect location. I had to wait 15 mins for a ride to E6.","date":"2016-07-15","rating":5},{"text":"i would say not difficult to get a ride toward the directtion of Navik.","date":"2014-07-21","rating":5}],"destLat":68.4432,"destLon":17.4431},{"id":21,"lat":59.4258,"lon":10.7067,"rating":5,"reviews":4,"wait":10,"signal":"ask","lastUsed":"2025-12-11","comments":[{"text":"We were asking the people at the gas station and got the 6 hour ride strait to Helsingborg","date":"2025-12-11","rating":5},{"text":"look for danish plates. after few minutes of asking some couple took us to copenhagen","date":"2025-07-28","rating":5},{"text":"One minute to catch a ride to Prague for four people...","date":"2023-11-06","rating":5},{"text":"A great spot to head south. Gas station to ask people around and one direction. 15mins wait to get a ride to Sarpsborg","date":"2018-08-04","rating":5}],"destLat":56.0636,"destLon":12.6947},{"id":33,"lat":68.2364,"lon":14.557,"rating":5,"reviews":4,"wait":6,"signal":"sign","lastUsed":"2025-10-17","comments":[{"text":"Good spot, driver took me to Hauklandstranda, even if she wasn't going there.","date":"2025-10-17","rating":5},{"text":"Enough space, a norwegian lady picked me up","date":"2025-07-01","rating":5}],"destLat":68.1943,"destLon":13.5389},{"id":330,"lat":60.4213,"lon":5.4605,"rating":5,"reviews":4,"wait":14,"signal":"thumb","lastUsed":"2025-05-26","comments":[{"text":"Good spot to get into Bergen. Clear visibility and close to public transit","date":"2025-04-21","rating":5},{"text":"Got a ride all the way to Voss. Good spot. No Hut there to take cover  in case of Rain but there is an underpass.\r\n\r\n***for Reference: I‘m a woman, mid-twenties, white. I usually use a sign. Got a ride on a Saturday afternoon.","date":"2024-11-17","rating":5},{"text":"Managed to get a ride quite quickly to the spot at Trengereid. I think this might be a better spot than the one close by. It‘s a 5 Minute walk from Arna Trainstation. Took the train from Bergen to Arna - as mentioned in the other spot.","date":"2024-11-14","rating":5}],"destLat":60.4214,"destLon":5.4605},{"id":82,"lat":63.1975,"lon":10.3017,"rating":5,"reviews":3,"wait":28,"signal":"thumb","lastUsed":"2025-09-08","comments":[{"text":"Still a great spot, got a ride with a guy transporting a boat to Telemark (?). Don’t mind my 50min wait time - I’m a scruffy looking guy so this place is as good as they come for me. I really recommend it for going Trondheim til Oslo.","date":"2025-09-08","rating":5},{"text":"Got a ride with a crazy Tajik truck driver guy, tons of fun straight to where I wanted. A great spot to leave Trondheim as the cars drive slow, can see you from ages away and have good space to stop","date":"2025-08-22","rating":5},{"text":"Bus stop，a German picked me up:)","date":"2025-07-01","rating":5}],"destLat":59.913,"destLon":10.8092},{"id":83,"lat":58.1381,"lon":7.9508,"rating":5,"reviews":3,"wait":19,"signal":null,"lastUsed":"2025-09-08","comments":[{"text":"Nice spot for going west!","date":"2025-09-08","rating":5},{"text":"Perfect spot for going to Stavanger.\nIt's a bus stop - much place for cars to stop, and they're not going that fast in here as it's just after the roundabout.","date":"2014-07-26","rating":5}],"destLat":58.0358,"destLon":7.448},{"id":132,"lat":59.3855,"lon":10.7508,"rating":5,"reviews":3,"wait":7,"signal":null,"lastUsed":"2025-08-25","comments":[{"text":"Very good spot, big space for stopping.","date":"2025-08-25","rating":5},{"text":"Great spot if you want to go south. \nIt took my and my friend around 5 minutes to get a ride to Sarpsborg.","date":"2015-11-20","rating":5},{"text":"Got a ride to Halden within 10 minutes.","date":"2014-06-04","rating":5}],"destLat":59.329,"destLon":10.9595},{"id":176,"lat":62.4693,"lon":6.2416,"rating":5,"reviews":3,"wait":3,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"First ride in an electric car WOOHOO!!! Very exciting. It was A BMW i3 (for those interested souls). Taken out of the city, saving the walk. Great talk with the driver about an electric future (he must get that a lot).","date":"2014-10-20","rating":5}],"destLat":62.4674,"destLon":6.3519},{"id":255,"lat":63.4463,"lon":10.8899,"rating":5,"reviews":3,"wait":17,"signal":"thumb","lastUsed":"2025-07-28","comments":[{"text":"good spot, some guy took us to the south of trondheim","date":"2025-07-28","rating":5},{"text":"This spot is directly on the motorway. You can just walk to the spot, and people don't seem to be bothered by pedestrians on the motorway. It's sort of a bus stop, got picked up within minutes!","date":"2016-07-27","rating":5}],"destLat":null,"destLon":null},{"id":259,"lat":60.0721,"lon":6.5529,"rating":5,"reviews":3,"wait":25,"signal":null,"lastUsed":"2025-07-28","comments":[{"text":"takes some time, but generally good spot. we hitchhiked late in te evening so maybe thats why it took so long","date":"2025-07-28","rating":5},{"text":"A nice guy going to work in Tyssedal took me to Park 1","date":"2025-06-30","rating":5}],"destLat":60.5684,"destLon":6.9161},{"id":290,"lat":60.1934,"lon":11.0975,"rating":5,"reviews":3,"wait":4,"signal":"sign","lastUsed":"2025-07-17","comments":[{"text":"Three girls, got a ride to Oslo, waited for only a couple of minutes, in the morning. Lots of empty cars of people who drop off their friends/family.","date":"2025-07-17","rating":5},{"text":"Asked cars on the parking lot, first one agreed to bring me close to the highway where I needed to go","date":"2025-03-25","rating":5},{"text":"I only tried this spot for ten minutes because it was raining and people were hectic. Getting a ride to Oslo should be a guarantee, so many people go there.\r\nGoing north - not sure. I'm not sure how people behave that have parked their car here long-term and go home north. That's why I went to Roald Amundsens veg a bit south, where many people theoretically ought to come by when leaving the parking lot to go on E6. \r\nNot sure if people being picked up from friends/family that go north would get ","date":"2023-08-07","rating":5}],"destLat":59.8945,"destLon":10.805},{"id":328,"lat":60.5828,"lon":5.7947,"rating":5,"reviews":3,"wait":14,"signal":"sign","lastUsed":"2025-05-26","comments":[{"text":"Bus stop, heading to Voss / Oslo","date":"2025-05-26","rating":5},{"text":"Perfect place to wait in both directions. There are bus stop on each side, cars can see you far away and have place to stop. You can also ask to drivers on the gas station.","date":"2014-01-08","rating":5}],"destLat":60.5829,"destLon":5.7953},{"id":350,"lat":68.5569,"lon":17.5624,"rating":5,"reviews":3,"wait":13,"signal":"thumb","lastUsed":"2025-03-24","comments":[{"text":"Really great spot, I stood a bit before the bus stop to make sure cars could see me and stop at the bus stop behind me (but it’s a bit dangerous for me because I stand next to the road)","date":"2025-03-24","rating":5},{"text":"Super nice spot","date":"2024-08-07","rating":5},{"text":"Top spot! Bus stop, enough place to stop.","date":"2023-07-10","rating":5}],"destLat":68.5571,"destLon":17.5619},{"id":381,"lat":63.6105,"lon":11.0518,"rating":5,"reviews":3,"wait":33,"signal":null,"lastUsed":"2025-02-21","comments":[{"text":"Perfect place, just on the E6. There is a bus stop so cars can stop. We got offered a few rides to Levanger but refused those. Later we got a ride to Steinkjer","date":"2025-02-21","rating":5},{"text":"Nice spot where car can pull over. We were standing with a Steinkjer sign and someone took us to that city. The shop on the other side of the road is closed on Sunday.","date":"2023-08-14","rating":5},{"text":"The first car stopped after only 5 minutes, but it only drove a short distance, so I had to reject it. There's plenty of room to stop. I recommend it when traveling north!","date":"2023-07-11","rating":5}],"destLat":64.0179,"destLon":11.4907},{"id":447,"lat":62.9645,"lon":7.769,"rating":5,"reviews":3,"wait":24,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"Big bustop with plenty of space to stop. Traffic is fairly fast, moderate flow that evening and visibility is OK, within 10 mins a car stopped going to kristiansund, but none to trondheim. Eventually another one to kristiansund stopped and took me over the bridge to the better spot at the rest area. For kristiansund this is great, for trondheim maybe the rest area is better, you can walk over the bridge.","date":"2024-08-10","rating":5},{"text":"Walked over the bridge to take in the view and tickle our senses after which we arrived at the bus stop and got picked up by the first car. A ride to Molde with a top man. Another ride waiting for less than a minute.","date":"2014-10-20","rating":5}],"destLat":62.9751,"destLon":7.7876},{"id":449,"lat":60.8981,"lon":7.2111,"rating":5,"reviews":3,"wait":37,"signal":"sign","lastUsed":"2024-08-09","comments":[{"text":"We got a ride to Utøya, with a sign for Oslo. Guy was going all the way to Sweden so could’ve got a longer one. Good place to go to Oslo since this is one of the main roads people take.","date":"2024-08-09","rating":5},{"text":"Just before the entrance to the tunnel; there´s a lot of space for the cars to stop. Got a ride with another hitchhiking couple after 10 minutes.","date":"2015-09-16","rating":5}],"destLat":60.0245,"destLon":10.2682},{"id":505,"lat":60.3724,"lon":5.3398,"rating":5,"reviews":3,"wait":10,"signal":null,"lastUsed":"2023-09-14","comments":[{"text":"We got a ride to Leirvik\r\nThe ferrys cost per car, not per passanger anymore","date":"2023-09-14","rating":5},{"text":"probably the best spot I ever hitch-hiked!","date":"2013-06-09","rating":5},{"text":"This spot is excellent for heading south the Stavanger.  Waited 2-3 minutes for a direct ride to Stavanger.  NOTE: you'll need to pay for two ferries along the way.  One costs 55kr, and the other 35kr, so be prepared.","date":"2012-08-31","rating":5}],"destLat":60.3723,"destLon":5.3397},{"id":26,"lat":67.2591,"lon":15.4019,"rating":5,"reviews":2,"wait":23,"signal":"thumb","lastUsed":"2025-10-17","comments":[{"text":"Enough space to stop and cars are slow after the roundabout. If blocked by parking cars there are simiar spots just a bit further. Got a 1700km ride to southern Sweden.","date":"2024-04-07","rating":5}],"destLat":66.3204,"destLon":14.1713},{"id":104,"lat":67.2784,"lon":14.4363,"rating":5,"reviews":2,"wait":24,"signal":null,"lastUsed":"2025-09-02","comments":[{"text":"After having wait 1h at the other spot, i waited 3mins here and was picked up by a german","date":"2025-09-02","rating":5},{"text":"I think this is the best spot to hitch out of Bodo, there is space near the road for cars to stop, visibility is not great, but after 45 minutes of waiting a Lithuanian guy picked me up and gave me a lift to Loding.","date":"2023-08-07","rating":5}],"destLat":67.2955,"destLon":14.755},{"id":108,"lat":62.4708,"lon":6.1635,"rating":5,"reviews":2,"wait":15,"signal":"thumb","lastUsed":"2025-09-02","comments":[{"text":"A guy and a girl on a Tuesday at noon without a sign. A lot of rather slow passage and place for cars to stop. We quickly got a ride to the ferry.","date":"2025-09-02","rating":5},{"text":"A nice bus stop to get out of town.","date":"2025-08-09","rating":5}],"destLat":62.4147,"destLon":6.3281},{"id":118,"lat":60.0841,"lon":10.2865,"rating":5,"reviews":2,"wait":23,"signal":"thumb","lastUsed":"2025-08-27","comments":[{"text":"A guy and a girl on a Wednesday afternoon without a sign. This spot is a good gas station with food, toilet and a nice view. Two cars offered to take us to Hønefoss, but we tried to get past it due to the bad hitchmap reviews of Hønefoss. We eventually got a ride to Gol.","date":"2025-08-27","rating":5},{"text":"Lots of cars pass heading inland great space for stopping. Food and toilet accessible","date":"2025-07-31","rating":5}],"destLat":60.7038,"destLon":8.9357},{"id":133,"lat":59.3249,"lon":10.9561,"rating":5,"reviews":2,"wait":2,"signal":"thumb","lastUsed":"2025-08-25","comments":[{"text":"Very good spot going south.","date":"2025-08-25","rating":5},{"text":"At the bus stop, much space to pull over, the cars go slowly after the roundabout, got a ride to Gøteborg/Sweden.","date":"2024-08-01","rating":5}],"destLat":56.6648,"destLon":12.8944},{"id":141,"lat":68.4069,"lon":17.4134,"rating":5,"reviews":2,"wait":20,"signal":"thumb","lastUsed":"2025-08-23","comments":[{"text":"Go a ride all the way to Fauske after a while","date":"2025-08-23","rating":5},{"text":"Good spot, slow cars with space to pull over","date":"2025-03-20","rating":5}],"destLat":67.2633,"destLon":15.401},{"id":213,"lat":58.9957,"lon":5.6503,"rating":5,"reviews":2,"wait":25,"signal":null,"lastUsed":"2025-08-06","comments":[{"text":"Good spot for catching a ride all the way to Bergen","date":"2025-08-06","rating":5},{"text":"Good Spot. Easy to get a ride to the ferry or with a bit of Luck all the Way up to Haugesund or Bergen. Both times i hitchhiked from there i got a ride within 30-40 min. If you‘re coming from Stavanger it makes sense to take the Bus to out there.","date":"2024-11-14","rating":5}],"destLat":59.4202,"destLon":5.4481},{"id":305,"lat":62.4816,"lon":6.8247,"rating":5,"reviews":2,"wait":3,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Early morning, picked up by a norwegian man who was going to work","date":"2025-07-01","rating":5},{"text":"I think there was some driveway to pull over just beyond the junction. Traffic slowed by hill. Literally 1 min before some Chad picked me up and took me to molde","date":"2024-08-10","rating":5}],"destLat":62.3822,"destLon":6.9861},{"id":312,"lat":67.2599,"lon":15.4075,"rating":5,"reviews":2,"wait":15,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"a good spot in the morning, picked up by a Norwegian lady who was going home from work","date":"2025-07-01","rating":5},{"text":"Somewhere along this road there is big space for cars to stop, good location and good visibility. Great for going south towards Mo I Rana or Sweden. Waited 15 minutes here.","date":"2023-08-07","rating":5}],"destLat":66.9814,"destLon":15.3149},{"id":316,"lat":68.5509,"lon":17.5456,"rating":5,"reviews":2,"wait":13,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Wild camping at the water side, and started early in the morning, a man from Latvia picked me up when he was going to work in Bogen","date":"2025-07-01","rating":5},{"text":"If you don’t want to stay right after the roundabout, this is a great alternative. Direction Lofoten.","date":"2024-08-31","rating":5}],"destLat":68.5232,"destLon":17.0077},{"id":424,"lat":68.4478,"lon":17.4579,"rating":5,"reviews":2,"wait":5,"signal":"thumb","lastUsed":"2024-08-31","comments":[{"text":"Direction north (or Lofoten), just after a roundabout, there is enough space for cars to stop.","date":"2024-08-31","rating":5},{"text":"Direction north from Narvik (or Lofoten), just after a roundabout, there is enough space.","date":"2024-08-31","rating":5}],"destLat":68.5142,"destLon":17.5548},{"id":506,"lat":68.5495,"lon":17.5559,"rating":5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2023-09-12","comments":[{"text":"Great spot, right after the roundabout, stand on the grass and cars can see you well. Hitched here in the morning and got a ride to Henningsvaer after 30 minutes. Some people are also going in direction of Harstad. But then surfers, tourists, climbers going in direction of Lofoten.","date":"2023-08-06","rating":5}],"destLat":68.5494,"destLon":17.5558},{"id":2,"lat":66.3257,"lon":14.1987,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2026-02-06","comments":[{"text":"january. waited about 10 minutes and some truck driver took me to ballangen","date":"2026-02-06","rating":5}],"destLat":68.3361,"destLon":16.8137},{"id":3,"lat":59.5141,"lon":10.2047,"rating":5,"reviews":1,"wait":2,"signal":"ask","lastUsed":"2026-01-18","comments":[{"text":"The second car we asked agreed to take me and my girlfriend to Oslo. Very good spot, lot of traffic.","date":"2026-01-18","rating":5}],"destLat":59.9382,"destLon":10.6858},{"id":20,"lat":59.8942,"lon":10.8055,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-12-29","comments":[{"text":"Talk too people at the Gas Station","date":"2025-12-29","rating":5}],"destLat":59.8942,"destLon":10.8055},{"id":38,"lat":59.9803,"lon":10.9929,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Great spot to head towards Oslo! There's not much space for drivers to pull over, but it's wide enough for them to pull to the side and stop. It's also beneficial that there is a roundabout and drivers go slower and can take their time to think about picking you up when they see you.","date":"2025-10-15","rating":5}],"destLat":59.9148,"destLon":10.7649},{"id":45,"lat":69.9389,"lon":22.0519,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-10-15","comments":[{"text":"One of my best hitchhiking experiences from that spot. Lady who took, offered me a place to sleep in her campervan on Fosselv Camping. She left me a keys and I could do a laundry also - just amazing","date":"2025-10-15","rating":5}],"destLat":69.8389,"destLon":21.2081},{"id":46,"lat":69.9644,"lon":23.2579,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-10-15","comments":[{"text":"I was lazy to walk to the spots on exit from the city and I think this bus stop is good enough","date":"2025-10-15","rating":5}],"destLat":69.9407,"destLon":22.051},{"id":55,"lat":61.7501,"lon":9.551,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-10-08","comments":[{"text":"One male 40+, with a sign \"Oslo\", one big and one small backpacks, sunny and warm day. Going to Oslo.\r\nA bus stop, good visibility and enough space even for a lorry to stop. Much closer there is a petrol station, but it's on a curve with almost no space to stop, so I think this place is better and worth the extra 20 minutes walk.\r\nI was very luck this time. I waited only 10 minutes and I got a ride straight to the Oslo centre.","date":"2025-10-08","rating":5}],"destLat":59.9095,"destLon":10.7509},{"id":56,"lat":59.7185,"lon":10.784,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-10-08","comments":[{"text":"One male 40+, with a sign \"Stockholm\", one big and one small backpacks, rainy day.\r\nA bus stop, good visibility and enough space even for a lorry to stop. Not very busy road, a few cars per minut.\r\nI waited only 20 minutes. The fact that I was wearing a t-shirt with a big Polish emblem helped me loooads. The lorry driver who stopy was Polish. He took me to the border, where I quicky got a ride from an anothy Polish truck driver to Stockholm. I'm not sure how long I'd have to wait if I didn't hav","date":"2025-10-08","rating":5}],"destLat":59.4892,"destLon":11.7586},{"id":57,"lat":63.4149,"lon":11.7406,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-10-03","comments":[{"text":"Great spot, got it all! Just a shame all the drivers are Norwegian. Good possibilities here to camp down the hill in the trees if you need","date":"2025-10-03","rating":5}],"destLat":63.3176,"destLon":12.088},{"id":74,"lat":59.2506,"lon":6.1629,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-09-13","comments":[{"text":"The easiest is to ask on the boat!\r\nI found fiew rides to the next town, but went with a polish truck driver for a big night ride to Oslo !\r\nIt was the only truck though","date":"2025-09-13","rating":5}],"destLat":59.93,"destLon":10.6977},{"id":85,"lat":59.1114,"lon":10.1111,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-09-08","comments":[{"text":"Got really lucky a Sunday at 20.00 because got a ride to Kristiansand. It's a good spot with good visibility, space for cars to stop, direct access to highway, slow speed for cars, really nice!","date":"2025-09-08","rating":5}],"destLat":58.1788,"destLon":8.1328},{"id":87,"lat":59.7707,"lon":10.2625,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-09-08","comments":[{"text":"People going from gas station can see you perfectly, the ones on the main road go quite fast. The space to stop its okay","date":"2025-09-08","rating":5}],"destLat":59.1773,"destLon":10.2085},{"id":90,"lat":58.7723,"lon":5.8453,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-09-07","comments":[{"text":"A guy and a girl on a Saturday afternoon without a sign. A nice spot on the way to Kristiansand with enough space on the bus stop, a lot of traffic, and cars going rather slow. We got a ride to a small village further on the road.","date":"2025-09-07","rating":5}],"destLat":58.5228,"destLon":6.1152},{"id":94,"lat":60.3616,"lon":5.343,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-09-06","comments":[{"text":"A guy and a girl on a Friday afternoon without a sign. The higher spots were inaccessible due to roadwork, so we walked to this one instead, which I think is for the best : there is a lot of space to stop and cars go slow because of the roundabout. There seem to be a lot of buses passing through this busstop, but we quickly got a ride to Stavanger anyway.","date":"2025-09-06","rating":5}],"destLat":58.9919,"destLon":5.6439},{"id":112,"lat":65.183,"lon":12.1136,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-31","comments":[{"text":"There was lots of cars waiting because one ferry was not working, so I asked around and managed to get a ride to Bodø.","date":"2025-08-31","rating":5}],"destLat":67.2884,"destLon":14.3949},{"id":122,"lat":61.0621,"lon":7.5115,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-08-26","comments":[{"text":"Great visilibity and a lot place for cars to stop even for trucks. Great spot for oslo and sweden. Truck driver took me to the border.\r\nKeep in mind that in this area theres very few cars so you can wait a while but theres no other option:)\r\n\r\nSolo male, thumb","date":"2025-08-26","rating":5}],"destLat":59.0871,"destLon":11.2499},{"id":128,"lat":60.6324,"lon":11.2987,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-08-25","comments":[{"text":"Big space for stopping.","date":"2025-08-25","rating":5}],"destLat":59.9095,"destLon":10.7841},{"id":134,"lat":59.6548,"lon":10.2299,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-25","comments":[{"text":"A Turkish taxi driver took me to the Shell where the road turns towards E6.","date":"2025-08-25","rating":5}],"destLat":59.7662,"destLon":10.2576},{"id":147,"lat":61.2065,"lon":10.4321,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-08-20","comments":[{"text":"good spot cars are very slow here and after couple of minutes I catch car to Otta with guy from Norway","date":"2025-08-20","rating":5}],"destLat":61.772,"destLon":9.5428},{"id":159,"lat":59.8515,"lon":10.7815,"rating":5,"reviews":1,"wait":75,"signal":"sign","lastUsed":"2025-08-15","comments":[{"text":"The bus stop has plenty of space to pull over. You might consider using a sign. There’s a lot of traffic. I only got a very short ride, just enough to get out of Oslo.","date":"2025-08-15","rating":5}],"destLat":59.7415,"destLon":10.7782},{"id":166,"lat":69.0939,"lon":18.5921,"rating":5,"reviews":1,"wait":7,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"some place to stop after the roundabout","date":"2025-08-15","rating":5}],"destLat":69.0627,"destLon":18.4951},{"id":167,"lat":69.1325,"lon":18.5806,"rating":5,"reviews":1,"wait":3,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"a truck turning right brought me a few km south","date":"2025-08-15","rating":5}],"destLat":69.0942,"destLon":18.5923},{"id":169,"lat":69.5673,"lon":19.1546,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"third car picked me up, got lucky as cars drive pretty fast","date":"2025-08-15","rating":5}],"destLat":69.2173,"destLon":19.5581},{"id":172,"lat":69.931,"lon":23.2571,"rating":5,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2025-08-11","comments":[{"text":"Good spot to head south from Alta. People can go longer distances to Finland/Sweden. Summer, male traveller","date":"2025-08-11","rating":5}],"destLat":68.2845,"destLon":23.0806},{"id":174,"lat":63.4315,"lon":10.5698,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"Lots of local traffic but nice for getting out the city area.","date":"2025-08-09","rating":5}],"destLat":63.4322,"destLon":10.738},{"id":177,"lat":63.296,"lon":9.852,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"Found people driving to Trondheim in minutes.","date":"2025-08-09","rating":5}],"destLat":63.4276,"destLon":10.3956},{"id":182,"lat":63.2893,"lon":9.0908,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"Not so much traffic, but then a guy from Kongo, who was going fishing, he had time and took me all the way to the road that was leading to Hitra.","date":"2025-08-09","rating":5}],"destLat":63.3211,"destLon":9.5276},{"id":183,"lat":63.2447,"lon":8.1339,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"An older lady and her neighbour took me, at first they would’ve taken me to Orkanger, but then she invited me to stay the night at her guest room and then continue tomorrow, so that’s what I did instead.","date":"2025-08-09","rating":5}],"destLat":63.2907,"destLon":9.066},{"id":184,"lat":63.1353,"lon":7.9064,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"A local guy took me to Sandvika ferjekai.","date":"2025-08-09","rating":5}],"destLat":63.2333,"destLon":8.1322},{"id":187,"lat":62.4823,"lon":6.8128,"rating":5,"reviews":1,"wait":7,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"Asked around and found a man that had been married to an Estonian, so he had time and took me all the way to Furneset ferjekai.","date":"2025-08-09","rating":5}],"destLat":62.6518,"destLon":7.085},{"id":189,"lat":62.2739,"lon":7.1758,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"Asked around on the ferry and got a ride to Moa, couchsurfed with them for the night and then they took me sightseeing the next day to Ålesund.","date":"2025-08-09","rating":5}],"destLat":62.4709,"destLon":6.1511},{"id":190,"lat":62.1032,"lon":7.2046,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"Lots of space for cars to stop. I hitchhiked onto the local bus who drove me to his last stop to Eisdal ferjekai.","date":"2025-08-09","rating":5}],"destLat":62.2628,"destLon":7.1722},{"id":196,"lat":68.5487,"lon":17.5587,"rating":5,"reviews":1,"wait":25,"signal":"ask-sign","lastUsed":"2025-08-07","comments":[{"text":"Waited at the petrol station to ask people and got a ride to the border by one of the many Norwegians who prefer Swedish prices (August 2025) - had a sign with 'Sverige'","date":"2025-08-07","rating":5}],"destLat":68.4268,"destLon":18.1227},{"id":199,"lat":62.0134,"lon":7.3983,"rating":5,"reviews":1,"wait":13,"signal":"thumb","lastUsed":"2025-08-07","comments":[{"text":"Plenty of space for cars to stop! Beautiful but of course chilly on the mountain.","date":"2025-08-07","rating":5}],"destLat":61.772,"destLon":9.5431},{"id":202,"lat":61.8275,"lon":8.9655,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-07","comments":[{"text":"Thuesday morning, decent traffic, lovely bus stop, ride in 5\" to Vågåmo.","date":"2025-08-07","rating":5}],"destLat":61.8715,"destLon":9.1439},{"id":205,"lat":61.9029,"lon":6.7173,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-06","comments":[{"text":"Got a ride with a Norwegian caravan.","date":"2025-08-06","rating":5}],"destLat":62.0134,"destLon":7.3981},{"id":206,"lat":61.9123,"lon":5.9803,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-06","comments":[{"text":"Asked around in the gas station.","date":"2025-08-06","rating":5}],"destLat":61.9029,"destLon":6.7173},{"id":207,"lat":61.9031,"lon":5.7181,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-06","comments":[{"text":"Asked around on the boat.","date":"2025-08-06","rating":5}],"destLat":61.9125,"destLon":5.9803},{"id":209,"lat":61.72,"lon":5.1984,"rating":5,"reviews":1,"wait":1,"signal":"thumb","lastUsed":"2025-08-06","comments":[{"text":"A Polish guy with a fancy ass blue BMW took me a bit further haha.","date":"2025-08-06","rating":5}],"destLat":61.7619,"destLon":5.2668},{"id":211,"lat":61.6029,"lon":5.072,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-08-06","comments":[{"text":"A bus stop.","date":"2025-08-06","rating":5}],"destLat":61.6138,"destLon":5.3299},{"id":221,"lat":61.5076,"lon":5.7181,"rating":5,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-08-04","comments":[{"text":"Not a lot of traffic, mostly local, but got a ride to Florø with the first car who drove in the gas station. And the driver who took me, his friend was willing to host me for the night! Yay!","date":"2025-08-04","rating":5}],"destLat":61.5994,"destLon":5.0269},{"id":222,"lat":61.4497,"lon":5.8612,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-04","comments":[{"text":"Local traffic mostly, but was good enough for me to get further.","date":"2025-08-04","rating":5}],"destLat":61.5077,"destLon":5.718},{"id":227,"lat":69.1066,"lon":15.9642,"rating":5,"reviews":1,"wait":3,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"Much space to stop","date":"2025-08-04","rating":5}],"destLat":69.3039,"destLon":16.0727},{"id":230,"lat":60.4511,"lon":6.8071,"rating":5,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"A good spot overall, has space to stop and has a little cover from the rain under the cherry stall. I got a ride with a professional driver from Lapland all the way to Bergen. He even offered me a job as a driver, as they have one car without a driver at the moment haha.","date":"2025-08-04","rating":5}],"destLat":60.3717,"destLon":5.3483},{"id":231,"lat":60.3745,"lon":6.7152,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"A good spot, plenty of space to stop and a gas station to ask around.","date":"2025-08-04","rating":5}],"destLat":60.4511,"destLon":6.8071},{"id":233,"lat":59.4205,"lon":5.4459,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-04","comments":[{"text":"Got a lift with an older man going towards Hella.","date":"2025-08-04","rating":5}],"destLat":60.1164,"destLon":6.5598},{"id":236,"lat":58.2958,"lon":6.6699,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-08-02","comments":[{"text":"Found a guy driving to Moi to get a bit further.","date":"2025-08-02","rating":5}],"destLat":58.4608,"destLon":6.539},{"id":242,"lat":63.4236,"lon":10.7285,"rating":5,"reviews":1,"wait":15,"signal":"ask","lastUsed":"2025-08-01","comments":[{"text":"Easy place to ask drivers in August 2025","date":"2025-08-01","rating":5}],"destLat":63.7702,"destLon":11.4663},{"id":244,"lat":59.978,"lon":11.0563,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-07-31","comments":[{"text":"Got a ride but a short one to the motorway.","date":"2025-07-31","rating":5}],"destLat":60.0798,"destLon":11.1489},{"id":247,"lat":62.7441,"lon":7.2446,"rating":5,"reviews":1,"wait":17,"signal":"thumb","lastUsed":"2025-07-30","comments":[{"text":"Nice grandmother from norway stopped","date":"2025-07-30","rating":5}],"destLat":62.6848,"destLon":7.4639},{"id":248,"lat":63.3231,"lon":10.3019,"rating":5,"reviews":1,"wait":3,"signal":"thumb","lastUsed":"2025-07-30","comments":[{"text":"Perfect place and 1% of the people are very nice and helpful.","date":"2025-07-30","rating":5}],"destLat":63.2118,"destLon":9.0188},{"id":256,"lat":62.147,"lon":9.3382,"rating":5,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2025-07-28","comments":[{"text":"quite good spot, you can ask people in the parking as well as thumb near main road","date":"2025-07-28","rating":5}],"destLat":63.4259,"destLon":10.4123},{"id":260,"lat":59.2888,"lon":9.2544,"rating":5,"reviews":1,"wait":35,"signal":null,"lastUsed":"2025-07-28","comments":[{"text":"i think its the only reasonable spot to hitchhike from ulefoss","date":"2025-07-28","rating":5}],"destLat":59.4131,"destLon":9.0692},{"id":266,"lat":60.2659,"lon":8.947,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-07-27","comments":[{"text":"Supermarket parking. Good place to thumb bars going south or going in or out the parking lot. Possible to ask around too.","date":"2025-07-27","rating":5}],"destLat":59.771,"destLon":10.2618},{"id":285,"lat":69.3053,"lon":16.0772,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-07-22","comments":[{"text":"Bus stop with shoulder, shelter, good visibility, slow cars.","date":"2025-07-22","rating":5}],"destLat":69.1068,"destLon":15.9644},{"id":287,"lat":60.5635,"lon":11.2561,"rating":5,"reviews":1,"wait":60,"signal":"sign","lastUsed":"2025-07-17","comments":[{"text":"We wanted to reach Lillehammer, 2 cars stopped each 30 minutes, and offered a ride to Hamar, but we wanted to go a bit further, so after 1,5h a woman offered a lift close to Lillehammer :) (couple)","date":"2025-07-17","rating":5}],"destLat":60.9284,"destLon":10.7027},{"id":289,"lat":59.8963,"lon":10.8048,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-07-17","comments":[{"text":"Bus stop with good place to stop. Easy to get rides to Oslo center or further south the E18 (we had a sign for Asker)","date":"2025-07-17","rating":5}],"destLat":59.807,"destLon":10.4864},{"id":291,"lat":59.1111,"lon":11.25,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-07-16","comments":[{"text":"Hi! I'm a Swedish journalist working on a piece about hitchhiking. Are you currently (or have recently) hitchhiked through western Sweden? Then I want to interview you! Send med an email on klara.larsson@bohuslaningen.se . Happy travels!","date":"2025-07-16","rating":5}],"destLat":57.7218,"destLon":11.9916},{"id":304,"lat":62.382,"lon":6.9872,"rating":5,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"A norwegian man helped me out on his way to fishing","date":"2025-07-01","rating":5}],"destLat":62.2843,"destLon":7.1877},{"id":319,"lat":60.366,"lon":6.1459,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-30","comments":[{"text":"Enough space for the car to pull over, and luckily a nice norwegian girl picked me up while she was on her way to work","date":"2025-06-30","rating":5}],"destLat":60.3007,"destLon":6.1719},{"id":325,"lat":69.9168,"lon":27.0394,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-06-01","comments":[{"text":"Not a lot of space to stop but the road has little traffic so it’s fine. There is only one highway for many kms so no need for a sign :)","date":"2025-06-01","rating":5}],"destLat":69.9571,"destLon":23.2203},{"id":331,"lat":61.891,"lon":8.253,"rating":5,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2025-05-18","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Geiranger.\r\nA good spot. A bus stop at a small road. I had to wait for some time (45 minutes) due to a very limited traffic. \r\nNot many cars pass there. But I got my ride for the next ovet 50 kms.","date":"2025-05-18","rating":5}],"destLat":62.0133,"destLon":7.3974},{"id":334,"lat":59.9982,"lon":11.0413,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-05-16","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Otta.\r\nA very good spot. I wasn't standing at the exit of petro station, but by the road joining the highway (close to the bridge). There was enough shoulder for cars to stop. If you moved passed the bridge, maybe the cars from the main highway could stop for you. I didn't do it, coz were I was standing it was illegal enough.\r\nCars go slowly and you'd be visible nicely.\r\nIn 15 minutes 3 cars stopped for me. The ","date":"2025-05-16","rating":5}],"destLat":60.6325,"destLon":11.3022},{"id":338,"lat":60.6379,"lon":5.4899,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-04-23","comments":[{"text":"I got picked up by a truck that was heading to Kristiansund. As the driver said some companies deliver regulary along the coast.","date":"2025-04-23","rating":5}],"destLat":62.652,"destLon":7.0857},{"id":341,"lat":63.1466,"lon":10.2668,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-04-23","comments":[{"text":"You can take the bus/train from Trondheim to get here to filter the local traffic.","date":"2025-04-23","rating":5}],"destLat":59.353,"destLon":10.8688},{"id":343,"lat":60.1806,"lon":11.0719,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-04-15","comments":[{"text":"This place seems good for going west.","date":"2025-04-15","rating":5}],"destLat":null,"destLon":null},{"id":347,"lat":78.2394,"lon":15.5355,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"Hitchhiked back to town after walking to the seedvault","date":"2025-03-24","rating":5}],"destLat":null,"destLon":null},{"id":348,"lat":78.2289,"lon":15.5912,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"Amazing spot because you’re right at the end of the polar bear safe zone so people feel like they have to help you. Hitchhiked twice from here, once to get to the seedvault and second going to the airport. The only problem is walking until this spot","date":"2025-03-24","rating":5}],"destLat":null,"destLon":null},{"id":367,"lat":61.4295,"lon":5.9517,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Found a car quickly, bus stop allows cars to stop easily","date":"2025-03-15","rating":5}],"destLat":null,"destLon":null},{"id":368,"lat":61.0547,"lon":5.5043,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Talked to cars while on the ferry. Downside is sometimes there’s not many cars so options car run out quite quickly","date":"2025-03-15","rating":5}],"destLat":null,"destLon":null},{"id":372,"lat":59.9682,"lon":5.3346,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Asked the cars before they’d board the ferry. Got a car pretty quickly but wasn’t as lucky as on another ferry on this road","date":"2025-03-15","rating":5}],"destLat":null,"destLon":null},{"id":386,"lat":60.3908,"lon":11.2149,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-02-19","comments":[{"text":"Got a ride to Gjøvik almost immediately","date":"2025-02-19","rating":5}],"destLat":60.7954,"destLon":10.6977},{"id":392,"lat":61.7336,"lon":6.5057,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-01-18","comments":[{"text":"Got picked up by the first car, but I’ve been told there’s a lot of them going on that road, good spot to go to Stryne","date":"2025-01-18","rating":5}],"destLat":62.4616,"destLon":6.3577},{"id":394,"lat":60.1327,"lon":6.6263,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-01-11","comments":[{"text":"wandering along road. very quickly got a lift to odda with kind english speaking tourists.","date":"2025-01-11","rating":5}],"destLat":60.0671,"destLon":6.5492},{"id":400,"lat":59.754,"lon":5.4057,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-11-14","comments":[{"text":"Got picked up within 5 mins after being dropped off. Didn‘t even have time to finish my sandwich. Right before a tunnel. Traffic comes on quite fast but they can see you well in advance. Spot is right after the City/Industry-Area of Heiane on the way south, so a bit less traffic but i’m guessing more likely ppl going longer distances.","date":"2024-11-14","rating":5}],"destLat":58.968,"destLon":5.7292},{"id":402,"lat":78.2468,"lon":15.4948,"rating":5,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2024-11-05","comments":[{"text":"Svalbard, Spitsbergen is easy. Save money and hitch from the airport. Hitch to the suburb and to Adventdalen. Ask how to avoid low risk of polar bear attack! Car rental is possible on 80km of road!","date":"2024-11-05","rating":5}],"destLat":78.199,"destLon":15.7983},{"id":414,"lat":59.1843,"lon":10.246,"rating":5,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2024-09-29","comments":[{"text":"While walking towards highway we caught a ride to Bø. 10/10","date":"2024-09-29","rating":5}],"destLat":59.4143,"destLon":9.062},{"id":415,"lat":67.257,"lon":15.3717,"rating":5,"reviews":1,"wait":25,"signal":"thumb","lastUsed":"2024-09-08","comments":[{"text":"big busstop outside the church with good visibility. ride to bodo in 25 mins in the evening!","date":"2024-09-08","rating":5}],"destLat":67.2886,"destLon":14.3928},{"id":419,"lat":60.0593,"lon":6.5477,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-09-03","comments":[{"text":"Good visibility bus stop, place to stop for heading South","date":"2024-09-03","rating":5}],"destLat":58.3828,"destLon":7.741},{"id":421,"lat":68.0171,"lon":13.176,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-09-01","comments":[{"text":"Very good spot, but not many cars (in the end of summer season)","date":"2024-09-01","rating":5}],"destLat":67.8934,"destLon":13.0466},{"id":422,"lat":59.8226,"lon":7.1989,"rating":5,"reviews":1,"wait":6,"signal":"thumb","lastUsed":"2024-08-31","comments":[{"text":"Great spot, I got a ride in just a few minutes (polish truck driver), took me to Oslo","date":"2024-08-31","rating":5}],"destLat":59.8379,"destLon":10.4933},{"id":423,"lat":68.6307,"lon":16.5629,"rating":5,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2024-08-31","comments":[{"text":"Great spot to Lofoten. There is much more space than right after the roundabout.","date":"2024-08-31","rating":5}],"destLat":68.2052,"destLon":14.572},{"id":427,"lat":60.1316,"lon":6.3045,"rating":5,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2024-08-29","comments":[{"text":"Walking along road thumbing as I went, picked up in half an hour, lots of tourists. Due to tunnels ahead maybe stop hiking when you find a nice spot, you can’t walk through the tunnels and as there are no settlements ahead walking brings no benefit.","date":"2024-08-29","rating":5}],"destLat":60.373,"destLon":6.1415},{"id":428,"lat":60.0714,"lon":6.552,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-29","comments":[{"text":"Wandering along street with thumb, 2nd car stopped and took me to trolltunga village!!","date":"2024-08-29","rating":5}],"destLat":60.1184,"destLon":6.5686},{"id":429,"lat":60.1212,"lon":6.5694,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-08-29","comments":[{"text":"Walking along the road to trolltunga with thumb. First car stopped! Lift to the car park! After hike thumbed my way back down, despite little space to stop etc.","date":"2024-08-29","rating":5}],"destLat":60.1286,"destLon":6.6516},{"id":431,"lat":59.2365,"lon":10.9013,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-08-28","comments":[{"text":"Big bus stop plenty of space and traffic, not many busses. Ride nearly to Oslo 10 mins woo hoo!","date":"2024-08-28","rating":5}],"destLat":59.6636,"destLon":10.747},{"id":434,"lat":60.8846,"lon":11.526,"rating":5,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2024-08-27","comments":[{"text":"Traffic going to Hamar, Rena, Oslo. IN case you got stuck on night or rainy weather, wait in McDonalds, which is 24/7 open. The staff there is nice, be nice to them too :) I spent a rainy cold night there till 6am and got a ride to Oslo in 45 minutes. Before it cars to Hamar and Rena stopped.","date":"2024-08-27","rating":5}],"destLat":59.9907,"destLon":11.0303},{"id":437,"lat":68.4821,"lon":16.8902,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-26","comments":[{"text":"2nd card stopped and took me north for over an hour, the driver spoke minimal english but it was enough!","date":"2024-08-26","rating":5}],"destLat":69.052,"destLon":18.4677},{"id":439,"lat":71.1073,"lon":25.7143,"rating":5,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2024-08-26","comments":[{"text":"I was able to thumb pretty much anywhere on the nordkapp road. Even with nowhere to stop. Got picked up in 2 mins and taken south for a couple of hours! Note the hiker cabin on the other side of the lake on the OSM maps was very firmly locked as of August 2024.","date":"2024-08-26","rating":5}],"destLat":70.4702,"destLon":25.0669},{"id":440,"lat":70.4729,"lon":25.0725,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-08-26","comments":[{"text":"At the entrance to the sideroad there is a small but doable place to pull over going south to lakslev. Good visibility, slow traffic, but not much of it. Expectations where low because of how little traffic and the bad experiances pinned further down, but aftera few smug Norwegian rejections a kind tourist stopped and I got to lakslev!","date":"2024-08-26","rating":5}],"destLat":70.0508,"destLon":24.9456},{"id":442,"lat":61.779,"lon":9.4749,"rating":5,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2024-08-14","comments":[{"text":"Not a perfect spot, but I got picked up by the sweetest swedish woman ever, got a ride to Dønfoss.","date":"2024-08-14","rating":5}],"destLat":null,"destLon":null},{"id":443,"lat":62.4065,"lon":6.9527,"rating":5,"reviews":1,"wait":8,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"Loads of parking placed and buttons along this road, in one I got a ride north to the junction fast with some kind tourists. English speaking.","date":"2024-08-10","rating":5}],"destLat":62.4822,"destLon":6.8247},{"id":444,"lat":62.3083,"lon":7.0066,"rating":5,"reviews":1,"wait":1,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"Sprinted off the ferry before the cars, thumb out in the space to the right. After a few rejections a G stopped and I'm on my way north!","date":"2024-08-10","rating":5}],"destLat":62.3823,"destLon":7.0005},{"id":446,"lat":62.9752,"lon":7.7882,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"Quick weight at the entrance for the rest area. It is so wide plenty of space to stop. Some traffic, 25min weight to get ride to next ferry. Toilets nearby, traffic slowed. Visibility good","date":"2024-08-10","rating":5}],"destLat":63.0517,"destLon":8.1248},{"id":448,"lat":63.1252,"lon":8.3598,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"No real place to stop but limited traffic in the evening so it didn't matter. Ride to orkanger, driver spoke english","date":"2024-08-10","rating":5}],"destLat":63.3029,"destLon":9.8589},{"id":451,"lat":69.2137,"lon":18.4698,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-08-07","comments":[{"text":"Enough traffic, going on 855","date":"2024-08-07","rating":5}],"destLat":69.2136,"destLon":18.4695},{"id":452,"lat":69.1337,"lon":18.5772,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-07","comments":[{"text":"Nice spot, going north","date":"2024-08-07","rating":5}],"destLat":69.1337,"destLon":18.5772},{"id":453,"lat":68.5451,"lon":17.5642,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-07","comments":[{"text":"Easy stopping spot","date":"2024-08-07","rating":5}],"destLat":68.5451,"destLon":17.5642},{"id":454,"lat":68.8184,"lon":18.1849,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-07","comments":[{"text":"Easy parking space","date":"2024-08-07","rating":5}],"destLat":68.8184,"destLon":18.1849},{"id":455,"lat":69.0547,"lon":18.4896,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-08-07","comments":[{"text":"Good spot for cars to see you and to park. Going south on 86","date":"2024-08-07","rating":5}],"destLat":69.0547,"destLon":18.4896},{"id":456,"lat":69.2312,"lon":18,"rating":5,"reviews":1,"wait":40,"signal":null,"lastUsed":"2024-08-07","comments":[{"text":"Good spot for cars to stop. Going south on 86","date":"2024-08-07","rating":5}],"destLat":69.2312,"destLon":18},{"id":457,"lat":60.8438,"lon":6.7235,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2024-08-07","comments":[{"text":"If you want to do the bakkanosi hike you can take the bus to here and ask people at the rest area if they want to take you to the start (only 10 min drive), first people we asked took us","date":"2024-08-07","rating":5}],"destLat":60.8846,"destLon":6.7219},{"id":459,"lat":59.8493,"lon":10.8359,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-08-01","comments":[{"text":"At the bus stop on the highway, but the cars are allowed to stop there. After spending around 4,5 hours on the ramp and the gas station nearby (fuck!) I easily got a 20 km ride to Ås.\r\nThe traffic at the highway is intensive, and the chance to be picked up is also high :)","date":"2024-08-01","rating":5}],"destLat":59.6651,"destLon":10.7967},{"id":460,"lat":59.8344,"lon":10.843,"rating":5,"reviews":1,"wait":1,"signal":"thumb","lastUsed":"2024-08-01","comments":[{"text":"At the bus stop, much space to pull over, the car was going to Enebak, I had to go only 9 km to Siggerud area.","date":"2024-08-01","rating":5}],"destLat":59.7909,"destLon":10.9516},{"id":461,"lat":59.3255,"lon":10.955,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-08-01","comments":[{"text":"At the bus stop, much space to pull over, the car was going to Drammen. Much traffic to Oslo.","date":"2024-08-01","rating":5}],"destLat":59.3857,"destLon":10.7528},{"id":464,"lat":66.3068,"lon":14.1466,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-07-23","comments":[{"text":"no need to go all the way to the end of town, this place was completely fine to go south. good visibility and lots of place to stop","date":"2024-07-23","rating":5}],"destLat":63.831,"destLon":11.6071},{"id":465,"lat":59.7791,"lon":10.4864,"rating":5,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2024-07-16","comments":[{"text":"As soon as I got to the bus stop and raised my thumb the first car stopped","date":"2024-07-16","rating":5}],"destLat":59.8783,"destLon":10.5466},{"id":467,"lat":69.3555,"lon":17.4452,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-06-28","comments":[{"text":"The main hiking path crosses the country road, however no establishments.Curvy road, drivers don't go fast. Enough space to pull over after the bridge.","date":"2024-06-28","rating":5}],"destLat":69.245,"destLon":17.9474},{"id":473,"lat":70.4779,"lon":25.0675,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-06-27","comments":[{"text":"Great spot for Nordkapp. Good cafe on the opposite side too. Also, great camping spot near the small river just a bit south of here.","date":"2024-06-27","rating":5}],"destLat":71.168,"destLon":25.7816},{"id":478,"lat":69.367,"lon":20.268,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2024-05-29","comments":[{"text":"good spot, also a gas station, if cars don´t stop on their own:D","date":"2024-05-29","rating":5}],"destLat":69.2201,"destLon":19.5505},{"id":480,"lat":60.8488,"lon":11.3718,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2024-05-29","comments":[{"text":"Perfect spot, close to gas station, a perfect place for camping, bus stop - much space to pull over. May cars go to Elverum and Trysil, maybe to Trondheim road.","date":"2024-05-29","rating":5}],"destLat":60.867,"destLon":11.4498},{"id":482,"lat":62.2889,"lon":10.7385,"rating":5,"reviews":1,"wait":3,"signal":"sign","lastUsed":"2024-05-18","comments":[{"text":"A good spot, not much space to pull out, but not a problem.","date":"2024-05-18","rating":5}],"destLat":63.3504,"destLon":10.3577},{"id":484,"lat":62.5954,"lon":9.7,"rating":5,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2024-05-14","comments":[{"text":"Late evening, convenient place, after 60 mins got a 122km ride to Trondheim. The car was going to Namsos.","date":"2024-05-14","rating":5}],"destLat":63.4353,"destLon":10.4572},{"id":487,"lat":59.689,"lon":10.811,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-03-11","comments":[{"text":"Good spot to get into Oslo. Cars drive slow after the roundabout. There is a new four lane highway being planned here, that might remove this little gem in some years time.","date":"2024-03-11","rating":5}],"destLat":59.8662,"destLon":10.7309},{"id":489,"lat":59.6506,"lon":9.653,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-03-05","comments":[{"text":"Great spot for stop a car. There is enough space for stop because there is a bus stop. People can see you from far distance.","date":"2024-03-05","rating":5}],"destLat":59.577,"destLon":9.1868},{"id":492,"lat":68.4353,"lon":18.1064,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-03-02","comments":[{"text":"Direction Narvik: Parking at the side of the road just after the border. Got quick rides here jn summer and winter","date":"2024-03-02","rating":5}],"destLat":69.1334,"destLon":18.5794},{"id":495,"lat":59.9759,"lon":10.9278,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2023-11-30","comments":[{"text":"Absolutelly ideal spot, traffic lights, bus stop, end of the city. 15 min walk from the metrostation Vestli. Got a lift within 1 minute to Gran. Good alternative to E6.","date":"2023-11-30","rating":5}],"destLat":60.2533,"destLon":10.6607},{"id":498,"lat":60.1864,"lon":12.0122,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-11-06","comments":[{"text":"Excellent spot for rides north","date":"2023-11-06","rating":5}],"destLat":60.4499,"destLon":12.051},{"id":499,"lat":60.0801,"lon":11.1546,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-11-06","comments":[{"text":"Easy as pie to get a ride to Kongsvinger. Stand inside the roundabout.","date":"2023-11-06","rating":5}],"destLat":60.1873,"destLon":12.0218},{"id":502,"lat":69.3735,"lon":20.2867,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2023-10-06","comments":[{"text":"Great view! \r\nDrivers from both roads see you well in advance. There's a parking bay.","date":"2023-10-06","rating":5}],"destLat":69.7769,"destLon":21.0357},{"id":515,"lat":64.504,"lon":11.9918,"rating":5,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-08-16","comments":[{"text":"Good spot to continue north on the road. We wanted to go to Brønnøysund, and old man took us to Høylandet but he was going near Brønnøysund, we didn't manage to understand well each other. Carefull, a lot of old local people that don't speak English very well...","date":"2023-08-16","rating":5}],"destLat":64.6282,"destLon":12.3},{"id":533,"lat":60.1847,"lon":11.093,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"Tried for 12min on a saturday evening, 1930 in August. For direction south the waiting time is probably 2min. I was trying to go north. The frequency was 24 cars in 10minutes. I thought this spot would make more sense, since more parking lots feed into it than the one slightly more north on Tårnvegen at the onramp. I was there too and the frequency was noticeably less. \r\nIt would be interesting if someone tried to get a ride north from here. A friend says from Espa (50km further north) you get r","date":"2023-08-07","rating":5}],"destLat":60.0312,"destLon":11.068},{"id":534,"lat":60.5623,"lon":11.2558,"rating":5,"reviews":1,"wait":27,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"Lots of Norwegians stopped to buy buns here. They are usually going far. Should be possible to get a ride to Trondheim or Oslo. \r\nIf you go to Trondheim, try to get a ride at least past Elverum, since there are no good spots before. \r\nThere is much less traffic in winter. \r\nI waited 1min in July 2021, 27min in july 2023, 102 minutes in December 2022. \r\nAll times I got a ride to Trondheim. That also happened two times before, not sure about the waiting time.","date":"2023-08-07","rating":5}],"destLat":63.421,"destLon":10.3958},{"id":539,"lat":65.1516,"lon":13.3556,"rating":5,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"The only viable spot getting out of Majavatn if youre going south. There is a very beautiful beach to camp near the lake and the water is crystal clear, perfect if theres good weather.","date":"2023-08-07","rating":5}],"destLat":64.0694,"destLon":11.5027},{"id":540,"lat":66.0819,"lon":13.8275,"rating":5,"reviews":1,"wait":45,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"Southbound. Huge space to pull over, there is also gas station on the other side of the road to get some water, very friendly staff.","date":"2023-08-07","rating":5}],"destLat":65.837,"destLon":13.2097},{"id":541,"lat":66.3044,"lon":14.1253,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"This is the spot to get out of Mo I Rana towards the south. Good visibility and space for a car to stop near the road. Got a lift after 30 minutes to Korgen.","date":"2023-08-07","rating":5}],"destLat":66.0818,"destLon":13.8269},{"id":543,"lat":68.2133,"lon":14.2181,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-08-06","comments":[{"text":"There is no place for cars to stop on the intersection (to Henningsvaer, south east from here) so i decided to walk to this place. Plenty of space to stop, cars see you from far away. After 30 minutes of waiting got a ride to Lenkes from a nice Norwegian guy.","date":"2023-08-06","rating":5}],"destLat":68.1446,"destLon":13.6157},{"id":545,"lat":70.4751,"lon":25.0696,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-08-06","comments":[{"text":"Not sure if such a good spot, not that many cars. The first camper i asked took me all the way to Alta from here.","date":"2023-08-06","rating":5}],"destLat":69.9656,"destLon":23.2608},{"id":556,"lat":62.9125,"lon":7.441,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-07-24","comments":[{"text":"Good spot to stand, good flow of cars going relatively slow, got a ride to Kårvåg.","date":"2023-07-24","rating":5}],"destLat":62.9125,"destLon":7.441},{"id":557,"lat":62.8383,"lon":7.2371,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-07-24","comments":[{"text":"Good place to stand, after a roundabout, cars going slow, good flow. Got a ride to Eide. Bunnpris close by, public toilet.","date":"2023-07-24","rating":5}],"destLat":62.8383,"destLon":7.2371},{"id":563,"lat":63.4666,"lon":10.9114,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-19","comments":[{"text":"A spot is right after the roundabout, enough space for a regular car, the local traffic goes to Trondheim. This is a riksveg (not a real highway), so it's not a problem to hitchhike at this spot.","date":"2023-07-19","rating":5}],"destLat":63.4666,"destLon":10.9114},{"id":571,"lat":59.6494,"lon":9.6404,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"At the entrance to the tunnel there is a pull over. I got a ride within minutes to notodden.","date":"2023-07-15","rating":5}],"destLat":59.6494,"destLon":9.6404},{"id":577,"lat":63.4511,"lon":10.9152,"rating":5,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-07-11","comments":[{"text":"The place looks good, plenty of room to stop just after the roundabout, but everyone just goes to the next town, where I ended up getting stuck. Maybe it's better to take the train straight to Asen","date":"2023-07-11","rating":5}],"destLat":63.4641,"destLon":10.9204},{"id":583,"lat":66.3048,"lon":14.1355,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-07-10","comments":[{"text":"a convenient spot, got a short ride out of the town.","date":"2023-07-10","rating":5}],"destLat":66.3048,"destLon":14.1355},{"id":584,"lat":63.5129,"lon":10.859,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2023-07-10","comments":[{"text":"Was waiting for 25 min, then got a short ride and then a car going 470km to Mo i Rana. The local traffic is actually filtered out, and there is enough space to stop, and you are very visible.","date":"2023-07-10","rating":5}],"destLat":63.5131,"destLon":10.8593},{"id":588,"lat":61.772,"lon":9.5429,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-05","comments":[{"text":"Relativly big gas station. I found a camping-car to Trondheim in 5 minutes !","date":"2023-07-05","rating":5}],"destLat":61.772,"destLon":9.543},{"id":589,"lat":63.0532,"lon":8.1253,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"I asked for a lift on the ferry, a guy agreed and took me to Trondheim.","date":"2023-07-01","rating":5}],"destLat":63.4245,"destLon":10.3938},{"id":596,"lat":59.754,"lon":10.2625,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-06-29","comments":[{"text":"Going to drøbak, lot of people leaving and passing by the gaz station","date":"2023-06-29","rating":5}],"destLat":59.7541,"destLon":10.2625},{"id":599,"lat":68.4176,"lon":15.9933,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-06-14","comments":[{"text":"Got offered a ride by a sweet guy that saw I was a traveller","date":"2023-06-14","rating":5}],"destLat":68.4107,"destLon":15.9977},{"id":603,"lat":59.879,"lon":8.557,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-05-30","comments":[{"text":"Cars slow down to go up the hill.\r\nFirst car that passed me offered a 20km ride, which I declined.\r\nSecond car offered a ride to Krossen, which I accepted.\r\nGreat spot, waiting time under 5 minutes.\r\nThe Norwegians are a friendly people","date":"2023-05-30","rating":5}],"destLat":59.874,"destLon":8.5807},{"id":606,"lat":59.6576,"lon":5.9269,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-02-16","comments":[{"text":"Got a ride all the way to Stavanger.","date":"2023-02-16","rating":5}],"destLat":58.9493,"destLon":5.7294},{"id":607,"lat":69.6406,"lon":18.4138,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-01-08","comments":[{"text":"This is a nice spot to collect both road's traffic towards Tromso. Also, if it is dark and you hear the howling of wolves, relax, it is just a husky farm near by! :]","date":"2023-01-08","rating":5}],"destLat":69.6406,"destLon":18.4139},{"id":611,"lat":61.174,"lon":6.6347,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2022-12-02","comments":[{"text":"Decent for traffic from the ferry","date":"2022-12-02","rating":5}],"destLat":61.0836,"destLon":6.5805},{"id":218,"lat":63.1515,"lon":10.28,"rating":4.8,"reviews":5,"wait":22,"signal":"thumb","lastUsed":"2025-08-05","comments":[{"text":"Good place to stop, bus stop, all traffic going past. Nice little rest are in the train station if you need bathroom, the gas station in front was closed though.","date":"2025-08-05","rating":4},{"text":"My favourite spot! 10 minutes wait on Saturday afternoon and a long ride to Elverum.","date":"2024-08-27","rating":5},{"text":"This time 6 minutes wait and a direct car to Sandefjord, got off in Oslo.","date":"2024-08-19","rating":5},{"text":"I followed denwers enthusistic advice and took the bus all the way here which was quite convenient and not that expensive. id you are late theres also lots of space to sleep in the area. anyways, no proplem of getting a ride far south from here, easy and comfortable","date":"2024-07-28","rating":5},{"text":"2nd day of Easter (April 2024), a 70 minutes wait and a 422km ride to Kløfta (close to Oslo).\r\nTo get there take a local train to Lundamo stasjon, this is the last station to which you use a single ticket (46 NOK) valid in transportation zone A. At that point you are well visible and right by the E6 motorway, cars go 50 km/h and there is a large shoulder for drivers to pull over. I used a sign and my thumb.\r\nThis spot is perfect because all the town and very local Trondheim-traffic is already fi","date":"2024-04-01","rating":5}],"destLat":62.2235,"destLon":9.5496},{"id":152,"lat":60.634,"lon":11.3006,"rating":4.75,"reviews":4,"wait":18,"signal":"sign","lastUsed":"2025-08-17","comments":[{"text":"Great spot, there's plenty of space for cars to stop and fairly enough cars coming from the nearby big gas station.","date":"2025-08-17","rating":5},{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Otta.\r\nSpots looks great. A bus stop with loads of place for cars. Cars going slowly. But there isn't much traffic. I waited 30 minutes. I got superb lucky. One driver stopped and asked me where I was going. But he wasn't going to Otta, so he left. But after a few minutes he came back and he said that he'd take half an hour longer route which goes through Otta.\r\nThere is a petrol station and some McDonald's near","date":"2025-05-16","rating":4},{"text":"A good spot if heading to Trondheim, BUT do not go closer than Elverum roundabout because there are not convenient spots before Elverum except Ånestadkrysset which is 8km before Elverum roundabout (turn to Trondheim road)","date":"2024-05-29","rating":5},{"text":"A perfect stop if you head up to Trondheim or Elverum, enough space to pull out, just after the roundabout - drivers clearly see you. There is a gaz station and a super market there.","date":"2024-05-18","rating":5}],"destLat":61.132,"destLon":10.432},{"id":52,"lat":69.3983,"lon":25.8405,"rating":4.67,"reviews":3,"wait":14,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Pretty good spot after the bridge. Might not be worth walking over from Karigasniemi though as the spots there seemed good too.","date":"2024-06-26","rating":4},{"text":"Lot of cars from Norway which were shopping in the Finland, but no one stops, saved us man from sweden during heavy rain.","date":"2023-07-29","rating":5}],"destLat":69.4722,"destLon":25.5126},{"id":76,"lat":61.0646,"lon":7.505,"rating":4.67,"reviews":3,"wait":6,"signal":"thumb","lastUsed":"2025-09-13","comments":[{"text":"Ok spot\r\nJust before the longest car tunnel of the world \r\nTaken by a Brasilian who gave me chocolaté spread ☺️","date":"2025-09-13","rating":4},{"text":"Pickup driver took me almost to Bergen","date":"2025-08-27","rating":5},{"text":"It's better here, a Romanian truck driver picked me up, (my first truck in Norway)","date":"2025-07-02","rating":5}],"destLat":60.8618,"destLon":7.1145},{"id":149,"lat":62.0736,"lon":9.1311,"rating":4.67,"reviews":3,"wait":18,"signal":"sign","lastUsed":"2025-08-18","comments":[{"text":"Very good spot. A lot of space for the cars to pull over, and they go fairly slow. I needed to get to a village on the E6 close to Oppdal (Driva) and got a ride pretty quickly (20 mins).","date":"2025-08-18","rating":5},{"text":"Good place for heading towards Trondheim! Cars go 50 km/h and there is good space to stop!","date":"2025-08-07","rating":4},{"text":"The perfect, safest and convenient spot in Dombås (heading north). There is no convenient place after the roundabout in Dombås center. Take a 10 minutes walk to this convenient spot (enoug space to stop for a car) where I got a ride to Trondheim after 15 mins.","date":"2024-04-01","rating":5}],"destLat":62.5272,"destLon":9.6103},{"id":168,"lat":69.2154,"lon":19.5517,"rating":4.67,"reviews":3,"wait":14,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"on the left turn lane, heading south. Decent amount of traffic","date":"2025-08-15","rating":5},{"text":"Heading south stopping the cars that on the onramp seemed to be the best option as there is no space to stop on the main road.","date":"2024-03-05","rating":4},{"text":"Direction south : \nI think this crossing or the petrol station ar the best places to try. Down the road, there is not much place for cars to stop.","date":"2014-09-17","rating":5}],"destLat":69.1331,"destLon":18.5799},{"id":321,"lat":65.8349,"lon":13.2201,"rating":4.67,"reviews":3,"wait":39,"signal":null,"lastUsed":"2025-06-13","comments":[{"text":"Easy for cars to stop there. Good if you stay at the campsite and want to go southbound.","date":"2025-06-13","rating":4},{"text":"Dir: South. Super spot. A lot of traffic and easy to pull over. Much better than the hellhole called Mo i Rana.","date":"2014-09-17","rating":5}],"destLat":63.4616,"destLon":10.9118},{"id":594,"lat":62.4708,"lon":6.1651,"rating":4.67,"reviews":3,"wait":7,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"Got a ride to the ferry, I could go to Oslo with this truck driver. Good spot, better with a sign","date":"2023-07-01","rating":4},{"text":"Direction: out of town\n\nThere's a bus stop here right on the main road from town. We heard it's pretty used by hitchhikers. It worked for us pretty well :-)","date":"2013-06-20","rating":5}],"destLat":62.6093,"destLon":7.0962},{"id":48,"lat":71.1679,"lon":25.7818,"rating":4.5,"reviews":10,"wait":41,"signal":"thumb","lastUsed":"2025-10-15","comments":[{"text":"Not a good spot if you want to go north, it's a dead end.","date":"2025-10-12","rating":5},{"text":"If you stay in the car until nordkapp, as of 2024 they WILL charge you 17 NOK  (€1.50) per person in the car, on top of the car fee. If you need to avoid that, ask to get out at the nordkapp 500m sign (i have pinned this on the map too), and then walk off the road a few hundred metres to nordkapp (the terrain is fine/flat and you can see some cute reindeer). I made a beeline off trail for just east of the children of the world sculpture) and nobody cared or charged me. The visitors centre is nic","date":"2024-08-26","rating":5},{"text":"Yeah you only have to pay 17NOK if you stay in the car until the parking lot. Also make sure you leave early enough as the winds might be too crazy for camping and in the evening there's less and less cars leaving.","date":"2024-06-27","rating":5},{"text":"Update 2023\r\nYou dont have to pay anything if youre just a passager here, so you dont need to get out of the car before Nordkapp. I did so and only later found out that i couldve gone with the French caravan all the way to Nordkapp. When you want to hitch out, cars go very slow, a lot of space to stop, good spot.","date":"2023-08-06","rating":5},{"text":"If you want to go to the North Cape, make sure you get out of the car just before the toll booth. You can just walk 200 metres to the complex and save 280 NOK (!)","date":"2017-08-22","rating":4}],"destLat":70.4321,"destLon":24.5051},{"id":40,"lat":69.6432,"lon":18.9778,"rating":4.5,"reviews":6,"wait":8,"signal":"thumb","lastUsed":"2025-10-15","comments":[{"text":"A nice spot","date":"2025-07-01","rating":5},{"text":"Easy to hitchin a ride!","date":"2023-07-14","rating":5},{"text":"Its possible to stand a few meters further from the spots where car can pull over, right next to the roundabout on the right side(direction traffic), In winter waited about an hour for a ride near Narvik.","date":"2013-01-15","rating":4},{"text":"waited two times here in 2011, first time i've only waited 5 minuts, second 20 minuts.","date":"2012-06-24","rating":4},{"text":"Direction South. Absolut no problems here. A lot of cars, only the weather might be a problem...","date":null,"rating":4}],"destLat":69.3758,"destLon":19.3605},{"id":60,"lat":60.888,"lon":11.5081,"rating":4.5,"reviews":4,"wait":24,"signal":"thumb","lastUsed":"2025-10-02","comments":[{"text":"Previous driver dropped me a couple kms north up the road so I had to walk back all the way while trying to score a ride, but almost as soon as I made it to the roundabout I got a lift! Cool Tajik truck driver (again) who gave me tons of food and drove until his tachometer ran out in Støren. This is the spot to go north!","date":"2025-10-02","rating":5},{"text":"I got stuck there on a cold and rainy night. A car going to Hamar stopped, but it was not on my way. After an hour came a police car, we had a nice chat and they recommended me to wait and get warm in McDonalds, which is 24/7 open. The police was worried about me staying next to a 80-90km/h lane, which is next to the roundabout. Technically this spot is good, but the combination of darkness (there are lights there) and a Norwegian rain was not perfect in their opinion. But McDonalds was a good c","date":"2024-08-27","rating":3},{"text":"Was going to Trondheim, got a ride to Rena. \r\nThis is a perfect spot, much traffic to Trondheim. Maybe you should wait a longer ride to Trondheim.","date":"2024-05-29","rating":5},{"text":"A perfect spot if you're heading up to Trondheim. Many cars going from Oslo to Trondheim prefer this road. The spot is good - enough space to pull out, right after roundabout, the drivers see you well.","date":"2024-05-18","rating":5}],"destLat":63.0283,"destLon":10.2662},{"id":384,"lat":60.9331,"lon":10.6532,"rating":4.5,"reviews":4,"wait":24,"signal":null,"lastUsed":"2025-02-19","comments":[{"text":"Lot of desapointment, people don't stop for you but for the resting area, impossible to find someone going farer than Lillehamer.","date":"2023-09-30","rating":3},{"text":"Perfect spot heading north, lots of time and visibility for drivers to see you and a huge rest area for them to pull into.","date":"2014-10-20","rating":5}],"destLat":61.1158,"destLon":10.447},{"id":36,"lat":69.2163,"lon":19.3005,"rating":4.5,"reviews":2,"wait":39,"signal":"sign","lastUsed":"2025-10-17","comments":[{"text":"Heading south, winter. Just hitchhiked directly on the main road. Cars can stop at the crossing.","date":"2024-03-05","rating":4}],"destLat":68.4375,"destLon":16.0059},{"id":42,"lat":69.2201,"lon":19.5444,"rating":4.5,"reviews":2,"wait":28,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Good spot plenty of space to pull in. Cars usually speed up around this poknt so maybe it would be better little back up the ride just after the turn in but it is smaller pull in. pretty easy spot to hitch from.","date":"2025-02-28","rating":4}],"destLat":69.5172,"destLon":19.2502},{"id":77,"lat":60.9846,"lon":9.2282,"rating":4.5,"reviews":2,"wait":40,"signal":"thumb","lastUsed":"2025-09-13","comments":[{"text":"Lot of space, but still in the city \r\nBest option though\r\nDifficult as always in Norway\r\n54 tunels and you're in Bergen!","date":"2025-09-13","rating":4},{"text":"Fantastic spot, cars go by slowly, have plenty of space to see you and stop. Got a ride to Tyinkrysset here","date":"2025-08-31","rating":5}],"destLat":61.2068,"destLon":8.226},{"id":117,"lat":60.703,"lon":8.9325,"rating":4.5,"reviews":2,"wait":40,"signal":"thumb","lastUsed":"2025-08-27","comments":[{"text":"A guy and a girl on a Wednesday afternoon without a sign, on our way to Bergen. A lot of cars passing by at relatively slow speed, and a large place for them to stop.\r\nA car stopped to drive us to Hemsedal after 20min.\r\nYou can also go to Bergen by the road 7, but a local guy told us that most people use the 52, so we decided to take our chances with this one.","date":"2025-08-27","rating":4},{"text":"Waited around an hour. Very good spot for going to Nærofjorden like Flåm etc. Don’t go to the burger king on the 7 since the people take this road. We waited at burger king for long time, here there is also good place for cars to stop and they are slowing down because of the curve. We used a sign","date":"2024-07-26","rating":5}],"destLat":60.8634,"destLon":8.5502},{"id":145,"lat":61.8396,"lon":8.5613,"rating":4.5,"reviews":2,"wait":15,"signal":"thumb","lastUsed":"2025-08-20","comments":[{"text":"Very good spot to catch a ride to Geiranger or Nordfjordeid lot of cars are going here","date":"2025-08-20","rating":5},{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Geiranger.\r\nA good spot. There isn't a bus stop there. Just an entrace to a car park of some shop. There is a speed bump just meters before, so everyone goes superb slowly there. I got a ride in 20 minutes to the next town about 20 kms up the road.","date":"2025-05-18","rating":4}],"destLat":61.9123,"destLon":5.9801},{"id":162,"lat":68.5287,"lon":15.7658,"rating":4.5,"reviews":2,"wait":6,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"People drive slow and can stop","date":"2025-08-15","rating":5},{"text":"Enough space for stopping and good visibility. (winter)","date":"2024-03-05","rating":4}],"destLat":68.2369,"destLon":14.5645},{"id":170,"lat":69.1337,"lon":18.5791,"rating":4.5,"reviews":2,"wait":13,"signal":"ask-sign","lastUsed":"2025-08-12","comments":[{"text":"Perfect spot for all directions. First person I asked took me for a 5 hour ride to Alta. Male/summer","date":"2025-08-12","rating":5},{"text":"Good spot to ask people for all directions (Narvik, Tromsø, Sønja).","date":"2024-03-02","rating":4}],"destLat":69.9618,"destLon":23.399},{"id":186,"lat":62.7115,"lon":7.1003,"rating":4.5,"reviews":2,"wait":5,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"A Polish guy took me outside the city.","date":"2025-08-09","rating":5},{"text":"It was already getting dark and I was quite lucky that I found someone on the ferry that wanted to drive to Trondheim. Sometimes it makes sense to look on the license plate to see where they are from.","date":"2025-04-23","rating":4}],"destLat":62.7594,"destLon":7.3613},{"id":223,"lat":60.7396,"lon":5.633,"rating":4.5,"reviews":2,"wait":20,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"A good spot, lots of space for cars to stop.","date":"2025-08-04","rating":5},{"text":"Good spot, lots of space for cars to decide to stop and they see you from far away. Only downside is that some cars turn right instead of continuing on the E39","date":"2025-03-15","rating":4}],"destLat":61.4497,"destLon":5.8612},{"id":268,"lat":59.6623,"lon":10.7444,"rating":4.5,"reviews":2,"wait":25,"signal":"sign","lastUsed":"2025-07-27","comments":[{"text":"Rather small space only to stop as there is no shoulder at the onramp but cars can stop at the roundabout. Got a lift from there twice in a decent time. There are better spots down the road so having a 10/20km sign might be a good idea.","date":"2025-07-27","rating":4},{"text":"Not much space to pull over, but pretty alright, got a short ride approx. 20 km. Much traffic going south.","date":"2024-08-01","rating":5}],"destLat":59.4452,"destLon":10.7026},{"id":295,"lat":59.1281,"lon":11.2723,"rating":4.5,"reviews":2,"wait":13,"signal":"sign","lastUsed":"2025-07-11","comments":[{"text":"Super quick pickup, going north. We even got a free ride on the car ferry to Helden. Two people with backpacks!","date":"2025-07-11","rating":5},{"text":"Good spot for going anywhere. You can ask on the petrol station. We were There around 6 pm,, so it was hard to catch. One man Just took us behind the border to Sweden. There is TIR park, so good spot for solo travellers, they dont take couples.","date":"2023-08-17","rating":4}],"destLat":59.2719,"destLon":10.409},{"id":327,"lat":60.8994,"lon":7.1703,"rating":4.5,"reviews":2,"wait":11,"signal":"thumb","lastUsed":"2025-05-28","comments":[{"text":"Local person driving to work in Flåm. Stand on the small local road (not the main road).","date":"2025-05-28","rating":5},{"text":"A local person told me that this is the best place to stand to get a ride (in either direction) because local people will stop here. Wait on the small local road next to the red house (not on the main road).","date":"2025-05-27","rating":4}],"destLat":60.8994,"destLon":7.1703},{"id":339,"lat":60.5503,"lon":5.3012,"rating":4.5,"reviews":2,"wait":20,"signal":null,"lastUsed":"2025-04-23","comments":[{"text":"A very good spot that you can reach by bus from Bergen when you want to go in the direction to Trondheim.","date":"2025-04-23","rating":5},{"text":"Lots of space for cars to stop, cars can see you standing from far away and aren’t going very fast as there is a roundabout not far away","date":"2025-03-15","rating":4}],"destLat":60.6379,"destLon":5.4899},{"id":353,"lat":68.1361,"lon":13.5613,"rating":4.5,"reviews":2,"wait":15,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"Met a good friend because I was hitchhiking out of boredom. Eventually couchsurfed a week at his place and we drove everywhere around. Long live hitchhiking!","date":"2025-03-24","rating":4},{"text":"Very good spot for going south to Lofoten. Plenty of traffic, good visibility. Got a ride from a nice Belgian girl going to Kvalvika beach from here. There is also cover from rain, incase the weather is bad.","date":"2023-08-06","rating":5}],"destLat":68.0746,"destLon":13.1368},{"id":420,"lat":67.2833,"lon":14.5552,"rating":4.5,"reviews":2,"wait":20,"signal":"thumb","lastUsed":"2024-09-02","comments":[{"text":"Probably would be better to take a ride all the way to Fauske than only few kilometers…","date":"2024-09-02","rating":5},{"text":"My favourite spot to get from Bodø towards Fauske. Cars are slow, good visibility and plenty of place to stop (bus stop). All traffic going to Fauske gets through here. About 1h walk from the port.","date":"2024-03-06","rating":4}],"destLat":67.2927,"destLon":14.7452},{"id":493,"lat":62.8323,"lon":10.0118,"rating":4.5,"reviews":2,"wait":45,"signal":null,"lastUsed":"2024-01-01","comments":[{"text":"The bus station is a great spot because drivers which wouldn't stop at the gas station can spot you. Got a ride straight to Trondheim after 30 minutes","date":"2024-01-01","rating":5},{"text":"Nice spot, we got a ride to Trondheim in more or less a hour a Sunday morning. The lake is a good spot to camp, you can have a little shelter with a place to make fire and some toilets, 30min walk on the western side of the lake.","date":"2023-08-14","rating":4}],"destLat":63.4356,"destLon":10.4177},{"id":513,"lat":60.6456,"lon":6.4355,"rating":4.5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2023-09-03","comments":[{"text":"Waited about ten minutes here, heading north out of Voss. Bus stop here for people to stop.","date":"2023-07-27","rating":4}],"destLat":60.789,"destLon":6.5098},{"id":49,"lat":71.0021,"lon":25.9665,"rating":4.4,"reviews":10,"wait":18,"signal":"thumb","lastUsed":"2025-10-15","comments":[{"text":"First tourist car with free space will take you","date":"2025-10-15","rating":5},{"text":"Just met and other french hitchacker here while i was starting to go back south\r\nI had to hitchhack twice here\r\nFirst time i waited less than 5 mins and get a free ticket to the building st north cape\r\nSecond time i waited 1 hour and was taken by a local who was going around\r\nAround nordkapp, i was taken only by polish people and locals from honningsvag, some people who work in Nordkapp","date":"2025-08-23","rating":3},{"text":"Great Spot for going south. The gravel bank about 40 meters down the Road is perfect for standing","date":"2024-08-21","rating":5},{"text":"Great spot for south at the junction. I just had low traffic since it was quite late so took a while to find a ride.","date":"2024-06-27","rating":4},{"text":"Summer/Dir North Cape\n\nGot a ride after just a few minutes, lots of tourists","date":"2016-08-15","rating":5}],"destLat":71.1682,"destLon":25.7817},{"id":430,"lat":59.731,"lon":10.2164,"rating":4.4,"reviews":5,"wait":70,"signal":"thumb","lastUsed":"2024-08-29","comments":[{"text":"2nd car which stopped was going straight to trolltunga. Big bus too, ok spend and visibility. There where people and buses at the bus stop, didn’t cause me problems but would have preferred without an audience.","date":"2024-08-29","rating":5},{"text":"the spot looks very ideal but I waited for so long. everyone stopped and told me it is dangerous to hitchhiking but not driving me. Someone just bought me train ticket at the end and drove me to the train station. Maybe I wrote Bergen on my sign whish is too far from there, so no one wanted to pick me up:(","date":"2024-08-26","rating":2},{"text":"Got a straight ride to Oslo within 3 minutes. Should also work for the other directions as it's a bus stop in front of the highway entrance.","date":"2024-07-30","rating":5},{"text":"A lot of trank and I find one of them to Bergen. Very good place !","date":"2015-06-11","rating":5},{"text":"Wonderful place to hitchhike any direction. It's a bus stop (but not frequent).","date":"2013-09-15","rating":5}],"destLat":60.0785,"destLon":6.5341},{"id":37,"lat":69.2131,"lon":19.5358,"rating":4.33,"reviews":3,"wait":63,"signal":"sign","lastUsed":"2025-10-17","comments":[{"text":"Dir: South. Second car stopped, no problem.","date":"2007-04-13","rating":5}],"destLat":69.2168,"destLon":19.3018},{"id":54,"lat":59.9228,"lon":10.4639,"rating":4.33,"reviews":3,"wait":8,"signal":"thumb","lastUsed":"2025-10-11","comments":[{"text":"Maybe not the best spot, but drivers certainly have a lot of visibility and space to stop, even if they’re probably Norwegian and driving a bit too fast to notice - bring a big sign.","date":"2025-09-12","rating":4},{"text":"Getting out of sandvika is pretty difficult nowadays thanks to the tunnels. Once you get to this spot, however, you can get a ride up North relatively easily. I got a ride up to Voss quite quickly once I got here","date":"2025-04-20","rating":4}],"destLat":60.9198,"destLon":9.4221},{"id":78,"lat":61.8498,"lon":9.0072,"rating":4.33,"reviews":3,"wait":null,"signal":null,"lastUsed":"2025-09-13","comments":[{"text":"The spot is very good\r\nAnd it was easier than expected to hitchhack on this road, even if the traffic is law beginning of September","date":"2025-09-13","rating":5},{"text":"Good spot to get a ride to Gjendesheim. Waited about 15 min.","date":"2015-08-17","rating":4}],"destLat":null,"destLon":null},{"id":86,"lat":59.1766,"lon":10.2059,"rating":4.33,"reviews":3,"wait":91,"signal":null,"lastUsed":"2025-09-08","comments":[{"text":"Waited long time because of it was 19.00 but the spot itself its quite good, there's not much space to stop but doesn't interrupts traffic.","date":"2025-09-08","rating":5},{"text":"Nice spot for going south (Kristiansand).\nThis is a new (you won't find it on Google Street) roundabout exit towards Larvik (E18). We were 3 guys (!) and it took us only ~20min to catch a car.\nI think it's better than the gas station if you're going south.\nYou can get to that spot going through the footbridge that you can find near the supermarket behind the gas station.","date":"2014-07-26","rating":4}],"destLat":59.1113,"destLon":10.1112},{"id":98,"lat":61.9036,"lon":6.0023,"rating":4.33,"reviews":3,"wait":27,"signal":"thumb","lastUsed":"2025-09-04","comments":[{"text":"A guy and a girl on a Wednesday morning without a sign. There is a lot of space to stop, even though cars are going a bit fast. We got picked up quite quickly to Sandane.","date":"2025-09-04","rating":5},{"text":"Good spot to wait on the way south to Sandane. Cars have plenty of space to stop and you are visible from a distance.","date":"2014-05-12","rating":4}],"destLat":61.7719,"destLon":6.2314},{"id":157,"lat":59.6244,"lon":10.7327,"rating":4.33,"reviews":3,"wait":18,"signal":"sign","lastUsed":"2025-08-15","comments":[{"text":"Much space to pull over, many cars going to south from Outlet. I was lucky and after 5 minutes I got a ride to Copenhagen","date":"2025-08-15","rating":5},{"text":"Big service area. Good.","date":"2016-08-08","rating":4}],"destLat":55.6487,"destLon":12.2875},{"id":203,"lat":59.6631,"lon":10.7461,"rating":4.33,"reviews":3,"wait":8,"signal":"sign","lastUsed":"2025-08-06","comments":[{"text":"Should be pretty decent spot for Oslo, not that great for beyond. Not that many cars stopping at the gas station, but decent flow in the bus stop. Got a ride fast, someone who was going to the airport, so left us on a gas station in the ring road.","date":"2025-08-06","rating":4},{"text":"You should go a bit further by the bus stop, it's really a PERFECT spot for Oslo. I got a ride in 10\" in a sunday evening.","date":"2025-08-04","rating":5}],"destLat":59.9108,"destLon":10.82},{"id":261,"lat":59.4082,"lon":10.4835,"rating":4.33,"reviews":3,"wait":18,"signal":"thumb","lastUsed":"2025-07-28","comments":[{"text":"good spot, you can catch cars from the ferry and some from local traffic as well","date":"2025-07-28","rating":5},{"text":"reasonable spot easily reachable on foot from where the ferry from Moss leaves you. Some car speed up, but they generally slow down at the roundabout, they can definitely see you, and there is some place to stop.","date":"2012-09-05","rating":4}],"destLat":null,"destLon":null},{"id":288,"lat":59.8952,"lon":10.8058,"rating":4.33,"reviews":3,"wait":30,"signal":"sign","lastUsed":"2025-07-17","comments":[{"text":"Heading north, caught a ride pretty quickly :) (couple)","date":"2025-07-17","rating":5},{"text":"There is a bus stop on the on ramp going north on the E6. Long bit of road for cars to pull over.","date":"2014-10-20","rating":4}],"destLat":null,"destLon":null},{"id":356,"lat":67.2883,"lon":14.3937,"rating":4.33,"reviews":3,"wait":4,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"When you don’t have a car and going to the Lofoten, the boat is free. When almost arriving to Moskenes ask people on the ferry to hitchhike. I needed to go to Leknes and found someone who drove through","date":"2025-03-24","rating":5},{"text":"We were lucky, the first car stopped and took us to the centre.","date":"2014-08-02","rating":4},{"text":"Road in front of the ferry terminal.","date":"2014-08-02","rating":4}],"destLat":null,"destLon":null},{"id":364,"lat":63.4683,"lon":10.943,"rating":4.33,"reviews":3,"wait":5,"signal":null,"lastUsed":"2025-03-20","comments":[{"text":"Quick ride to Storlien","date":"2025-03-20","rating":5},{"text":"i once dropped a polish couple at this spot and they wrote me later, that it din`t take long to get a lift from here","date":"2011-12-06","rating":4},{"text":"This seemed the best spot to get out of Stordal. There is a round with enough space for cars to pull over.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":374,"lat":59.1392,"lon":5.592,"rating":4.33,"reviews":3,"wait":5,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Since end 2024 these ferries are free for people without car. I looked for a car before boarding the ferry and found one on the first try","date":"2025-03-15","rating":5},{"text":"Asked for a ride once on the ferry and found one very quick.","date":"2024-11-14","rating":4},{"text":"I asked cars that were queuing for the ferry and got a ride to Skjold","date":"2013-12-18","rating":4}],"destLat":null,"destLon":null},{"id":399,"lat":60.4251,"lon":5.6248,"rating":4.33,"reviews":3,"wait":20,"signal":null,"lastUsed":"2024-11-14","comments":[{"text":"Good spot. Got a ride all the way to voss pretty quick. Before i got a ride to Voss, two more Cars stopped offering to take me the other direction at the crossroads.","date":"2024-11-14","rating":5},{"text":"Wait 5 min and i was wet under rain but lucky and get ride to Voss for 5 min.","date":"2014-07-17","rating":4},{"text":"an ideal place to HH towards Oslo.If things don't seem to well then try the turist info point&fast food place across the highway.Take rides at least to Voss on E16.","date":null,"rating":4}],"destLat":60.6317,"destLon":6.4209},{"id":525,"lat":64.066,"lon":11.5075,"rating":4.33,"reviews":3,"wait":25,"signal":null,"lastUsed":"2023-08-14","comments":[{"text":"The bus stop is a nice spot to hitch-hike. We got a ride to Namsos on Sunday afternoon, the gas station was closed. If you are looking for cardboard, a grey container is behind a house on the other side of the road, it's closed but there's a hole to grab some.","date":"2023-08-14","rating":5},{"text":"There is also a petrol station.\n\nSeveral cars pulled of for me and I had to reject them because I needed to go further then they were able to take me ...","date":"2013-03-27","rating":4},{"text":"Dir: North (E6). Here is a bus stop where cars can stop. You could also choose to take road 17, which is a lot slower but supposed to be very pretty","date":"2007-04-09","rating":4}],"destLat":64.4681,"destLon":11.5022},{"id":537,"lat":60.2402,"lon":9.9253,"rating":4.33,"reviews":3,"wait":5,"signal":null,"lastUsed":"2023-08-07","comments":[{"text":"Not a bad spot, cars drive slowly, have a place where to stop.","date":"2014-07-22","rating":4}],"destLat":60.6484,"destLon":8.5981},{"id":564,"lat":58.2943,"lon":6.691,"rating":4.33,"reviews":3,"wait":14,"signal":null,"lastUsed":"2023-07-19","comments":[{"text":"Lots of cars, and lot's of time to stop :) got a ride immediately","date":"2023-07-19","rating":5},{"text":"Kristiansand direction. There is a bus stop with plenty of space to stop. Quite a bit of walk from the town but it's worth it.","date":"2014-09-16","rating":4}],"destLat":58.1145,"destLon":7.0819},{"id":581,"lat":67.2658,"lon":15.3858,"rating":4.33,"reviews":3,"wait":15,"signal":null,"lastUsed":"2023-07-10","comments":[{"text":"Got a ride for 130km to the ferry. The cars go not fast and there is enough place to stop","date":"2023-07-10","rating":5},{"text":"Summer/North\nGood spot right at the intersection cars are going slow and theres a place for them to stop","date":"2016-08-15","rating":4}],"destLat":67.2658,"destLon":15.3858},{"id":22,"lat":63.3221,"lon":10.3016,"rating":4.25,"reviews":4,"wait":83,"signal":"thumb","lastUsed":"2025-12-08","comments":[{"text":"Nice spot with a sheltered bus stop. The three of us waited for 15 minutes and got an amazing ride to Lillehammer.","date":"2025-12-08","rating":5},{"text":"Difficult with thumb up, nobody stopped until a man from Lithuania picked me up..","date":"2025-07-01","rating":3},{"text":"The spot is quite ok. Not much traffic (Wednesday 10am). Waited really long but I have no idea what spot would be better.","date":"2023-09-07","rating":4},{"text":"Bus stop with cover from rain, most of the people passing here are going on the E6 towards the south. After 45 minutes of waiting got a lift all the way to Lillehamer.","date":"2023-08-07","rating":5}],"destLat":61.1158,"destLon":10.4469},{"id":299,"lat":59.1224,"lon":9.7083,"rating":4.25,"reviews":4,"wait":18,"signal":"thumb","lastUsed":"2025-07-02","comments":[{"text":"I took a bus from city centre (50nok) to this spot. I was lucky, my last hitchhike in Norway!!! And picked up by a smiling Syrian man.. it was really hard to hitchhike in Norway compared with other European countries, but in the end, I made it! :) thanks to those who I met;)","date":"2025-07-02","rating":5},{"text":"You must be go at the bus stop just before the entrance of e18, only 20meters to the station and you catch all the car.","date":"2013-09-18","rating":4},{"text":"Hiked towards Kristiansand, waited 20 minutes.","date":"2013-04-28","rating":4},{"text":"Gasstation and fastfood. Here you will catch the main traffic between Oslo and Kristiansand, and also to Porsgrunn/Skien.","date":"2013-04-28","rating":4}],"destLat":59.127,"destLon":10.2277},{"id":300,"lat":61.4927,"lon":7.5976,"rating":4.25,"reviews":4,"wait":20,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"A norwegian man piked me up~:)","date":"2025-07-01","rating":4},{"text":"Enough place for car to pull over, luckily got picked up by a Norwegian man who was going on vacation with good mood","date":"2025-06-30","rating":5},{"text":"If you´re going direction Gaupne/Sogndal, don´t stay on the bus stop right in the middle of the vilage, pass the brige and reach a strawberry farm on your right. There´s another bus stop there and more people going your way.","date":"2015-09-16","rating":4}],"destLat":61.2313,"destLon":7.1088},{"id":307,"lat":62.829,"lon":10.0098,"rating":4.25,"reviews":4,"wait":5,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Early morning, picked up by a Norwegian man who was going to work, enough space to pull over","date":"2025-07-01","rating":5},{"text":"Spoke to some Lorry drivers and got a lift to Sweden. Check out the Log cabin on the hill if you need to sleep! AMAZING! (spot marked on map)","date":"2013-09-20","rating":4},{"text":"I was really lucky here, but it's a good spot, though ... you have shops and petrol stations around.","date":"2013-04-03","rating":4},{"text":"Direction: south\n\nThere's a bus stop where cars can stop for you and they are going slow here.","date":"2013-04-03","rating":4}],"destLat":62.5918,"destLon":9.6899},{"id":389,"lat":68.2392,"lon":14.5674,"rating":4.25,"reviews":4,"wait":25,"signal":"thumb","lastUsed":"2025-02-09","comments":[{"text":"Waited 10 minutes before a car picked me up. Didn’t bring me very far unfortunately (about 35 km outside of Svolvær)","date":"2025-02-09","rating":5},{"text":"We got picked up after 1 hour and got almost to Tromsø","date":"2016-06-30","rating":4},{"text":"Good spot. There is also a patrol station nearby.","date":"2014-09-17","rating":4},{"text":"Bus stop.","date":"2014-08-02","rating":4}],"destLat":null,"destLon":null},{"id":542,"lat":67.9002,"lon":13.0465,"rating":4.25,"reviews":4,"wait":18,"signal":null,"lastUsed":"2023-08-06","comments":[{"text":"Update 2023.\r\n\r\nThe ferry is free for walking passagers. \r\nYou can also ask the drivers, there are many tourists returning to Europe from here, so you can catch some long rides. Payment is per car as of now (i think something like 600 NOK per car) doesnt matter how many passagers.","date":"2023-08-06","rating":5},{"text":"Caught a ride with French tourists to go to Reine","date":"2015-08-17","rating":4},{"text":"One of the cars leaving the ferry picked us up without raising a thumb (6 people).","date":"2014-08-02","rating":4},{"text":"Ferry exit.","date":"2014-08-02","rating":4}],"destLat":67.8994,"destLon":13.0459},{"id":71,"lat":63.4098,"lon":10.4429,"rating":4.14,"reviews":7,"wait":35,"signal":null,"lastUsed":"2025-09-26","comments":[{"text":"Went back here for the second time. Still the feeling that car go to fast so you have to do big mouvement for them to see you far enough to pull over. But after 25min i got a 1h20 ride.","date":"2025-09-26","rating":4},{"text":"Not sure it's that great of a spot. Cars go all really fast. But I got a ride from a guy going on Trondheim, that went all the way to Asen for me. 50min","date":"2025-08-08","rating":4},{"text":"Got a ride to Stjørdal after less than a hour on a Sunday afternoon. Nice spot because lots of cars.","date":"2023-08-14","rating":5},{"text":"Waited 30 minutes and got a lift to a gas station 20km north from here.","date":"2019-08-15","rating":4},{"text":"hmm, lots of cars but a lot of local traffic. decent spot.","date":"2018-01-02","rating":4}],"destLat":63.7864,"destLon":11.4684},{"id":395,"lat":59.8809,"lon":10.7726,"rating":4.14,"reviews":7,"wait":23,"signal":"sign","lastUsed":"2024-12-01","comments":[{"text":"Good spot, stood at the Busstop Nedre Bekkelaget and got a ride to Ås really quick. I guess you could also ask ppl stopping at the gasstation nearby if they wanna take you. Only thing i would do differently is maybe see if i can get a rider further down south since leaving Ås wasn‘t super easy. \r\n\r\n**for reference: it was a monday around noon, i am a white woman in my mid-20ies**","date":"2024-12-01","rating":5},{"text":"Waited for 1 hour, quite some traffic but no luck I guess, not as others comment say so and not an excellent spot in my opinion. Then move on to next suggested spot 1km away and get a ride in 20mins. \nIt was on Wednesday afternoon","date":"2017-10-18","rating":4},{"text":"Waited 10 minutes on a Saturday morning and got a ride all the way to Copenhagen!","date":"2017-08-22","rating":4},{"text":"Waited for about 25 minutes for a ride to Karlstad [19-7-2015]. It was a Sunday, but traffic was still good. Took the bus, same as the others.","date":"2015-07-29","rating":4},{"text":"Took the bus from Oslo Central station to Nedre Bekkelaget and stood between the bus stop and the gas station. A sign is good to have becaus cars are driving mot agains Stockholm and Göteburg. Had to wait for 50 mins, and got a ride to Sarpsborg. Wednesday morning.","date":"2013-06-26","rating":4}],"destLat":59.663,"destLon":10.747},{"id":126,"lat":59.4348,"lon":10.6707,"rating":4,"reviews":7,"wait":18,"signal":"sign","lastUsed":"2025-08-25","comments":[{"text":"A guy and a girl with a small sign on a Sunday at noon. This spot is quite good. Two people stopped in 20min, and the third one took us South of Oslo and offered us lunch !","date":"2025-08-24","rating":4},{"text":"Once again, pretty good spot to go to Oslo, not much wait. Got a ride not all the way, but easy to get rides at least to a gas station on the highway.","date":"2025-08-06","rating":4},{"text":"Bus stop, enough place to stop. Very good to go towards Oslo. Got a ride for four (4) people within 5 mins.","date":"2025-07-27","rating":4},{"text":"Not great for going towards Sweden, but you can get a ride to a difficult spot by the highway","date":"2023-11-06","rating":3},{"text":"Bus stop.\nGood spot to go to the North (Oslo).\nGood traffic and place.\nWait 10min.","date":"2013-06-10","rating":5}],"destLat":59.4456,"destLon":10.7},{"id":252,"lat":59.8503,"lon":10.8345,"rating":4,"reviews":7,"wait":28,"signal":"thumb","lastUsed":"2025-07-29","comments":[{"text":"declined 6 cars going in all sorts of different directions (i was headed to Göteborg). eventually a guy took me to the border. I reccomend a sign :)","date":"2025-07-29","rating":4},{"text":"Very good spot (around 10 am), ask the cars and they feel less inclined to tell you no. Managed to get to Sweden","date":"2025-03-28","rating":4},{"text":"I agree with everything that Derpy wrote. I stood here on a sunday in november when the sun was out. Had a sign saying Göteborg and placed myself just where the cars exited the petrol station. Two or three cars stopped and asked if I wanted to go to Ski. But as you can see on the map that's not on the highway so I kindly said no. After 1 and a half hour I took an invite to go Ås. This is a good place though. Not perfect since cars aren't always going south nor onto the highway but I think that y","date":"2014-11-30","rating":4},{"text":"Pros: easy to get to, petrol station, hitching space.\n90 minutes before taking a ride only 20km down the E8. Not a lot of traffic actually goes onto the motorway here, and those that do seem to go short distances. Perhaps an on ramp closer to the city would be better?","date":"2013-09-08","rating":4},{"text":"Good spot to reach the south and then Göteborg, but very tough under the snow !","date":"2013-08-19","rating":4}],"destLat":59.1268,"destLon":11.3892},{"id":113,"lat":61.5722,"lon":6.48,"rating":4,"reviews":5,"wait":31,"signal":"thumb","lastUsed":"2025-08-30","comments":[{"text":"A guy and a girl on a Saturday afternoon without a sign. We only waited 1min to get a ride to a small village south of Ålesund. People on this road seem to mainly go to Nordfjordeid or further, there is enough space for cars to stop and they go quite slow due to the roundabout just before.","date":"2025-08-30","rating":5},{"text":"Good spot, lots of space for cars to stop. cars are slow because of the roundabout","date":"2025-03-15","rating":4},{"text":"The spot is good with space to park, slow traffic and visibility. In the evening despite the daylight nobody wanted to stop for some reason, eventually got a ride north.","date":"2024-08-29","rating":3},{"text":"bus stop in front of the hotel. cars go slowly because of the roundabout.","date":"2013-09-20","rating":4}],"destLat":62.3007,"destLon":6.083},{"id":175,"lat":63.4675,"lon":10.9203,"rating":4,"reviews":4,"wait":34,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"A lady offered to buy me a train ticket to Åsen but I refused and then I found a car going to Steinkjer.","date":"2025-08-09","rating":3},{"text":"Lots of traffic, but no cars stopped. I gave up and took the train north to Asen. Right by the station is a great place with plenty of room to stop!","date":"2023-07-11","rating":3},{"text":"Hitchhiked on a Sunday. Many cars passing by, got picked up after ca 2 min.","date":"2014-08-18","rating":5},{"text":"When standing at the exit from the gas station people from the gas station and the road can stop. Cars are not going to fast.","date":"2014-08-18","rating":5}],"destLat":64.0178,"destLon":11.4913},{"id":43,"lat":69.7947,"lon":20.9343,"rating":4,"reviews":3,"wait":3,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Literally first car took me","date":"2025-10-15","rating":5},{"text":"If ever, you have a roof at the bus stop (it's few meters before here)","date":"2025-08-24","rating":3},{"text":"A bit awkward to stop but otherwise perfect. Slow speeds and no local traffic.","date":"2024-06-28","rating":4}],"destLat":69.2178,"destLon":19.5583},{"id":51,"lat":69.4749,"lon":25.5114,"rating":4,"reviews":3,"wait":43,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Pretty good spot at the intersection to head north. Slow speeds, decent amount of cars.","date":"2024-06-26","rating":4},{"text":"There is a bus stop on the map, but in reality there is no bus stop on this road, so its best to wait here on this intersection, cars can pull over and stop. Was here in the morning, very little traffic but got picked up by German campers going to Honningsvag after 1 hour of waiting.","date":"2023-08-06","rating":4}],"destLat":70.5022,"destLon":25.0418},{"id":195,"lat":69.0427,"lon":18.5098,"rating":4,"reviews":3,"wait":20,"signal":null,"lastUsed":"2025-08-07","comments":[{"text":"And cars go slowly since it's in the town","date":"2025-08-07","rating":4},{"text":"Lots of space, lots of cars.","date":"2016-08-08","rating":4}],"destLat":null,"destLon":null},{"id":257,"lat":61.4907,"lon":7.6007,"rating":4,"reviews":3,"wait":null,"signal":"thumb","lastUsed":"2025-07-28","comments":[{"text":"not so good in the evening, but alright in the morning","date":"2025-07-28","rating":4},{"text":"caught a ride very quickly here to Otta, accros the Jotunheimen national park","date":"2015-08-17","rating":4}],"destLat":61.8687,"destLon":9.1043},{"id":302,"lat":61.8342,"lon":8.56,"rating":4,"reviews":3,"wait":40,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"not bad, Australian tourist family picked me up","date":"2025-07-01","rating":4},{"text":"Just by the campsite there´s a nice place for the drivers to pull off.","date":"2015-09-16","rating":4}],"destLat":61.7209,"destLon":8.3478},{"id":469,"lat":70.0309,"lon":22.1139,"rating":4,"reviews":3,"wait":5,"signal":"thumb","lastUsed":"2024-06-27","comments":[{"text":"Slightly better for heading to Alta but also worked just fine for me heading south to Storslett.","date":"2024-06-27","rating":4},{"text":"Got a direct ride to Alta in a minute. Seems to be a good one.","date":"2016-08-08","rating":4}],"destLat":69.7928,"destLon":20.9399},{"id":472,"lat":70.4739,"lon":25.0709,"rating":4,"reviews":3,"wait":16,"signal":"thumb","lastUsed":"2024-06-27","comments":[{"text":"Great spot for Alta direction.","date":"2024-06-27","rating":4},{"text":"Easy to get to Alta.","date":"2016-08-08","rating":4}],"destLat":70.4324,"destLon":24.5017},{"id":491,"lat":69.6265,"lon":18.9485,"rating":4,"reviews":3,"wait":25,"signal":null,"lastUsed":"2024-03-05","comments":[{"text":"The spot doesn't look so good but worked fine for me in summer and winter. To get there just cross the bridge over the main road nearby. About 30min walk from the bridge leaving Tromsø.","date":"2024-03-05","rating":4},{"text":"Solstrand. Ok spot, better then all others probably. People can stop. A bus stops parallel to the E8 on Solstrandvegen - you just need to find a clever way to get woen from there to the street.","date":"2016-09-14","rating":4}],"destLat":69.2174,"destLon":19.5567},{"id":576,"lat":69.2195,"lon":19.5582,"rating":4,"reviews":3,"wait":10,"signal":null,"lastUsed":"2023-07-14","comments":[{"text":"I stood there for 10 minutes and immediately got a ride to Alta! Not a tad smog of a place to stop, but the Norwegians are Kind and always happy to help! That's what I love about Norway!","date":"2023-07-14","rating":4},{"text":"Not too much traffic towards East even on a Friday. Not too much space to pull over. \nI got a ride in 15mins from a truck driver who just pull over in the middle of the road, since there's no traffic at all","date":"2018-11-27","rating":4},{"text":"There is virtually no space to pull over, many people go from the shop (=slowly).","date":"2014-08-02","rating":4}],"destLat":69.9583,"destLon":23.2684},{"id":601,"lat":68.4324,"lon":17.4239,"rating":4,"reviews":3,"wait":13,"signal":null,"lastUsed":"2023-06-14","comments":[{"text":"I waited for a ride to go to bognes for around 30-40 minutes. It was 5pm, lots of family with kids that just finished school.","date":"2023-06-14","rating":4},{"text":"Only had to wait 5 mins to get a short ride south :)","date":"2016-07-27","rating":4}],"destLat":68.2242,"destLon":16.0748},{"id":34,"lat":68.4241,"lon":14.8405,"rating":4,"reviews":2,"wait":68,"signal":"sign","lastUsed":"2025-10-17","comments":[{"text":"It seems pretty good for hitchhiking, but I somehow spent a lot of time there.","date":"2025-10-17","rating":4},{"text":"big wide shoulder for parking, good visibility and easy to stop","date":"2025-07-23","rating":4}],"destLat":68.2324,"destLon":14.563},{"id":58,"lat":63.4639,"lon":11.1139,"rating":4,"reviews":2,"wait":23,"signal":"thumb","lastUsed":"2025-10-03","comments":[{"text":"Great visibility, plenty of space to stop, drivers not going fast, it’s got it all!","date":"2025-10-03","rating":5}],"destLat":63.4182,"destLon":11.7392},{"id":121,"lat":59.9086,"lon":10.4873,"rating":4,"reviews":2,"wait":14,"signal":"sign","lastUsed":"2025-08-27","comments":[{"text":"A guy and a girl on a Wednesday at noon with a small arrow sign. It's hard to get to this spot, you have to get to the other side of the road, in the gas station by bus and foot before crossing to the other side.\r\nIt looks like a bad spot from afar, but is in fact very nice, with lot of place to stop and cars going slowly before the roundabout.","date":"2025-08-27","rating":4},{"text":"Had a sight to Honefoss, this is quite a good spot if you heading north, lot of people go further than that... I made it to a town 2h North West of Oslo. Got here by bus","date":"2023-06-29","rating":4}],"destLat":59.9639,"destLon":10.3462},{"id":214,"lat":61.8625,"lon":9.0818,"rating":4,"reviews":2,"wait":13,"signal":"thumb","lastUsed":"2025-08-05","comments":[{"text":"Not ideal, but probably the best to keep up on this road. Ride to Lom in 5\"","date":"2025-08-05","rating":3},{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Geiranger.\r\nA good spot. A bus stop at a small road. Not very busy traffic. \r\nI managed get a ride in 20-30 minutes to the next town, about 30 kms up the road.","date":"2025-05-18","rating":5}],"destLat":61.8386,"destLon":8.5665},{"id":310,"lat":66.8103,"lon":15.4064,"rating":4,"reviews":2,"wait":28,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"A germany lady picked me up here, big space to pull over the car..","date":"2025-07-01","rating":4},{"text":"Area to stop near the E6, not the greatest place, because cars are going fast, but they can see you from far away. Saw a lot of Swedish cars while waiting. There is a gas station north from this road for north and south traffic. I was going south and decided to hitch here, waited 25 minutes before got a lift to Mo I Rana.","date":"2023-08-07","rating":4}],"destLat":65.5311,"destLon":13.4022},{"id":342,"lat":60.6232,"lon":6.3862,"rating":4,"reviews":2,"wait":3,"signal":"thumb","lastUsed":"2025-04-21","comments":[{"text":"For direction Bergen: bus stop with good visibility and a shelter. Can be reached from the station by following the road and using the large bridge just past the Voss vandrarheim","date":"2025-04-21","rating":5}],"destLat":60.4206,"destLon":5.4615},{"id":410,"lat":59.9254,"lon":6.5744,"rating":4,"reviews":2,"wait":98,"signal":"sign","lastUsed":"2024-10-02","comments":[{"text":"Place itself is good, but we were unlucky this time and had to wait for 3h.\r\nLow to moderate traffic.","date":"2024-10-02","rating":4},{"text":"Wasn't a huge amount of traffic for midday but still didn't take long t catch a ride, plent of space to pull over","date":"2023-02-16","rating":4}],"destLat":59.8281,"destLon":6.245},{"id":503,"lat":69.2205,"lon":19.5661,"rating":4,"reviews":2,"wait":39,"signal":null,"lastUsed":"2023-10-06","comments":[{"text":"Just walk a bit up the road from the intersection E8/E6. It's someone's driveway so a bit of space to stop.","date":"2023-10-06","rating":4}],"destLat":69.3662,"destLon":20.2694},{"id":559,"lat":62.1187,"lon":8.8684,"rating":4,"reviews":2,"wait":50,"signal":null,"lastUsed":"2023-07-23","comments":[{"text":"Nice spot to stand, got a ride towards the west,  good flow of cars going quite slowly :) 4km up the mountain theres a nice cabin to sleep in with a nice view over the valley :)","date":"2023-07-23","rating":4},{"text":"Really good spot to stand, good flow of cars which are driving slow, small parking lot for them to hold. Theres a store nearby and a really nice hut 4km up the mountain where you can sleep and have a nice view over the valley :)","date":"2023-07-23","rating":4}],"destLat":62.1187,"destLon":8.8684},{"id":578,"lat":61.8965,"lon":9.3921,"rating":4,"reviews":2,"wait":15,"signal":null,"lastUsed":"2023-07-11","comments":[{"text":"Got a ride quickly, going south. Good flow of cars, going relatively slow, and quite some space for them to stop. :)","date":"2023-07-11","rating":4},{"text":"Got a short ride to Sel, good spot to stand, the cars have space to hold and are going slow, also steady flow of cars. :)","date":"2023-07-11","rating":4}],"destLat":61.8964,"destLon":9.3921},{"id":25,"lat":66.3168,"lon":14.2259,"rating":4,"reviews":1,"wait":4,"signal":"sign","lastUsed":"2025-10-17","comments":[{"text":"Expect low traffic on this road, really lonely but great experience to go that way to Umea","date":"2025-10-17","rating":4}],"destLat":66.2595,"destLon":14.5413},{"id":29,"lat":67.8806,"lon":12.9785,"rating":4,"reviews":1,"wait":12,"signal":null,"lastUsed":"2025-10-17","comments":[{"text":"Low traffic but I just waited on the exit from parking and it worked.","date":"2025-10-17","rating":4}],"destLat":67.9022,"destLon":13.0416},{"id":53,"lat":70.0501,"lon":24.9792,"rating":4,"reviews":1,"wait":45,"signal":null,"lastUsed":"2025-10-12","comments":[{"text":"45 minutes on a sunday afternoon, I never wait that long usually. But the spot issue good. I took a just a 20 minutes ride to the military zone, cuz I was freezing. Then I get mire lucky and find one quicker.","date":"2025-10-12","rating":4}],"destLat":69.9053,"destLon":24.9985},{"id":79,"lat":59.129,"lon":11.2684,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-09-13","comments":[{"text":"Lazy to ask people so i stayed there and did not wait this long to find a ride directly to where i wanted in Sweden","date":"2025-09-13","rating":4}],"destLat":58.72,"destLon":11.3502},{"id":88,"lat":58.4774,"lon":6.3578,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-07","comments":[{"text":"A guy and a girl on a Saturday afternoon without a sign. Not a lot of traffic, but enough place to stop, and good view all around. We got a ride to Kristiansand in a few minutes.","date":"2025-09-07","rating":4}],"destLat":58.1392,"destLon":8.0016},{"id":89,"lat":58.5228,"lon":6.1152,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-07","comments":[{"text":"A guy and a girl on a Saturday afternoon without a sign. This bus spot is good to go south, not a lot of traffic, and cars go rather fast, but there is space to stop, and the landscape around is beautiful!","date":"2025-09-07","rating":4}],"destLat":58.4774,"destLon":6.3578},{"id":92,"lat":58.9833,"lon":5.6705,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-09-07","comments":[{"text":"A guy and a girl on a Friday at noon, with a sign. This spot is good if you get stranded in the area : cars don't go fast and there is enough space to stop. But a lot of people only go to Stavanger. Two cars stopped and the last one took us to Forus, south of Stavanger, but we got stranded there so, if you can, try to have ride further, like Ålgård.","date":"2025-09-07","rating":4}],"destLat":58.8953,"destLon":5.7084},{"id":93,"lat":69.2549,"lon":19.8815,"rating":4,"reviews":1,"wait":40,"signal":null,"lastUsed":"2025-09-06","comments":[{"text":"There is nothing here (0 small shops), just small space to stop.","date":"2025-09-06","rating":4}],"destLat":69.6526,"destLon":18.9585},{"id":95,"lat":61.4542,"lon":5.8347,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-09-04","comments":[{"text":"A guy and a girl on a Thursday afternoon without a sign. There is a bus stop large enough for cars to stop and a small road entrance after the bus. There is a lot of passage, and cars don't go that fast. We got a ride to Bergen after a short wait.","date":"2025-09-04","rating":4}],"destLat":60.475,"destLon":5.3325},{"id":97,"lat":61.7541,"lon":6.2786,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-09-04","comments":[{"text":"A guy and a girl on a Thursday morning without a sign. There is place for cars to stop, and a lot of cars passing by, a bit quickly. We were picked up by two people who dropped us outside of Skei.","date":"2025-09-04","rating":4}],"destLat":61.5683,"destLon":6.4659},{"id":101,"lat":68.8608,"lon":18.3478,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-09-04","comments":[{"text":"Bit scuffed but cars can pull into the gas station. Worked for me and got a ride for like 350km so i wont complain","date":"2025-09-04","rating":4}],"destLat":67.1051,"destLon":20.8997},{"id":102,"lat":67.2955,"lon":14.757,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-09-03","comments":[{"text":"Classic roundabout, not much space but ok\r\nHitchhacking right in the roudabout\r\nTo go to the main road","date":"2025-09-03","rating":4}],"destLat":67.1007,"destLon":15.3928},{"id":103,"lat":67.2339,"lon":14.6248,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-09-03","comments":[{"text":"For me it was ok, to go back from the Saltsraumen maelstrom to the main road\r\nThere is a bus stop, visibility ok but not perfect.","date":"2025-09-03","rating":4}],"destLat":null,"destLon":null},{"id":109,"lat":62.3041,"lon":6.094,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-01","comments":[{"text":"A guy and a girl on a Monday at noon without a sign. This spot is good to go to Ålesund : people going through this road seem to mainly take the ferry. There is enough place to stop and some traffic, but cars go a bit fast here.","date":"2025-09-01","rating":4}],"destLat":62.4729,"destLon":6.1579},{"id":115,"lat":60.8791,"lon":8.4833,"rating":4,"reviews":1,"wait":25,"signal":"thumb","lastUsed":"2025-08-29","comments":[{"text":"A guy and a girl on a Thursday afternoon without a sign. This spot has plenty of space to stop, but there are not so many people passing through.\r\nA nice farmer got us to Sogndal and showed us a good spot to camp there.","date":"2025-08-29","rating":4}],"destLat":61.365,"destLon":6.9073},{"id":116,"lat":60.8634,"lon":8.5509,"rating":4,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2025-08-29","comments":[{"text":"A guy and a girl on a Thursday at noon without a sign. The spot is not so bad, but the cars go a bit fast and there is not so much place to stop for this speed.\r\nYet a farmer from Tuv picked us and brought us to a better spot in Tuv, where everyone is going west.","date":"2025-08-29","rating":4}],"destLat":60.8791,"destLon":8.4833},{"id":123,"lat":61.5293,"lon":10.1453,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-25","comments":[{"text":"Very busy and trafficked spot, no trucks stopped. It was suggested to us by a local","date":"2025-08-25","rating":4}],"destLat":62.6566,"destLon":9.8797},{"id":127,"lat":62.6566,"lon":9.8803,"rating":4,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2025-08-25","comments":[{"text":"Very good spot to spend the night and to hitchhike, although the bar is an expensive one.","date":"2025-08-25","rating":4}],"destLat":63.4138,"destLon":10.3965},{"id":136,"lat":60.8803,"lon":10.9271,"rating":4,"reviews":1,"wait":60,"signal":"ask","lastUsed":"2025-08-24","comments":[{"text":"Two Gas stations","date":"2025-08-24","rating":4}],"destLat":61.1165,"destLon":10.4457},{"id":148,"lat":61.1177,"lon":10.4462,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-08-20","comments":[{"text":"better spot than gas station but it's on highway and cars don't have enough space to stop","date":"2025-08-20","rating":4}],"destLat":61.2065,"destLon":10.432},{"id":154,"lat":58.6144,"lon":8.9014,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-08-17","comments":[{"text":"Very good space for stopping and much traffic.","date":"2025-08-17","rating":4}],"destLat":58.8996,"destLon":9.2908},{"id":160,"lat":68.0813,"lon":13.1634,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"little traffic, third car took me while walking","date":"2025-08-15","rating":4}],"destLat":68.1465,"destLon":13.6085},{"id":161,"lat":68.0884,"lon":13.2286,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"Taking while walking down the road","date":"2025-08-15","rating":4}],"destLat":68.0743,"destLon":13.2031},{"id":165,"lat":69.0614,"lon":18.4936,"rating":4,"reviews":1,"wait":12,"signal":null,"lastUsed":"2025-08-15","comments":[{"text":"Only little place to stop after the roundabout, still got a direct lift to thw beginning of Lofoten","date":"2025-08-15","rating":4}],"destLat":68.4612,"destLon":16.0267},{"id":173,"lat":67.9389,"lon":13.0829,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"I hitchyke on this road 3 time at different spot, between moskanes and reine, between reine and the coop. Sometimes there is no hiking trail at all. And Hitchyking works really well, with locals or tourist, in 5\" you get a ride.","date":"2025-08-11","rating":4}],"destLat":67.9303,"destLon":13.0918},{"id":178,"lat":63.5213,"lon":9.1078,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-08-09","comments":[{"text":"Not too much traffic, but got a ride to Orkanger.","date":"2025-08-09","rating":4}],"destLat":63.296,"destLon":9.8519},{"id":180,"lat":63.7058,"lon":8.8242,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"Got a ride with locals to Dyrøy ferjekai and they offered to pick me up after a hike on the island and that I could stay at their cottage for the night and continue hitchhiking to Trondheim tomorrow.","date":"2025-08-09","rating":4}],"destLat":63.7993,"destLon":8.6813},{"id":185,"lat":62.7594,"lon":7.3613,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-09","comments":[{"text":"Not too good of a bus stop, as they drive by quite fast, but a local took me, he was a big fan of the Baltics, showed me around in Kristiansund, and invited me back to stay with his family when I come back and took me to the ferjekai to Tustna.","date":"2025-08-09","rating":4}],"destLat":63.1119,"destLon":7.8703},{"id":194,"lat":67.5061,"lon":12.0668,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-08","comments":[{"text":"Got a ride with my friends in the back of a truck, horrible weather, great people!","date":"2025-08-08","rating":4}],"destLat":67.5093,"destLon":12.1099},{"id":197,"lat":59.7028,"lon":10.7906,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-07","comments":[{"text":"Big space on the side for cars to stop, all traffic towards Sweden going through. Also a tiny little cafe.","date":"2025-08-07","rating":4}],"destLat":59.5742,"destLon":11.2165},{"id":215,"lat":60.932,"lon":10.6539,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-05","comments":[{"text":"Little rest stop with bathrooms. Not many cars stopping, so we chose to stay in the entrance with an Oslo sign. Pretty soon a truck driver stopped and took us past Oslo. Four stars because they do go quite fast, and almost nobody stope in the rest stop. But even with rain and bad weather we got lucky.","date":"2025-08-05","rating":4}],"destLat":59.6019,"destLon":10.7437},{"id":219,"lat":69.254,"lon":17.5453,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-05","comments":[{"text":"First car stopped in an August morning (not much traffic here and the car had to turn around so it was slow)","date":"2025-08-05","rating":4}],"destLat":69.133,"destLon":18.5806},{"id":225,"lat":60.4243,"lon":5.6272,"rating":4,"reviews":1,"wait":20,"signal":"ask","lastUsed":"2025-08-04","comments":[{"text":"It seems to be a good spot for any direction but mostly people who stopped here were driving to Bergen. But I found a woman driving past Knarvik eventually.","date":"2025-08-04","rating":4}],"destLat":60.6263,"destLon":5.4733},{"id":226,"lat":60.4197,"lon":5.3107,"rating":4,"reviews":1,"wait":25,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"A good spot in the sense that there’s lots of traffic and plenty of space where to stop. But, the traffic is moving rather fast and people were not very eager to stop there. A lady saw me and then drove back and came to pick me up.","date":"2025-08-04","rating":4}],"destLat":60.4243,"destLon":5.6271},{"id":228,"lat":68.7059,"lon":15.413,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"Cars going in different directions here but slow enough to stop","date":"2025-08-04","rating":4}],"destLat":69.1054,"destLon":15.9624},{"id":229,"lat":68.2041,"lon":14.2403,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-08-04","comments":[{"text":"Waited here on a Monday morning in August - got picked up by a car with a local hitchhiker :)","date":"2025-08-04","rating":4}],"destLat":68.2353,"destLon":14.5639},{"id":235,"lat":58.4608,"lon":6.5402,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-08-02","comments":[{"text":"Not much traffic stopping here, but asked around and found a family going to Sandnes.","date":"2025-08-02","rating":4}],"destLat":58.8008,"destLon":5.7817},{"id":246,"lat":62.5865,"lon":7.5373,"rating":4,"reviews":1,"wait":55,"signal":"thumb","lastUsed":"2025-07-30","comments":[{"text":"The spot is not the best. Norwegian people will pass you but fortunately there are also a few nice people from eastern Europe. They picked me up because they are more helpful more hospitable and they are not afraid without reason like Norwegians 🙄","date":"2025-07-30","rating":4}],"destLat":62.1264,"destLon":7.1672},{"id":249,"lat":59.4013,"lon":9.9557,"rating":4,"reviews":1,"wait":55,"signal":"thumb","lastUsed":"2025-07-30","comments":[{"text":"There is no better place. The people are the problem. No helpfulness, no hospitality, only dismissive, uninterested and snide looks.","date":"2025-07-30","rating":4}],"destLat":59.0696,"destLon":10.0481},{"id":258,"lat":60.6552,"lon":6.4356,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-07-28","comments":[{"text":"a lot of traffic, maybe even too much","date":"2025-07-28","rating":4}],"destLat":null,"destLon":null},{"id":267,"lat":59.8892,"lon":9.3863,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-07-27","comments":[{"text":"Rest stop with bathroom and picnic tables. Not many people stopping, but easy to talk to them and get a ride to Rødberg. An old couple picked me up in the morning, going on their yearly retreat to their cabin. Showed me the 800 y.o. beautiful wooden church in the area, and explained the history of the water turbine.","date":"2025-07-27","rating":4}],"destLat":60.2659,"destLon":8.9472},{"id":269,"lat":59.7099,"lon":10.7367,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-07-27","comments":[{"text":"Good visibility, and space to stop.","date":"2025-07-27","rating":4}],"destLat":59.6623,"destLon":10.7444},{"id":271,"lat":59.8344,"lon":9.5801,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-07-26","comments":[{"text":"Less and less traffic as you follow this road. Local mostly. Town jumping. I wanted to find a nice place to camp near the river and this guy recommended me a very cute spot. Amazing river, recommend going for a swim.","date":"2025-07-26","rating":4}],"destLat":59.8973,"destLon":9.3705},{"id":272,"lat":59.6697,"lon":9.6407,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-07-26","comments":[{"text":"Big bus stop with space to stop, and a speed bump just before that makes the cars go slow. If you're trying to go north, keep in mind most of the traffic is local and you'll be getting small rides town to town. A guy from Eritrea, working in healthcare, picked me up and took me to Lampeland.","date":"2025-07-26","rating":4}],"destLat":59.8344,"destLon":9.58},{"id":274,"lat":59.2485,"lon":10.287,"rating":4,"reviews":1,"wait":30,"signal":"ask","lastUsed":"2025-07-26","comments":[{"text":"Small, chill, rest place with a small restaurant. Not a lot of traffic, but asking people will get you places, easy to get to Drammen or Oslo. An old guy alone in his camper, going all the way north, picked me up.","date":"2025-07-26","rating":4}],"destLat":59.731,"destLon":10.2164},{"id":276,"lat":63.0927,"lon":10.245,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-07-26","comments":[{"text":"Rest area. We thumped from the point where the entry lane starts. Cars rather fast but good visibility and entry round is pretty long thus easy for cars to pull over.","date":"2025-07-26","rating":4}],"destLat":59.7762,"destLon":10.8157},{"id":278,"lat":63.983,"lon":11.4306,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-07-25","comments":[{"text":"Walked here from Steinkjer as there didn't seem to be a good spot. Rest area with toilets. First person I asked gave a ride.","date":"2025-07-25","rating":4}],"destLat":63.0924,"destLon":10.2455},{"id":280,"lat":68.0277,"lon":16.0027,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-07-24","comments":[{"text":"Visibility ok, lots of space to stop. Lake nearby, nice place for rest and camping.","date":"2025-07-24","rating":4}],"destLat":64.7419,"destLon":12.8442},{"id":281,"lat":64.7428,"lon":12.8455,"rating":4,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2025-07-24","comments":[{"text":"Good visibility, slow cars, easy to stop. Petrol station nearby if you fell like asking people.","date":"2025-07-24","rating":4}],"destLat":64.4661,"destLon":12.3021},{"id":282,"lat":68.0171,"lon":15.3322,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-07-23","comments":[{"text":"town and ferry from Lofoten only arrives two times per day.","date":"2025-07-23","rating":4}],"destLat":68.0308,"destLon":16.0004},{"id":283,"lat":69.1055,"lon":15.9622,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-07-22","comments":[{"text":"cars are slow and enough space to stop","date":"2025-07-22","rating":4}],"destLat":68.9858,"destLon":15.6521},{"id":284,"lat":69.6957,"lon":18.8825,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-07-22","comments":[{"text":"Just after the roundabout, enough space to stop.","date":"2025-07-22","rating":4}],"destLat":69.6078,"destLon":18.0312},{"id":293,"lat":68.5262,"lon":16.9917,"rating":4,"reviews":1,"wait":2,"signal":"ask","lastUsed":"2025-07-13","comments":[{"text":"Another nice old couple, offered me a ride at the gas station as soon as the last car dropped me off","date":"2025-07-13","rating":4}],"destLat":68.6528,"destLon":17.6925},{"id":301,"lat":61.721,"lon":8.3488,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Not many traffic, waited until a sweden man picked me up:)","date":"2025-07-01","rating":4}],"destLat":61.4907,"destLon":7.5988},{"id":308,"lat":63.4516,"lon":10.9155,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Early morning, just give it a try , a Norwegian woman who sent her daughter to airport piked me up when she was going back to home","date":"2025-07-01","rating":4}],"destLat":63.429,"destLon":10.3629},{"id":314,"lat":67.9417,"lon":13.1114,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"there is enough space for car to pull over, a man from Czech picked me up to Reine","date":"2025-07-01","rating":4}],"destLat":67.9282,"destLon":13.0837},{"id":317,"lat":69.1426,"lon":18.5996,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Small space, but A nice Germany couple helped me out when they finished filling the petrol maybe","date":"2025-07-01","rating":4}],"destLat":68.5494,"destLon":17.557},{"id":333,"lat":61.7737,"lon":9.508,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-05-17","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Geiranger.\r\nA good spot. A bus stop at a small road. It was evening, hence the traffic was quite small. But I managed get a ride in 20-30 minutes to the next town, about 30 kms up the road.","date":"2025-05-17","rating":4}],"destLat":61.8651,"destLon":9.0989},{"id":336,"lat":63.2973,"lon":9.8344,"rating":4,"reviews":1,"wait":45,"signal":"sign","lastUsed":"2025-04-26","comments":[{"text":"2 turkish guys picked us up and got us all the way up to kristiansund","date":"2025-04-26","rating":4}],"destLat":63.0988,"destLon":7.8198},{"id":337,"lat":63.3577,"lon":10.2712,"rating":4,"reviews":1,"wait":1,"signal":"thumb","lastUsed":"2025-04-26","comments":[{"text":"Were walging to ringvål to hitch onto the e39 to kristiansund, got pikkedonker up bij a Lively lady who brouwt us to buvika to the onramp","date":"2025-04-26","rating":4}],"destLat":63.3083,"destLon":10.1734},{"id":340,"lat":59.3563,"lon":10.8438,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-04-23","comments":[{"text":"Most of the cars driving in the direction to Oslo only a few south.","date":"2025-04-23","rating":4}],"destLat":58.9643,"destLon":11.2328},{"id":345,"lat":60.166,"lon":11.1567,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-03-28","comments":[{"text":"During the daytime, was quite okay. The success rate is higher when you ask the cars directly. Went direction Oslo so that might help","date":"2025-03-28","rating":4}],"destLat":null,"destLon":null},{"id":349,"lat":69.6439,"lon":18.9823,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"Really good spot, found a car who took pity for me and they helped me get into the centrum (at night, around 7-8 pm)","date":"2025-03-24","rating":4}],"destLat":null,"destLon":null},{"id":366,"lat":61.49,"lon":6.1021,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Found a car quite quickly. Downside is some cars might get off of the E39 when in the village","date":"2025-03-15","rating":4}],"destLat":null,"destLon":null},{"id":373,"lat":59.5682,"lon":5.4187,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Asked around and quickly got a car. There’s not many people, which can be an advantage because people could feel inclined to help you out (because they’d feel bad leaving you there)","date":"2025-03-15","rating":4}],"destLat":null,"destLon":null},{"id":376,"lat":58.9658,"lon":5.7323,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-03-15","comments":[{"text":"Managed to get out of the city quite quickly, people were very friendly","date":"2025-03-15","rating":4}],"destLat":null,"destLon":null},{"id":393,"lat":60.3765,"lon":5.3383,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-01-17","comments":[{"text":"Waited 20 minutes before a car took me out of Bergen","date":"2025-01-17","rating":4}],"destLat":60.4766,"destLon":5.3544},{"id":401,"lat":59.0234,"lon":5.6135,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-11-14","comments":[{"text":"Good spot to ask people in the queue to the ferry or on the ferry if they can give you a ride. Gotta be comfortable w/approaching ppl tho.","date":"2024-11-14","rating":4}],"destLat":null,"destLon":null},{"id":416,"lat":67.259,"lon":15.383,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-09-03","comments":[{"text":"Stand just before the crosswalk, cars go slow.","date":"2024-09-03","rating":4}],"destLat":67.295,"destLon":14.7441},{"id":425,"lat":61.9118,"lon":6.0117,"rating":4,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2024-08-29","comments":[{"text":"A good busstop with plenty of space, slowish traffic and strong visibility. All the traffic here is going far, unlike further in busstops which are 90% local. I kinda hate this place though, I got stranded here overnight and it was raining, a lot of cars would drive past and smile and laugh at me in the rain. Don’t smile and wave at me when your driving past in your nice empty SUV while I’m freezing my tits off in the thunderstorm you giant knob. Could have been random through, hopefully it work","date":"2024-08-29","rating":4}],"destLat":62.3043,"destLon":6.9262},{"id":445,"lat":63.0682,"lon":8.2327,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-08-10","comments":[{"text":"Managed to miss the traffic exiting the ferry (free for foot passengers), but I quickly got picked up by some other legend for a short distance, just by wandering along the empty road with thumb","date":"2024-08-10","rating":4}],"destLat":63.126,"destLon":8.3635},{"id":463,"lat":59.8326,"lon":6.8132,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2024-07-30","comments":[{"text":"Decently visited gas station in peak tourist season. Standing at the entrance also gives passing cars a chance to see you and stop at the station. Could also be used for going west, about half the cars who went to the station were heading west.","date":"2024-07-30","rating":4}],"destLat":59.6526,"destLon":9.656},{"id":468,"lat":69.3729,"lon":20.2858,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2024-06-28","comments":[{"text":"Direction: Finland. I stood in the middle of the 2 ramps on the gravel and got a ride very quickly. Amazing views too.","date":"2024-06-28","rating":4}],"destLat":69.0456,"destLon":20.8029},{"id":479,"lat":61.1303,"lon":11.3665,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-05-29","comments":[{"text":"Ha ha ha, what should I say, guys? Last time I wrote that this spot is not convenient, and the next time after 20 mins wait (around 7.45 pm) a car from the main road pulled over. The car was going to Trondheim, my final destination. \r\nMaybe I was lucky that day. But as an experienced hitch-hiker I would technically avoid this spot. I suggest Elverum roundabout which is more convenient and all the traffic is the same.","date":"2024-05-29","rating":4}],"destLat":63.4328,"destLon":10.4445},{"id":481,"lat":62.0711,"lon":9.1234,"rating":4,"reviews":1,"wait":45,"signal":"sign","lastUsed":"2024-05-20","comments":[{"text":"Not a perfect spot because the road goes downhill, trucks can't stop there, but good enough - there is enough space to pull out for a regular car. 43 mins wait and a 280km ride to Dal close to the Oslo airport. Nothing to complain.\r\nThere are many gaz stations and supermarkets there.","date":"2024-05-20","rating":4}],"destLat":60.2478,"destLon":11.2028},{"id":488,"lat":60.7998,"lon":11.1166,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-03-11","comments":[{"text":"A great spot to get south from Hamar. Just stand in the roundabout before the onramp, there are just a little space for a car to stop, so get ready to get in quickly.","date":"2024-03-11","rating":4}],"destLat":59.9249,"destLon":10.845},{"id":490,"lat":68.2363,"lon":14.5547,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2024-03-05","comments":[{"text":"Heading south. Good visibility and plenty of place to stop (bus stop). (winter)","date":"2024-03-05","rating":4}],"destLat":68.2086,"destLon":14.472},{"id":504,"lat":69.4716,"lon":25.5114,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-09-16","comments":[{"text":"The spots to stand at the road arent as good, but asking at the gasstation worked really well for me, got a ride with a truck to Kaamanen :)","date":"2023-09-16","rating":4}],"destLat":69.4716,"destLon":25.5114},{"id":507,"lat":66.3203,"lon":14.1717,"rating":4,"reviews":1,"wait":25,"signal":null,"lastUsed":"2023-09-12","comments":[{"text":"Good flow of cars, good place for them to stop, going slowly because of the roundabout, gasstation closeby. Got a ride to Røssvoll :)","date":"2023-09-12","rating":4}],"destLat":66.3203,"destLon":14.1718},{"id":509,"lat":61.9056,"lon":6.7267,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-09-07","comments":[{"text":"Going East. Not the best stop, but there's a junction for cars to safely pull over and the cars are still driving pretty slow. They can see you from afar. Worked out for me.","date":"2023-09-07","rating":4}],"destLat":61.7723,"destLon":9.5364},{"id":510,"lat":62.556,"lon":7.6807,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-09-07","comments":[{"text":"Bus stop, so there's plenty of space for cars to stop","date":"2023-09-07","rating":4}],"destLat":62.6241,"destLon":7.0882},{"id":511,"lat":60.8793,"lon":10.9267,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-09-07","comments":[{"text":"Good spot for going south, busstop so there is plenty of space for cars to stop. Not too much traffic, but also not isolatet.","date":"2023-09-07","rating":4}],"destLat":59.9168,"destLon":10.6911},{"id":512,"lat":60.7927,"lon":6.5212,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-09-03","comments":[{"text":"Stop is not perfect but I got lucky after about 15 min and got a ride to oppdal witch was perfect because I wanted to get to trondheim. Also it was possible to dumpster dive the joker by the roundabout.","date":"2023-09-03","rating":4}],"destLat":62.5884,"destLon":9.6847},{"id":514,"lat":69.6236,"lon":18.8062,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-09-02","comments":[{"text":"There is a big busstop behind for cars to stop easily.","date":"2023-09-02","rating":4}],"destLat":69.6236,"destLon":18.8063},{"id":516,"lat":66.3376,"lon":14.16,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-08-16","comments":[{"text":"Good spot to go east. We wanted to go to the free ferry at Stokkvågen and it worked ! With a Stokkvågen sign we waited 30min to get a ride to the harbour and then we took the free boat to Lovund, I really recommend this island if you like birds or hiking!","date":"2023-08-16","rating":4}],"destLat":66.338,"destLon":13.0143},{"id":519,"lat":64.6273,"lon":12.3009,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-08-16","comments":[{"text":"Good spot. People are going north or to the E6. We got a ride to the E6.","date":"2023-08-16","rating":4}],"destLat":64.53,"destLon":12.3979},{"id":527,"lat":62.7477,"lon":9.983,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-08-11","comments":[{"text":"Good spot to stand and good flow of traffic, the cars are going a bit fast tho, got a ride straight to Oslo.","date":"2023-08-11","rating":4}],"destLat":62.7477,"destLon":9.983},{"id":530,"lat":59.9527,"lon":10.9098,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-08-10","comments":[{"text":"We went to Haugestua Station by train L 1 and than 2 min walk to the gas station from where there is much trafik on to the e6 in direction north, second car stopped we got very lucky, got dropped of in jessheim nord where we wait for one hour ( Norway sucks)","date":"2023-08-10","rating":4}],"destLat":60.1643,"destLon":11.1614},{"id":547,"lat":62.6052,"lon":9.7316,"rating":4,"reviews":1,"wait":45,"signal":null,"lastUsed":"2023-08-02","comments":[{"text":"Big Busstop to stand, good flow of trafic a little fast tho. Got a ride to Gjøvik :)","date":"2023-08-02","rating":4}],"destLat":62.6052,"destLon":9.7317},{"id":549,"lat":63.9193,"lon":11.4329,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-07-31","comments":[{"text":"Dir: north, summer.\r\nBus stop so enough space to pull over, cars going slower as it's through a town, decent visibility.","date":"2023-07-31","rating":4}],"destLat":63.9193,"destLon":11.4329},{"id":554,"lat":61.4466,"lon":5.8871,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-07-28","comments":[{"text":"Pretty good spot for heading north on the e39, it's a bus stop, so lots of room for people to pull over, and a long road so they can see you from a ways off. Got a ride all the way to ålesund from a boat captain heading home from a stint at sea. Lots of construction further up the road so a fair walk to get there though (July 2023)","date":"2023-07-28","rating":4}],"destLat":62.4676,"destLon":6.3501},{"id":555,"lat":59.4118,"lon":5.4519,"rating":4,"reviews":1,"wait":40,"signal":null,"lastUsed":"2023-07-28","comments":[{"text":"Good spot, decent traffic towards Stavanger, but I guess hitchiking died down a bit nowadays. We were very lucky to get a hitch all the way to Stavanger.","date":"2023-07-28","rating":4}],"destLat":58.9804,"destLon":5.6822},{"id":562,"lat":59.9598,"lon":10.8877,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-07-20","comments":[{"text":"Good spot to stand, good flow of cars,going north got a ride for 70km :)","date":"2023-07-20","rating":4}],"destLat":59.9598,"destLon":10.8877},{"id":566,"lat":58.157,"lon":7.0983,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-07-19","comments":[{"text":"Going towards Oslo: Lots of cars, and they are driving pretty slow. Good space to stop. Got a ride to Grimstad after 15 minutes :)","date":"2023-07-19","rating":4}],"destLat":58.3264,"destLon":8.5872},{"id":567,"lat":59.7423,"lon":10.2288,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-07-16","comments":[{"text":"Not much room to pull over, but i got a ride to asker pretty quickly.","date":"2023-07-16","rating":4}],"destLat":59.7423,"destLon":10.2288},{"id":568,"lat":59.8322,"lon":10.4409,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-07-16","comments":[{"text":"Holding a sign reading Oslo, steadt trafic, I said yes to a ride to sandvika which was a mistake, sandvika is impossible.","date":"2023-07-16","rating":4}],"destLat":59.8322,"destLon":10.4409},{"id":572,"lat":59.5674,"lon":9.2133,"rating":4,"reviews":1,"wait":1,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"I was simply walking with my sign held on my side, trying to get to a spot a bit further down the road, when a driver picked me up and brought me to Rjukan","date":"2023-07-15","rating":4}],"destLat":59.5674,"destLon":9.2133},{"id":574,"lat":59.5695,"lon":9.2907,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"I was offered a ride into town, and also a few hours further west, seems to be a decent spot.","date":"2023-07-15","rating":4}],"destLat":59.5696,"destLon":9.2907},{"id":575,"lat":59.5707,"lon":9.2905,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"Was heading to Oslo but got a ride to drammen instantly","date":"2023-07-15","rating":4}],"destLat":59.5707,"destLon":9.2905},{"id":580,"lat":68.2863,"lon":16.4756,"rating":4,"reviews":1,"wait":90,"signal":null,"lastUsed":"2023-07-10","comments":[{"text":"Summer night 1am, it was not much traffic, but the landscape is amazing and the spot is worth enough","date":"2023-07-10","rating":4}],"destLat":68.2863,"destLon":16.4755},{"id":587,"lat":60.8808,"lon":10.9257,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-07-07","comments":[{"text":"Going to the North, good spot to stand with a small sidewalk, good stream of slow driving cars.\r\ntwo gasstations nearby.","date":"2023-07-07","rating":4}],"destLat":60.8807,"destLon":10.9256},{"id":590,"lat":63.0119,"lon":8.0015,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"Good spot to get the ferry and possibly further","date":"2023-07-01","rating":4}],"destLat":63.0532,"destLon":8.1253},{"id":591,"lat":63.1166,"lon":7.7314,"rating":4,"reviews":1,"wait":1,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"I was walking and I lifted my thumb up at the first car, they stopped and dropped me on a good spot on the main road to Trondheim.","date":"2023-07-01","rating":4}],"destLat":63.0115,"destLon":8.0016},{"id":592,"lat":62.7395,"lon":7.1999,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"Got a direct ride to Kristiansund, you can also easily get Trondheim from here. Better with a sign, people who will go same destination will stop.","date":"2023-07-01","rating":4}],"destLat":63.1087,"destLon":7.7279},{"id":593,"lat":62.6097,"lon":7.0961,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-07-01","comments":[{"text":"Good spot to get the ferry","date":"2023-07-01","rating":4}],"destLat":62.7329,"destLon":7.1611},{"id":595,"lat":59.7487,"lon":10.7815,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-06-29","comments":[{"text":"Lots of people passing by,  we were going to Ås center.","date":"2023-06-29","rating":4}],"destLat":59.7487,"destLon":10.7815},{"id":605,"lat":58.9924,"lon":6.1391,"rating":4,"reviews":1,"wait":8,"signal":null,"lastUsed":"2023-02-16","comments":[{"text":"Just started walking out and the second car to pass stopped. People should have sympathy because it's a steep hill","date":"2023-02-16","rating":4}],"destLat":58.997,"destLon":6.0813},{"id":608,"lat":69.6097,"lon":18.0737,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-01-08","comments":[{"text":"Deep winter, heavy snowstorm, pitch black. After walking 7km from Hillesoy, I started hitchhiking at this junction (direction Tromso) in the middle of nowhere, as I would catch the traffic from Brensholmen as well. Take care, as there are zero lamp posts here. Got a ride after 30min halfway to Tromso! Enjoy the ride! :]","date":"2023-01-08","rating":4}],"destLat":69.6097,"destLon":18.0737},{"id":609,"lat":58.9583,"lon":5.7227,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2022-12-02","comments":[{"text":"Good spot if heading to Pulpit Rock. Nice spot go pull over just before the tunnel.","date":"2022-12-02","rating":4}],"destLat":59.0323,"destLon":5.9316},{"id":150,"lat":61.7753,"lon":9.5446,"rating":3.86,"reviews":7,"wait":39,"signal":"sign","lastUsed":"2025-08-18","comments":[{"text":"Good spot. Plenty of space for the cars to pull over. But they are already accelerating here. Stood with a sign for Oppdal and got a ride to Dombås.","date":"2025-08-18","rating":4},{"text":"OK spot! Some cars go fast, but there is space to stop.","date":"2025-08-08","rating":4},{"text":"Ride to Dombås in 5min. Decent condition.","date":"2025-08-07","rating":4},{"text":"Got a ride quickly, good spot to stand, slow cars :)","date":"2023-07-21","rating":4},{"text":"I didn't get here until late in the evening, so there wasn't that much traffic. I was stopped by one car earlier, but it was only going a short distance. Finally, a truck pulled up. The only better option is to walk and ask at a nearby gas station (I'm not a fan of that, though).","date":"2023-07-10","rating":5}],"destLat":62.0735,"destLon":9.1317},{"id":436,"lat":59.9178,"lon":10.661,"rating":3.82,"reviews":11,"wait":91,"signal":"sign","lastUsed":"2024-08-26","comments":[{"text":"heavy traffic, gas station nearby, also place for pullover","date":"2024-08-26","rating":4},{"text":"Easy accessible but cars are going way to fast and the gas station was barley used (Wednesday around 10) so I left after about an hour.","date":"2023-08-30","rating":2},{"text":"Theres a lot of traffic so you will probably find a ride in the end wherever you will go. The problem is that the cars are first going pretty fast because its just on the highway (so better look for the cars going to the gas station) and second most of them are probably just going to the suburbs. I was lucky after 45 minutes though so cant complain!","date":"2017-10-06","rating":4},{"text":"tried two times for 1 h and 1/2, no way","date":"2016-08-01","rating":4},{"text":"I thought it's better to ask people than standing with a sign, so i did, but most of them were not positive:( eventually 2 guys gave me a ride to Tønsberg, but not too good experience","date":"2016-07-11","rating":4}],"destLat":59.7339,"destLon":10.2149},{"id":27,"lat":67.3004,"lon":14.7386,"rating":3.8,"reviews":5,"wait":34,"signal":"thumb","lastUsed":"2025-10-17","comments":[{"text":"Local people didn't stop, everybody was going home, i waited until a lady from Tunisia passing through… it all depends on luck","date":"2025-07-01","rating":3},{"text":"Ride to Fauske, probably would be better to find some place on the other side of the city…","date":"2024-09-02","rating":4},{"text":"Bus stop and cars don´t go very fast. You can go to the E6 from there, or with some luck to road 17.","date":"2015-07-14","rating":4}],"destLat":67.259,"destLon":15.3946},{"id":139,"lat":59.9309,"lon":10.8684,"rating":3.75,"reviews":12,"wait":46,"signal":"ask","lastUsed":"2025-08-23","comments":[{"text":"There were no trucks","date":"2025-08-23","rating":3},{"text":"Not a bad spot, plenty of cars, but most of them going short distance. Still, it's on the main road north towards Hamar and you can get there easily by public transport (stop Trosterudkrysset).","date":"2025-08-17","rating":4},{"text":"Arrive here by bus to go north. I instantly thought it was not ideal place so i look for a way to avoid E6, it seems that there is some good spot on the n°4 highway, accessible by public transport.\r\n\r\nBut after 5min a truck stop going to jessheim. So at the end maybe not that bad :)","date":"2025-08-04","rating":4},{"text":"One male 40+, no sign, one big and one small backpacks, sunny and warm day. Going to Otta.\r\nNot too good spot. But I guess there are not many better ones in Oslo. You can't really catch cars on the highway. No place to stop and they go too fast. So you'd be left only with the cars leaving the petrol station. But the traffic isn't that small. I was wearing a t-shirt with a big Polish emblem. A Polish guy stopped to talk to me, saying that he doesn't go too far. I asked him to take me 15 kms up no","date":"2025-05-16","rating":3},{"text":"Got offered rides in various directions, mostly local. Wanted to go north although was standing with a sign to Dombås which is a small city so people didn't recognize it. \r\n\r\nGot better results using thumb and asking people around. I got bored a little bit so took a ride to Skedsmokorset","date":"2024-01-01","rating":4}],"destLat":60.078,"destLon":11.1524},{"id":31,"lat":68.142,"lon":13.605,"rating":3.75,"reviews":4,"wait":6,"signal":"thumb","lastUsed":"2025-10-17","comments":[{"text":"A family from German picked me up, not very big space for car to pull over","date":"2025-07-01","rating":4},{"text":"There is not much space, but enough…","date":"2024-09-01","rating":4},{"text":"Very little space for cars to stop right after the roundabout, but some nice fellas stopped for me after 2 minutes and took me cca 5 km west outside the city, there was a much better spot for cars to stop.","date":"2023-08-06","rating":3}],"destLat":68.1027,"destLon":13.2942},{"id":75,"lat":60.879,"lon":6.8429,"rating":3.75,"reviews":4,"wait":60,"signal":null,"lastUsed":"2025-09-13","comments":[{"text":"Waited 1hour... And picked up by a metal singer quite reknown\r\nGood place for a break with view on the fjord. From the HH point, look up, to the nice waterfalls\r\nGood luck","date":"2025-09-13","rating":3},{"text":"Look which side cars come to gas station and ask the drivers. I wait 15 min. to get ride to Aurland","date":"2014-07-17","rating":4},{"text":"boat ride is beautiful!:) i hh to Bergen and it was fine","date":"2011-09-07","rating":4},{"text":"Petrol station. Good spot for hitching to Oslo, a lot of tourist passing. Take beautiful boat ride from Flam to Godvangen, it is so good! Than hitch to Oslo (Took us 8 hours to get there).","date":null,"rating":4}],"destLat":60.3737,"destLon":5.3357},{"id":140,"lat":71.122,"lon":25.7077,"rating":3.75,"reviews":4,"wait":60,"signal":null,"lastUsed":"2025-08-23","comments":[{"text":"Edit: in August, after 11am it's dead\r\nSo take care about your hike to the north of north, it takes at least 4h, if you don't count the fact that the path could be a bog, and the time to enjoy the feeling of the north","date":"2025-08-23","rating":3},{"text":"Here is the place to hike to the real North Cape\r\nThen it's not hard to go back, there are few cars but don't worry","date":"2025-08-22","rating":4},{"text":"If you hike the trail to Kvinskjdollen, it's quite easy to get a ride back, at least to Honningsvån, even in bad weather.","date":"2016-07-15","rating":4}],"destLat":null,"destLon":null},{"id":604,"lat":58.814,"lon":5.7675,"rating":3.75,"reviews":4,"wait":40,"signal":null,"lastUsed":"2023-02-16","comments":[{"text":"Fast traffic and may be difficult for cars to stop for you. Someone pulled in slightly further up after seeing me and wave me over, got an awesome ride all the way to Kristansand","date":"2023-02-16","rating":3},{"text":"Bus stop for hitching south. A bit too much traffic for my taste, though. This might be your spot if you want to hitch from Stavanger or Sandnes southwards. If you're leaving Stavanger you may need to take a bus or train Sandnes and then walk to here (5 km from the centre. Fares are expensive but you can often get away without a ticket especially by bus.","date":"2016-08-06","rating":4}],"destLat":58.1381,"destLon":8.0035},{"id":16,"lat":60.0533,"lon":6.5566,"rating":3.67,"reviews":6,"wait":40,"signal":"thumb","lastUsed":"2026-01-02","comments":[{"text":"It's a bus stop, enough place, just wait with patience!! A nice polish man brought me to Porsgrunn!","date":"2025-07-01","rating":3},{"text":"No cars stopped","date":"2025-05-29","rating":1},{"text":"nice belgian man took us in his van, we rode with him 1.5h","date":"2023-03-02","rating":4},{"text":"Great spot just on the bus spot","date":"2023-02-16","rating":5}],"destLat":59.9356,"destLon":6.5878},{"id":146,"lat":61.7713,"lon":9.5354,"rating":3.67,"reviews":3,"wait":30,"signal":"thumb","lastUsed":"2025-08-20","comments":[{"text":"I was waiting there in the morning when there were not so many cars but after half hour I catch a car to Lom","date":"2025-08-20","rating":5},{"text":"Stand in the green space between the lanes, there´s no space for you on the right side of the road.","date":"2015-09-16","rating":3},{"text":"Not easy to stop, but we caught a ride to Vagamo within 20 minutes.","date":"2015-08-17","rating":3}],"destLat":61.8379,"destLon":8.5693},{"id":238,"lat":58.1436,"lon":7.9808,"rating":3.67,"reviews":3,"wait":27,"signal":"thumb","lastUsed":"2025-08-02","comments":[{"text":"An older lady took me to Lindenes fyr and then back to the main road to Stavanger.","date":"2025-08-02","rating":5},{"text":"took quite some time to get a ride to Mandal, but its a nice spot with a busstop for cars to pull over","date":"2011-02-06","rating":3}],"destLat":58.1583,"destLon":7.0722},{"id":241,"lat":58.1448,"lon":7.8866,"rating":3.67,"reviews":3,"wait":20,"signal":null,"lastUsed":"2025-08-01","comments":[{"text":"Its not that good","date":"2025-08-01","rating":1},{"text":"a perfect spot to Stavanger. Honestly I don't find on the map where it is exactly, but somewhere here. If you come form Kristiansand, take the bus 40 from the Centrum and get off the stop called Mjåvann, and stay in the busstop. It't just perfect. Good traffic, place for cars to stop etc. I waited 2 minutes and got a direct ride to Stavanger. Be avare that the bus 40 runs once in an hour or weekends even less times. Check for the bus schedule: http://agder.websrv02.reiseinfo.no/AgderIISSTaticTab","date":"2012-06-12","rating":5}],"destLat":null,"destLon":null},{"id":318,"lat":61.2319,"lon":7.1156,"rating":3.67,"reviews":3,"wait":60,"signal":"thumb","lastUsed":"2025-06-30","comments":[{"text":"Many traffic, late afternoon, everybody was heading home after work but nobody stopped, waited one hour until a Norwegian lady brought me to the ferry!","date":"2025-06-30","rating":3},{"text":"Good spot for getting to Oslo, Førde and deeper into Sogn og fjordene.","date":"2012-05-07","rating":4}],"destLat":61.1603,"destLon":7.3369},{"id":497,"lat":69.6479,"lon":18.986,"rating":3.67,"reviews":3,"wait":2,"signal":null,"lastUsed":"2023-11-07","comments":[{"text":"Waited less than 5 minutes, lots of traffic and enough space for the cars to stop","date":"2023-11-07","rating":5},{"text":"mostly local traffic","date":"2014-08-14","rating":3},{"text":"Bus stop right after the traffic lights","date":"2014-08-14","rating":3}],"destLat":69.2152,"destLon":19.5575},{"id":569,"lat":59.6709,"lon":9.6546,"rating":3.67,"reviews":3,"wait":90,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"Far too much local trafic. I got nothing  and waited at least 90 minutes","date":"2023-07-15","rating":1},{"text":"A bus stop. Going West towards Notodden/Bergen. Is between two round-about so cars are going slow. And a gas station behind. I had with skies and a big backpack and it to 10 min to get a hike.","date":"2016-06-15","rating":5}],"destLat":59.6709,"destLon":9.6546},{"id":570,"lat":59.667,"lon":9.6436,"rating":3.67,"reviews":3,"wait":37,"signal":null,"lastUsed":"2023-07-15","comments":[{"text":"I think there was too much local traffic here, i only got one offer to go a short distance.","date":"2023-07-15","rating":1},{"text":"nice place to hitchhike to odda. straight road with a bus stop. many cars on this road.","date":"2013-09-20","rating":5}],"destLat":59.6668,"destLon":9.6437},{"id":62,"lat":59.9973,"lon":11.0399,"rating":3.6,"reviews":5,"wait":88,"signal":"ask","lastUsed":"2025-10-02","comments":[{"text":"Way too fast from the highway, not very visible though a good place to stop. Had to buy a truck driver a drink to get a ride to someplace better","date":"2025-10-02","rating":1},{"text":"Afternoon, waiting time 80 mins, a 109km ride to Hamar, but I jumped off at a gaz station 20 km before Hamar, which is the best decision when you head up to Trondheim.\r\nAs I always say about this Shell Gaz station - be patient and friendly filter out short local rides if you go far north.","date":"2024-05-18","rating":5},{"text":"I love this Gas station, many cars stop there. I used a sign and my thumb. You should filter out short distance rides, just be patient and wait for a longer ride.\r\nHeading to Trondheim, waiting time 30 mins, a 266 km ride to Otta.","date":"2024-04-01","rating":5},{"text":"The traffic was quite high despite the Christmas period. Got offered rides to the airport. After 2 hours of waiting got a ride to Lilllehammer","date":"2024-01-01","rating":4},{"text":"Arrived in August late on a saturday evening, 7PM. Tried for two hours for a ride north to Dal or Espa, then gave up and took a ride to the airport. Frequency was low. I talked to people.","date":"2023-08-07","rating":3}],"destLat":60.166,"destLon":11.157},{"id":23,"lat":68.4436,"lon":17.4504,"rating":3.5,"reviews":6,"wait":90,"signal":"thumb","lastUsed":"2025-10-18","comments":[{"text":"A couple people who couldnt see the sign properly pulled over, but then weren't going to Tromsø. Most people ignored. You might have more luck hitching to the road junction further North then hitching again across to Tromsø. The bus to Tromsø does stop here, so it's a good spot to attempt if you've got nothing else to do.","date":"2025-10-18","rating":4},{"text":"No-one stopped people didn't seem nice. A lady in a van got me back to the station where there was an emergency bus going to absiko since there was a snow storm","date":"2025-07-19","rating":2},{"text":"A lot of traffic, need to wait a while tho","date":"2024-08-07","rating":4},{"text":"You are visible here from a decent distance and drivers have a bit more time to make a decision.\r\nNote that there are no reasonable spots after this one if you want get north over the bridge","date":"2024-02-12","rating":4},{"text":"Dir: north, summer \r\nSeems like a good spot, waited two hours with no one stopping so I just took the last bus to tromsø. Although I did start at 2pm, would probably have better luck earlier.","date":"2023-08-01","rating":2}],"destLat":68.4415,"destLon":17.441},{"id":64,"lat":69.1332,"lon":18.5832,"rating":3.5,"reviews":4,"wait":14,"signal":null,"lastUsed":"2025-09-29","comments":[{"text":"2025 UPDATE: It's now an awefull spot. \r\n\r\nI believe they rebuild the road and there is no place to pull over anymore. \r\n\r\n\r\nIt will eventually work thought, got a ride to Tromsø in 25\". Staying  in the middle of the crossroad is an option, safer, but you get only the ppl coming from senja the.","date":"2025-09-29","rating":2},{"text":"We only waited 10 mins for a ride to Tromsø. Try on the road and asking people in the gas station.","date":"2016-06-30","rating":4},{"text":"Dir: South. Some cars pass by here, easy to pull over or to ask people in the gass station.","date":"2016-03-29","rating":4},{"text":"Dir: North. At least in the winter there is not a lot of room for cars to stop, but they do anyway. There is a gas station on 855.","date":"2007-04-10","rating":4}],"destLat":69.6698,"destLon":19.0215},{"id":66,"lat":68.2313,"lon":16.2376,"rating":3.5,"reviews":2,"wait":40,"signal":null,"lastUsed":"2025-09-29","comments":[{"text":"Good sum up from the previous Hitchhiker: good if you can ask on the ferry, i did, 3 ppl refuse, at the end i stand at the exit fro classic method and got a ride to Narvik.","date":"2025-09-29","rating":4},{"text":"Dir: north, summer.\r\nI made the mistake of not asking for rides on the ferry. All traffic has to come through the ferry, meaning you have a shot at one boatload of cars every 45 mins. I got lucky and got a ride to Narvik, from the first ferry that came.","date":"2023-09-01","rating":3}],"destLat":68.4347,"destLon":17.4403},{"id":201,"lat":61.6249,"lon":8.4035,"rating":3.5,"reviews":2,"wait":18,"signal":"ask","lastUsed":"2025-08-07","comments":[{"text":"There is a cycle of person arrriving and leaving here. I don't know what's the best time, but i was there at 6pm and noone was leaving the place. \r\n\r\nMaybe 4 / 5pm is good, when people finish Galdopingen.","date":"2025-08-07","rating":3},{"text":"2022-07-15 to 2022-07-16","date":"2024-11-03","rating":4}],"destLat":61.8111,"destLon":8.9419},{"id":224,"lat":60.6263,"lon":5.4733,"rating":3.5,"reviews":2,"wait":23,"signal":"ask","lastUsed":"2025-08-04","comments":[{"text":"For me it was a good spot. Plenty of people stopping there and a man took me as far north as he was driving before he turned into his village.","date":"2025-08-04","rating":5},{"text":"Not a good spot at 7 am, lots of cars coming here are just going to shop and then back to the city. This gas station doesn’t seem to be used a lot by cars going up north","date":"2025-03-15","rating":2}],"destLat":60.7397,"destLon":5.6331},{"id":476,"lat":59.9174,"lon":10.6597,"rating":3.5,"reviews":2,"wait":40,"signal":"sign","lastUsed":"2024-06-11","comments":[{"text":"Sign : Drammen\r\n\r\nTo Drammen\r\n\r\nMost of the people are going to the suburbs","date":"2024-06-11","rating":4},{"text":"I waited for at least an hour at the entrance to the gas station, but standing on this triangle at the exit got me a ride west fairly quickly","date":"2023-07-15","rating":3}],"destLat":59.7328,"destLon":10.2125},{"id":324,"lat":58.1624,"lon":8.0257,"rating":3.33,"reviews":3,"wait":27,"signal":"thumb","lastUsed":"2025-06-01","comments":[{"text":"tried for 30min. many cars but no one stopped. took the train in the end","date":"2025-06-01","rating":2},{"text":"Going to Larvik, it was a bus stop and lots of people passing by","date":"2023-06-28","rating":5}],"destLat":58.1623,"destLon":8.0258},{"id":359,"lat":64.5592,"lon":12.485,"rating":3.33,"reviews":3,"wait":5,"signal":null,"lastUsed":"2025-03-24","comments":[{"text":"Excellent spot, asked the basically only car there and he brought me over 3 hours up north (which was a very nice change considering how many cars I took to barely get halfway to Bodø). If you’re not that lucky you might have to wait a lot longer as there’s basically no cars","date":"2025-03-24","rating":4},{"text":"This a tiny town with nothing going on. Very light traffic, so we got stuck there for two days... BUT the gas station employees gave us food, the dumpster behind the store are full of food and there's a nice park you camp in and no one will bother you :)","date":"2016-06-21","rating":3}],"destLat":null,"destLon":null},{"id":418,"lat":67.4357,"lon":15.7174,"rating":3.33,"reviews":3,"wait":15,"signal":null,"lastUsed":"2024-09-03","comments":[{"text":"There were not many cars in September, people going back mainly in the late afternoon. Maybe there are better chances on the main road.","date":"2024-09-03","rating":2},{"text":"The mountain trail starts here. Traffic is not intense (a car every 10-15 minutes)","date":"2014-08-02","rating":4}],"destLat":null,"destLon":null},{"id":494,"lat":62.068,"lon":9.1225,"rating":3.33,"reviews":3,"wait":50,"signal":null,"lastUsed":"2024-01-01","comments":[{"text":"The spot is a decent alternative when it's dark outside and no traffic at the gas station if someone is heading north. There is a lamp and a place where cars can easily pull over. The only issue is that cars go downhill so the driver doesn't have time to react after spotting you.\r\n\r\nIt was 6 am, during winter, dark outside and traffic was very low. Got a ride after 15 minutes of waiting to Berkåk although the driver had to turn back for me as he didn't have time to react in time.","date":"2024-01-01","rating":2},{"text":"Stood here for an hour going south to Oslo. A good spot going by an old gas station. So was just unlucky it took so long i think.","date":"2016-07-03","rating":4},{"text":"I stay here without sign and get ride to Lillehammer for 10 min.","date":"2014-07-17","rating":4}],"destLat":62.8289,"destLon":10.0103},{"id":524,"lat":63.4754,"lon":10.9039,"rating":3.33,"reviews":3,"wait":23,"signal":null,"lastUsed":"2023-08-14","comments":[{"text":"Not a good place, there's not anymore place to pull over. We had luck, when we were going to the southern roundabout, a couple picked us up to Åsen on a random street. The comment from 2013 was right, not a good spot anymore. You could try your chance in the gas stations nearby.","date":"2023-08-14","rating":2},{"text":"Direction: north\n\nI hitchhiked from here and it was pretty ok. There was a lot of space to pull out. But that's probably going to change soon as they are building new road there.","date":"2013-03-27","rating":4}],"destLat":63.6098,"destLon":11.0507},{"id":407,"lat":60.0801,"lon":11.1512,"rating":3.25,"reviews":4,"wait":8,"signal":"thumb","lastUsed":"2024-11-03","comments":[{"text":"2022-07-14","date":"2024-11-03","rating":1},{"text":"2022-07-14","date":"2024-11-03","rating":2},{"text":"this map might be old, because there is a slip-road to the E6 highway that goes north. so go there and a car will stop in no time.","date":"2011-01-27","rating":5}],"destLat":60.1455,"destLon":11.1509},{"id":409,"lat":59.9352,"lon":6.5882,"rating":3.25,"reviews":4,"wait":73,"signal":"sign","lastUsed":"2024-10-02","comments":[{"text":"Good place with plenty of space to stop, but had to wait for a while.","date":"2024-10-02","rating":4},{"text":"I asked the store owner for some free food. He´s a kinds guy a gave me some bread an chease","date":"2019-07-10","rating":3},{"text":"Waited here for a long time, most of the cars are families With full cars, finaly two ladies stopped after more than 2 hours","date":"2017-08-01","rating":3},{"text":"big empty parking lot in front of a little store. still took me a while to get a ride to the nearby odda... anxious locals","date":"2011-02-06","rating":3}],"destLat":60.0549,"destLon":6.5544}]}