{"country":"OM","name":"Oman","totalSpots":5,"totalReviews":6,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":5,"lat":23.5716,"lon":58.4251,"rating":5,"reviews":2,"wait":15,"signal":null,"lastUsed":"2018-05-07","comments":[{"text":"I was standing a couple of meters right after the slip road coming from the West, without using any cardboard.. Muscat is full of Taxis, so one or two of them might approach you before you will get your free lift. I waited once 10 minutes and the second time around 15 minutes for a ride to Al Amirat. A good spot with heavy traffic probably during the whole day.","date":"2018-05-07","rating":5},{"text":"The best place to get to south, not expected more than 20 minutes","date":"2015-01-12","rating":5}],"destLat":null,"destLon":null},{"id":2,"lat":23.0788,"lon":57.5045,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-02-24","comments":[{"text":"Basically no cars, but the first one stopped! Super kind people who took me to the dam. Very basic English but happy to communicate through gestures and laughter.","date":"2025-02-24","rating":5}],"destLat":23.0585,"destLon":57.4685},{"id":3,"lat":23.0602,"lon":57.4682,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-02-24","comments":[{"text":"First car stopped. Decent English. Epic back of the pickup truck ride to the tiny village at the end of the wadi road.","date":"2025-02-24","rating":5}],"destLat":23.0821,"destLon":57.5077},{"id":1,"lat":23.2166,"lon":56.5137,"rating":3,"reviews":1,"wait":60,"signal":"sign","lastUsed":"2025-02-24","comments":[{"text":"Stood here for 60 mins with a sign to dubai. Big space to pull over behind me, just at the end of the crash barrier. A few taxis stopped (they're all orange in oman so easy to identify, but a simple la, shookran. was all that was needed for them to leave me alone). Lots of traffic (much of it internal) and bright sunlight, lots of false starts as people stopped but then were only going to the shops, so that meant it wasn't the most pleasant wait, but eventually a legend pulled over and took me t","date":"2025-02-24","rating":3}],"destLat":24.1129,"destLon":55.8267},{"id":4,"lat":24.0082,"lon":55.8459,"rating":1,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-02-24","comments":[{"text":"Just walking along the road after the border crossing a kind Omani dude had seen me cross and waited for me, and offered me a ride all the way to nizwa!! Completely unsolicited, he basically hitchiked me, was really kind and spoke perfect english. Amazing!! Why is this spot only 1 star then? The border crossing is closed to people without a car for no apparent reason. Same for the other al ain forighner border crossing (and the two in central Al ain are not for forighners). I only managed to get","date":"2025-02-24","rating":1}],"destLat":22.8602,"destLon":57.539}]}