{"country":"PH","name":"Philippines","totalSpots":36,"totalReviews":38,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":4,"lat":14.9445,"lon":120.0821,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2026-02-08","comments":[{"text":"Plej bona loko por iri en Pundakit, eĉ nokte, ulo el Germanio veturigis nin tien je pli ol 100 km/h.","date":"2026-02-08","rating":5}],"destLat":14.9214,"destLon":120.0648},{"id":15,"lat":16.3853,"lon":119.8923,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"Bona loko por petveturi en la direkto de PATAR. Malfrua posttagmezo kaj haltis al ni malgranda kamiono.","date":"2026-02-07","rating":5}],"destLat":16.3568,"destLon":119.8577},{"id":16,"lat":16.3566,"lon":119.8547,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2026-02-07","comments":[{"text":"Eĉ dum la frua vespero estas sufiĉe da trafiko iranta almenaŭ ĝis Patar. Ĉi-foje ili iris al malgranda festo kaj portis diversajn manĝetojn en la malantaŭo de la ŝarĝaŭto; evidente ni ne manĝis pro respekto, kaj ili ankaŭ ne estis veganaj aŭ keto-dietaj. La ŝoforoj estis prakuzoj de la posedanto de la kampadejo kie ni loĝas, kie ni pagas 400 por nokto, po 200. La antaŭan tagon, ĉirkaŭ la sama tempo, motorciklo kaj kamioneto ankaŭ haltis por ni. Sed ni preferis promeni.\r\nNi ankaŭ aŭdis pri kelkaj","date":"2026-02-07","rating":5}],"destLat":16.3542,"destLon":119.8116},{"id":17,"lat":16.3464,"lon":119.8028,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"Post malfrua alveno ĉe la enirejo de la feriejo Enchanted Cave, ĉar ĝi fermiĝas je la 5a posttagmeze, ni veturis al 7-Eleven por aĉeti kelkajn manĝetaĵojn kaj ĝui la riveron Balingasay.","date":"2026-02-07","rating":5}],"destLat":16.3569,"destLon":119.8579},{"id":18,"lat":15.2624,"lon":120.5587,"rating":5,"reviews":1,"wait":2,"signal":"thumb","lastUsed":"2026-02-04","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way to Angeles. \r\nI was actually waiting for a jeepney (a local mini bus). But there was so much space to stop before the bridge, that is would be a crime not to try. So while waiting I put a thumb up and 2 minutes later a got a ride. The driver actually dropped me where I needed in the city.","date":"2026-02-04","rating":5}],"destLat":15.1621,"destLon":120.609},{"id":19,"lat":15.8708,"lon":120.6031,"rating":5,"reviews":1,"wait":25,"signal":"thumb","lastUsed":"2026-02-04","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way to Angeles.\r\nLoads of space to stop. Busy traffic, but not supern bus. Just before entr to the expressway. So you can catch people going trough it or the highway. After 25 minutes I got a lift to Tarlac.\r\nBut 10 minutes before, one biker was trying to give me money for s bus. Not everyone understands the hitchhiking concept. But there is enough drivers to make it work.","date":"2026-02-04","rating":5}],"destLat":15.4307,"destLon":120.598},{"id":21,"lat":15.908,"lon":120.576,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2026-02-04","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. \r\nA good space with loads of room to stop. At the exit of petrol station. Very little traffic (considering it's the Philippines).","date":"2026-02-04","rating":5}],"destLat":15.9157,"destLon":120.4579},{"id":22,"lat":15.7694,"lon":120.5944,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2026-02-04","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from this town to a Malasiqui.\r\nI was waiting at a bus stop (a rare sight in the Philippines) for a bus. But I decided to give it a go with my thumb up. Within 5 minutes I had a ride to Carmen Rosales bus terminal. A short but useful ride for me.\r\nQuite busy traffic.","date":"2026-02-04","rating":5}],"destLat":15.8788,"destLon":120.6007},{"id":24,"lat":16.5193,"lon":120.33,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-02-03","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Laoag to a bit before Tarlac City.\r\nSan Fernando didn't want to finish, so it took me a long distance to find a spot. Just before the bridge there is some space with good visibility. Quite big traffic.\r\nAfter 15 minutes I had a lift to a place just past Rosario.","date":"2026-02-03","rating":5}],"destLat":16.1957,"destLon":120.515},{"id":25,"lat":18.1696,"lon":120.5559,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2026-02-02","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Laoag to a bit before Tarlac City.\r\nA good place. Loads of room to stop. Not too heavy traffic.\r\nAfter 10 minutes I had a lift to Vigan.","date":"2026-02-02","rating":5}],"destLat":17.5818,"destLon":120.388},{"id":27,"lat":17.5991,"lon":120.3919,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-02-02","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Baguio to Laoag.\r\nEnoug space to stop. But quite busy traffic. Loads of motorbikes and tricycles separating you from cars going usually on the inner line. But in the end it was one of the tricycles who stopped and a nice family game me just over 20 kms ride.","date":"2026-02-02","rating":5}],"destLat":17.7468,"destLon":120.4577},{"id":28,"lat":16.641,"lon":120.335,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-02-02","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Baguio to Laoag.\r\nTraffic significantly smaller compering to the city knet. I was standing just before a little bridge. There was a place to stop, coz a small road was joining the main road.\r\nIn about 15 minutes I got a lift, by one man to Vigan.","date":"2026-02-02","rating":5}],"destLat":17.5818,"destLon":120.3884},{"id":29,"lat":16.523,"lon":120.353,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2026-02-01","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Baguio to Laoag.\r\nI got a lift to San Fernando. A nice couple dropped me on the other end of city doing a couple extra miles.\r\nThe place was so so, just enough space to pull over. Quite busy traffic.\r\nA few hundred meters before I was trying my luck for 20 minutes. And even though the place was better (more space to o stop, better visibility), I didn't get lucky.","date":"2026-02-01","rating":5}],"destLat":16.6255,"destLon":120.3241},{"id":30,"lat":16.4277,"lon":120.5499,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2026-02-01","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. Going from Baguio to Laoag.\r\nIt's not an exact place. I'm not sure where it was exactly, coz I was walking to the spot, eating breakfast, when a driver pulled over, opened a window and asked where I was heading to.","date":"2026-02-01","rating":5}],"destLat":16.5311,"destLon":120.3941},{"id":34,"lat":10.2724,"lon":123.9457,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2024-02-26","comments":[{"text":"First car stopped, super easy. There was a guard but he just told me to stand a little further out the road.","date":"2024-02-26","rating":5}],"destLat":10.2843,"destLon":123.8808},{"id":31,"lat":7.0664,"lon":125.6031,"rating":4.5,"reviews":2,"wait":13,"signal":null,"lastUsed":"2025-11-26","comments":[{"text":"Despite the long distance, was able to quickly get a ride , even treated us with coffee along the way,","date":"2025-11-26","rating":5},{"text":"Very good starting hitch spot for if you are planning to go north or south of Davao.","date":"2025-11-26","rating":4}],"destLat":6.1977,"destLon":125.0816},{"id":2,"lat":14.6576,"lon":121.0012,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Sekvante la instrukciojn sur ĉi tiu mapo, sed adaptante ĝin al la nuna realo de la vojo, eĉ en malbona tempo pro densa trafiko, ni rapide sukcesis trovi veturon al la sekva benzinstacio kun ŝildo por benzinstacio. Domaĝe, ke ni ne sciis, ke ili alproksimiĝus al ni tie kaj vokus la ŝosepatrolon por forigi nin. Se vi iras al benzinstacio sur la ĉefstrato, petveturu strategie, alproksimiĝante al homoj kaj eble sen ŝildo, almenaŭ ĝis la sekva grava enirejo aŭ elirejo al la aŭtovojo. La administranto","date":"2026-02-08","rating":4}],"destLat":14.7634,"destLon":120.9636},{"id":5,"lat":14.9227,"lon":120.0652,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Mi kredas, ke ĉi tie estas la plej bona loko por petveturi post Pundakit, sed ie ajn taŭgus.","date":"2026-02-08","rating":4}],"destLat":14.9482,"destLon":120.0891},{"id":6,"lat":14.92,"lon":120.0643,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Unua rajdo de la tago direkte al la Bolinao-Akvofaloj.\r\nMi, Mushky, kaj Daniela, la poneo. Ni forlasis la domon de Pugi, kie ni kampadis, atingis la vojon, iom marŝis, kaj komencis petveturi preskaŭ antaŭ la lernejo.","date":"2026-02-08","rating":4}],"destLat":14.9483,"destLon":120.089},{"id":7,"lat":14.9527,"lon":120.0889,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Dua veturo de la tago direktiĝante al la Bolinao-Akvofaloj.\r\nAntaŭ merkato post la benzinstacio, sed ĝi ankaŭ funkcius ĉe la benzinstacio.","date":"2026-02-08","rating":4}],"destLat":15.0124,"destLon":120.08},{"id":8,"lat":15.0123,"lon":120.0799,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Iom post iom ni forlasis la regionon San Antonio Zambales por alveni en Bulinao en Pangansinano.\r\n\r\nLa tago estis varmega, sed ĉarma.","date":"2026-02-08","rating":4}],"destLat":15.0551,"destLon":120.0716},{"id":9,"lat":15.055,"lon":120.0715,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Jen ni ricevis nian lastan veturon, kaj de ĉi tie ni foriris kun vere simpatia kamionisto. Lia nomo estis Longhararo. Tre ŝika. Mia amikino multe suferis pro la varmo, ĉar ŝi ne kutimis al ĝi, sed estis bonege.","date":"2026-02-08","rating":4}],"destLat":15.1575,"destLon":120.0553},{"id":10,"lat":15.1562,"lon":120.0548,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"Nia bonŝanco estis, ke krom kamionoj forlasantaj ĉi tiun straton, kaj ni amikiĝis kun la kamionistoj, ankaŭ estis vojlaboroj, kiuj kaŭzis, ke aŭtoj preterpasis pli malrapide. Do ni sukcesis akiri vere bonan veturon al Iba, kaj la ulo eĉ ofertis al ni lokon por tranokti kaj ĉion en la montoj, sed ni preferis daŭrigi al Bulinao-Akvofaloj.","date":"2026-02-07","rating":4}],"destLat":15.3311,"destLon":119.978},{"id":11,"lat":15.331,"lon":119.9779,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"Iba estas tre okupata, precipe malfrue posttagmeze, kio malfaciligas trovi iun, kiu povas halti pro la grandega trafikkvanto, sed tamen eblas halti.","date":"2026-02-07","rating":4}],"destLat":15.3421,"destLon":119.9697},{"id":12,"lat":15.3437,"lon":119.9696,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"La areo estis sufiĉe okupata, sed estis facile halti. Ni petis iri al la sekva urbo, sed ni ne komprenis, ke ni povus fari kromvojon al Palauing, kiu estas apud la aŭtovojo. Tio malfaciligis la petveturadon, ĉar fariĝis mallume.","date":"2026-02-07","rating":4}],"destLat":15.4338,"destLon":119.9126},{"id":13,"lat":15.7656,"lon":119.9099,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2026-02-07","comments":[{"text":"Ni havis ŝildon por Burgoso antaŭ la busstacidomo, se ni ne povus alveni tien, almenaŭ ni povus kapti la lastan buson al Alaminos. Ni jam estis lacaj kaj estis malfrue, sed tamen, kamiono haltis por ni irante al Alaminos, eĉ post kiam familio preskaŭ proponis al ni veturon al Burgoso nur por helpi nin, kion ni rifuzis.\r\n\r\nTamen, pli bona loko estus ĉe la elirejo de Santa Cruz, tuj post la kurbo. Sed je ĉi tiu horo, la homoj, kiuj preterpasis, insistis, ke ni iru al la busstacidomo por sekureco, ","date":"2026-02-07","rating":4}],"destLat":16.1457,"destLon":119.9893},{"id":14,"lat":16.277,"lon":119.8782,"rating":4,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2026-02-07","comments":[{"text":"Post alveno al ĉi tiu loko je la tria horo matene kaj kampadado apud la rivero en paŝtejo, ni vekiĝis ĉirkaŭ tagmezo kaj trovis Renalyn, kiu poste gastigos nin en sia domo. Ŝi estis surprizita de nia ĉeesto kaj proponis al ni lokon por iom ripozi antaŭ ol pluiri petveturante.\r\n\r\nNi estis tre bonŝancaj, ĉar ni baldaŭ trovis veturigilon ĉe la nevino de la posedanto de Bulinao Falls 2, kiu gastigis nin senpage dum kelkaj tagoj tre proksime al la akvofalo.","date":"2026-02-07","rating":4}],"destLat":16.3088,"destLon":119.8642},{"id":20,"lat":15.9147,"lon":120.4572,"rating":4,"reviews":1,"wait":35,"signal":"thumb","lastUsed":"2026-02-04","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from here to Angeles.\r\nA good spot. Loads of space to stop, tragic not too heavy, and a pole giving some shade.\r\nA bit longer waiting than usually in the country. And quite few people trying to show me where a bus is. But in the end I got a ride to Carmen/Rosales bus terminal.","date":"2026-02-04","rating":4}],"destLat":15.8788,"destLon":120.6008},{"id":26,"lat":17.7526,"lon":120.4568,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2026-02-02","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Baguio to Laoag.\r\nThere was a place to stop. But it was still town. Lucky the traffic wasn't too busy. After 20 minutes a small lorry stopped, a two guys gave me a lift all the way to Laoag, where I arrived just before the sunset.","date":"2026-02-02","rating":4}],"destLat":18.1851,"destLon":120.5668},{"id":32,"lat":7.0176,"lon":125.4929,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-11-26","comments":[{"text":"Hit or miss, better aim for vehicles with open areas, like pickup trucks, or cargo trucks. Good spot to hitch if you are going south.","date":"2025-11-26","rating":4}],"destLat":6.7601,"destLon":125.3745},{"id":33,"lat":11.2197,"lon":124.3973,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-06-26","comments":[{"text":"good spot for hitchiking, close to the port where we get from cebu island - bogo","date":"2025-06-26","rating":4}],"destLat":11.2121,"destLon":125.0189},{"id":35,"lat":10.3314,"lon":123.8985,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-02-26","comments":[{"text":"Pretty good spot, a little up the hill there's more space for cars to stop.","date":"2024-02-26","rating":4}],"destLat":10.3794,"destLon":123.8727},{"id":36,"lat":14.6631,"lon":121.0005,"rating":3,"reviews":2,"wait":5,"signal":null,"lastUsed":"2014-08-04","comments":[{"text":"From Balintawak Station go down the clover intersection and walk pass the first road going right. Be careful as the traffic is dense and fast, also there are sometimes police under the bridge. Once you are there, people will stop for the crazy foreigner. Maybe you might have to wait long if the traffic is extra fast. In any case, be very very careful as the safety lane is narrow and there is a wall on the side of the road.","date":"2014-08-04","rating":3}],"destLat":null,"destLon":null},{"id":3,"lat":14.9514,"lon":120.7588,"rating":3,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2026-02-08","comments":[{"text":"Eĉ malfrue nokte ni sukcesis trovi veturon al San Fernando, kio multe helpis nin, ĉar ni povis trovi transporton al Pundakit de tie. La ulo flirtis kun Muŝki, malgraŭ ke li deklaras sin kristano.","date":"2026-02-08","rating":3}],"destLat":15.0399,"destLon":120.682},{"id":1,"lat":14.7651,"lon":120.9627,"rating":1,"reviews":1,"wait":125,"signal":"thumb","lastUsed":"2026-02-08","comments":[{"text":"La benzinstacio ŝajnis tre promesplena, sed reale, kiam ni alvenis ĉe la elirejo, la estro alproksimiĝis al ni kaj malhelpis nin akiri veturon, insistante pri alvoko de la polica patrolo. Ili nur kondukis nin al alia vojo, iom pli antaŭen, kaj tio estis malfrue nokte. Eĉ antaŭ tio, homoj ĉe la benzinstacio proponis al ni veturojn al Malolos, kio estus multe pli bona se ni scius, kio atendis nin. Do, ĉe benzinstacioj sur la Aŭtovojo en Filipinoj, temas plejparte pri bonŝanco. Ni ne provis aliajn ","date":"2026-02-08","rating":1}],"destLat":14.8282,"destLon":120.8756},{"id":23,"lat":16.1871,"lon":120.5148,"rating":1,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2026-02-03","comments":[{"text":"One male 40+, no sign, one big and one small backpacks, sunny day. On my way from Laoag to a bit before Tarlac City.\r\nA really good place. Loads of room to stop. Not too heavy traffic. I don't know why it didn't work. I had a few quick rides that day. After 45 minutes of trying I got on a bus, coz it was getting dark.","date":"2026-02-03","rating":1}],"destLat":null,"destLon":null}]}