{"country":"PL","name":"Pologne","totalSpots":537,"totalReviews":3933,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":364,"lat":50.0835,"lon":19.7906,"rating":5,"reviews":15,"wait":18,"signal":"sign","lastUsed":"2025-06-15","comments":[{"text":"Stood after the tool boths, got picked up quickly. Right beside me transport inspection was checking lorrys, but they did not care about me","date":"2024-07-29","rating":5},{"text":"Very good spot to go direction Wroclaw or Germany","date":"2023-03-27","rating":5},{"text":"Perfect spot, many cars, we (2men) declined offers to katowice and got a lift to Graz in Austria after 30 min.","date":"2016-08-14","rating":5},{"text":"Used http://krakow.jakdojade.pl/ to find a bus from Kraków city to stop BALICE - INSTYTUT and there is entry to toll gates through gate, guards didn't bother me. Be alert while riding a bus because you need to press a button for bus to stop and in my bus there was no info about the current stop!","date":"2015-10-10","rating":5},{"text":"I was standing before paytolls, some lorry took me to Katowice after 5 minutes","date":"2015-03-19","rating":5}],"destLat":50.2526,"destLon":18.8821},{"id":87,"lat":52.1552,"lon":20.6839,"rating":5,"reviews":8,"wait":10,"signal":"thumb","lastUsed":"2025-10-08","comments":[{"text":"We waited for a very short time, even thought a lot of cars passed because they vere full of people or stuff (mainly going home from vacation because it was sunday evening). But really nice place to hitchhike especially when someone takes you to this place :). \r\nFirst guy who stopped us drove us to Jelenia Góra (we wanted south because we were on our way to Czech Republic).","date":"2025-08-03","rating":5},{"text":"Very good spot, definitely the best way to get out of Warsaw westward","date":"2025-07-29","rating":5},{"text":"Great spot, a lot of traffic, got ride to Poznan","date":"2025-07-22","rating":5},{"text":"Perfect spot for escaping Warsaw. If you go on foot, then there is a 2m fence surrounding it, but a bit to the west there is one gate near a highway emergency exit, which is held only by wire and can be opened","date":"2025-07-08","rating":5},{"text":"nice place, a lot of cars going through","date":"2025-06-01","rating":5}],"destLat":52.3307,"destLon":17.0893},{"id":142,"lat":50.3109,"lon":18.5519,"rating":5,"reviews":7,"wait":24,"signal":"sign","lastUsed":"2025-09-02","comments":[{"text":"Good spot, lot's of cars","date":"2025-09-02","rating":5},{"text":"Many cars stopping there and going to Wroclaw and Germany, found our ride quickly","date":"2025-08-11","rating":5},{"text":"Stuck my thumb out before the exit and quickly got picked up","date":"2025-07-05","rating":5},{"text":"Many cars (passengers and trucks) stop here to fill the cars, to rest, eat - lots of choices. I was alone (a girl) and after asking a few drivers (it was at long weekend when most of big trucks can't drive) I found a small truck exactly to dresden when I was going on.","date":"2016-08-16","rating":5},{"text":"When going to Cracow from Wroclaw it's the last decent place to hitch, because you need to avoid Katowice. Next is tollbooth.","date":"2012-09-24","rating":5}],"destLat":51.0503,"destLon":16.9697},{"id":258,"lat":50.8449,"lon":17.2541,"rating":5,"reviews":7,"wait":18,"signal":null,"lastUsed":"2025-08-04","comments":[{"text":"15 minutes with a sign \"KRAKÓW\"","date":"2025-08-04","rating":5},{"text":"Many people going to Wroclaw, but also plenty of cars going past Wroclaw. Didn't take us more than about half an hour to get a ride farther west.","date":"2015-08-17","rating":5},{"text":"Good traffic on sunday. A couple german drivers (berlin). We got a ride after 30 minutes.","date":"2014-10-06","rating":5},{"text":"With some luck, you can catch a long ride. There were people driving to Ghent (Belgium), but their car was full. Other people where driving to Antwerp (Belgium), but they only wanted to take me to Berlin.","date":"2014-09-17","rating":5},{"text":"I got here in the evening. There was a guy offering me a ride to Hamburg, another a ride to Berlin, but I had to wait some time (about 1 hour).","date":"2014-09-17","rating":5}],"destLat":50.0446,"destLon":19.9322},{"id":116,"lat":51.7024,"lon":19.6027,"rating":5,"reviews":6,"wait":31,"signal":"sign","lastUsed":"2025-09-09","comments":[{"text":"Got a ride in couple of minutes towards Krakow. Fence gates were open to access station. 2 M","date":"2025-09-09","rating":5},{"text":"I believe most traffic is going to the Katowice area, but Krakow is not too hard either. As of august 2025 the hole is still there just before the woods that are close to the exit.","date":"2025-08-17","rating":5},{"text":"Arguably one of the best spots in Poland. Great to catch a ride towards Wrocław or Katowice. With some luck you can also find a driver going to Kielce, Lublin, Rzeszów or even Ukraine or Czech Republic.\r\n\r\nI believe there was a hole in the fence, close to the exit in the bushes. Just go along the fence and you'll find it.","date":"2024-12-07","rating":5},{"text":"Great spot to go to Wrocław. \r\n\r\nThe only thing is, if you want to start from here, and you want to reach the place by bus from Lodz, you have to go through the fence because the gate to the station area is usually closed","date":"2023-10-12","rating":5},{"text":"Took straight to Czechy, good spot to go to the south","date":"2023-08-15","rating":5}],"destLat":50.0457,"destLon":19.9429},{"id":387,"lat":52.1553,"lon":20.6831,"rating":5,"reviews":6,"wait":28,"signal":"sign","lastUsed":"2025-05-10","comments":[{"text":"Best place to get out of Warsaw to the West","date":"2025-05-10","rating":5},{"text":"HONEST spot. Took bus 64 from Brwinów. Walked 15 mins from bus stop and entered through back gate easy. Guy going to NL pulled over within 10 mins.","date":"2024-09-09","rating":5},{"text":"Very good spot to take ride to Łódź","date":"2023-08-15","rating":5},{"text":"3 People, 10 minutes until we got our lift to Berlin.\nAttention. If you coming by feet there is a 2m fence or a 2m door you have to cross to get to the gas-station.","date":"2017-09-13","rating":5},{"text":"Two guys. 40min. Really good spot to hitch-hike in the direction of the west. But the only problem is other hitch-hikers haha :) we saw another 3-4 people here.","date":"2017-09-13","rating":5}],"destLat":52.2951,"destLon":17.654},{"id":761,"lat":51.1669,"lon":17.0265,"rating":5,"reviews":5,"wait":8,"signal":null,"lastUsed":"2022-05-25","comments":[{"text":"No much trafic, gave up after an hour","date":"2022-05-25","rating":5},{"text":"Drivers go slowly, bus stop right after a roundabout with enough space to pull up a car...what else can you want? :)","date":"2014-07-23","rating":5},{"text":"During rush hours you can often meet a traffic jam here. For hitchhikders it is v. good :)","date":"2013-10-16","rating":5},{"text":"there is a stopping spot, not too much space, but this is OK, because the cars are coming from a roundabout","date":"2012-09-08","rating":5},{"text":"It is a lay-by for buses #308 timetable &#809 timetable. It is situated 50 meters right on slip-off from the roundabout.\nThe bus stop is called \"Żmigrodzka (Obwodnica)\"\nThe merged traffic from the city center and the transit one from the A4 motorway is brought here by the newly constructed Wroclaw Ringroad(A8)& passes U by  :-). Cars go slowly while leaving the roundabout so driver can see you easily & has enough time to pull over. It is also a place of a frequent traffic jam occurance\nAs 1 imag","date":"2011-09-26","rating":5}],"destLat":null,"destLon":null},{"id":199,"lat":49.9875,"lon":20.3414,"rating":5,"reviews":4,"wait":35,"signal":"sign","lastUsed":"2025-08-20","comments":[{"text":"Good spot. Guaranteed that someone will take you to Rzeszow","date":"2025-08-20","rating":5},{"text":"We used train to get to Stanislawice from Krakow, normal fare is around 5,5 zl, reduced is about 2,7 zl. It took us about 20 minutes to get to this station from railwail station \"Stanislawice\". Be aware of fence near this stop, it's everywhere. It took us 30 minutes, but then we found our car to Rzeszow","date":"2017-12-03","rating":5},{"text":"After two very rainy hours and a good lunch we eventually accepted a ride to Jaroslaw (just east of Rzeszow), while trying to get to Ukraine.","date":"2015-08-17","rating":5},{"text":"Large gas station with McDonalds. Plenty of traffic towards Tarnow and Rzeszow, but a bit more difficult to catch a ride all the way to Ukraine.","date":"2015-08-17","rating":5}],"destLat":50.4852,"destLon":22.1912},{"id":521,"lat":54.3226,"lon":18.5433,"rating":5,"reviews":4,"wait":29,"signal":"thumb","lastUsed":"2024-09-08","comments":[{"text":"Nice place, I always start my journeys from here. It's usually short rides there, but it always will take you forward outside of Gdańsk to Pruszcz Gdański/Starogard/Tczew","date":"2024-09-08","rating":5},{"text":"We caught a ride here to Toruń in 5 minutes! Very nice stop, drivers are turning there and going pretty slow + it has a lot of space to stop. Totally recommend :)","date":"2023-03-18","rating":5},{"text":"Took less thanks 10 minutes to get a ride to the destination we were going. Awsome spot :)","date":"2017-07-24","rating":5},{"text":"We got a ride in a minute since we got there ;) perfect spot for moving south(direction Łódź).","date":"2016-05-09","rating":5}],"destLat":54.2337,"destLon":18.6074},{"id":47,"lat":53.0652,"lon":21.9838,"rating":5,"reviews":3,"wait":15,"signal":"sign","lastUsed":"2025-10-31","comments":[{"text":"Busy service station. Was able to find a lift to Suwalki but should be very easy to find one to Lithuania.","date":"2025-10-31","rating":5},{"text":"Very nice spot if you want get to Suwałki/ Poland Border","date":"2025-06-02","rating":5},{"text":"Big gas station, lot of trucks. Found a truck to go to Lituania on saturday lunch","date":"2024-10-27","rating":5}],"destLat":53.9978,"destLon":22.8263},{"id":88,"lat":53.196,"lon":22.0965,"rating":5,"reviews":3,"wait":1,"signal":"sign","lastUsed":"2025-10-06","comments":[{"text":"I was going to this spot through the bridge and truck driver saw my sign and called me to him. So I get a ride before I reached spot hah","date":"2025-10-06","rating":5},{"text":"very good, at friday afternoon very hard traffic. no problem to catch a car to Suwalki in 30 minutes","date":"2016-07-15","rating":5},{"text":"I don't think it's actually legal for the drivers to stop on this lane but either way it's a good place If you are heading North (Mazury lake district) or East (Lithuania). If you are stuck in Lomza and don't want to walk the whole way, take the bus no. 1 and hop off on the bus stop called \"Nadnarwianska\"","date":"2014-07-19","rating":5}],"destLat":54.0556,"destLon":22.8971},{"id":119,"lat":53.3374,"lon":14.4224,"rating":5,"reviews":3,"wait":33,"signal":null,"lastUsed":"2025-09-09","comments":[{"text":"Awsome, lot of cars going. Maybe could have waited for a longer hitch.","date":"2025-09-09","rating":5},{"text":"Very good spot, a lot of cars & trucks coming through","date":"2025-09-09","rating":5},{"text":"took us some time to get a ride, but we arrived here at around 2 am. its quite safe in here to hitchhike at night, just sit somewhere inside and ask people coming in. there was a lot of police around because of border nearby","date":"2025-07-28","rating":5}],"destLat":54.2085,"destLon":16.153},{"id":167,"lat":50.5601,"lon":21.5216,"rating":5,"reviews":3,"wait":8,"signal":null,"lastUsed":"2025-08-29","comments":[{"text":"bus stop after roundabout, good spot","date":"2025-08-29","rating":5},{"text":"Lots of traffic towards Sandomierz, Kielce and Rzeszów. There are bus stops in every direction just after the roundabout.","date":"2013-09-21","rating":5}],"destLat":50.3383,"destLon":21.7312},{"id":310,"lat":50.0461,"lon":21.982,"rating":5,"reviews":3,"wait":16,"signal":"sign","lastUsed":"2025-07-05","comments":[{"text":"very good point, there is a roundabout, so cars only accelerate after passing the stop, which helps them notice the sign with our destination city","date":"2025-07-05","rating":5},{"text":"just after the main crossroads, cars are riding slow and there is a lot of space on a bus stop","date":"2014-06-05","rating":5}],"destLat":null,"destLon":null},{"id":474,"lat":52.315,"lon":20.9209,"rating":5,"reviews":3,"wait":19,"signal":null,"lastUsed":"2024-12-17","comments":[{"text":"Really quick","date":"2024-12-17","rating":5},{"text":"Good place!","date":"2012-07-20","rating":5},{"text":"Świetne miejsce!","date":null,"rating":5}],"destLat":53.2998,"destLon":20.4374},{"id":588,"lat":54.3465,"lon":16.6616,"rating":5,"reviews":3,"wait":4,"signal":"thumb","lastUsed":"2024-05-01","comments":[{"text":"Very good spot! I highly recommend to hike there to get to Germany! Many cars going there. You don't need anything but a thumb. Mordeczki polecam ten spocik z całego serca!","date":"2024-05-01","rating":5},{"text":"good place to stop the car to Germany or Koszalin \nbus stop","date":"2016-08-30","rating":5}],"destLat":53.3255,"destLon":14.409},{"id":601,"lat":50.095,"lon":19.8744,"rating":5,"reviews":3,"wait":43,"signal":"sign","lastUsed":"2024-04-22","comments":[{"text":"Kontynuacja opinii, z poniżej","date":"2024-04-19","rating":5},{"text":"Bezpośrednio z Krakowa do Wrocławia\r\nZłapany koło godziny 12\r\nLepiej stanąć koło cmentarza przy pasie do skrętu w prawo na stację, wtedy łatwiej kierowc y będą widzieć i będą moi zjechać na symtację\r\n\r\n12, o'click direct from Cracow to Wrocław.\r\nBetter to stay close to cementary so that drivers will be able to See You and turn right to Pick You up","date":"2024-04-18","rating":5}],"destLat":51.947,"destLon":15.5133},{"id":637,"lat":49.9734,"lon":19.9071,"rating":5,"reviews":3,"wait":21,"signal":null,"lastUsed":"2023-09-23","comments":[{"text":"There is some construction work going on, but that actually slows traffic down, which makes it easier for people to notice you. You can get here by bus from the centre of Kraków in a flash.","date":"2023-09-23","rating":5},{"text":"After the pandemic the wait time is longer, but this is still a good spot. It's a bus stop, you can get here via city bus or A1 bus that is operated by Koleje Wielkopolskie.Cars go slower here because it's up a slope, if you don't have any luck you can go further down the road via bus, or cross the Street and go back to Kraków.","date":"2023-05-03","rating":5},{"text":"This is a great spot to get a ride out of Krakow. You can take bus/tram here to this bus stop (Libertów Góra Libertowska).","date":"2023-04-17","rating":5}],"destLat":49.1403,"destLon":20.2255},{"id":645,"lat":50.2526,"lon":18.8826,"rating":5,"reviews":3,"wait":10,"signal":null,"lastUsed":"2023-09-13","comments":[{"text":"Good to get to A2","date":"2023-09-13","rating":5},{"text":"I was left here by driver who took me from Krakow (late Sunday) and just after I left the car and asked the first I noticed there (many stop for gas, to rest etc.) I had a lift to connect A1 (I needed to go the the Czech Republic border).","date":"2016-08-16","rating":5},{"text":"A good place to find a ride to Ostrava, CZ.","date":"2015-08-20","rating":5}],"destLat":50.2542,"destLon":18.8825},{"id":693,"lat":51.2251,"lon":17.2024,"rating":5,"reviews":3,"wait":12,"signal":null,"lastUsed":"2023-07-28","comments":[{"text":"Very good spot to go to Warsaw. It's a bit difficult to get there, but once there, it's an amazing spot. We got there at 22:30 and there was A LOT of traffic. First guy we asked took us to Warsaw. Plus they have free toilets and stuff. If you need long rides towards Łodz or Warsaw or further then this is the spot","date":"2023-07-28","rating":5},{"text":"If you are going to Warszawa, I would recommend asking just the people with the right license plates and not accepting rides just to Łódź","date":"2016-08-23","rating":5},{"text":"Very few cars but most are going quite far so it's good to ask every driver that stops here. Direction Warsaw.","date":"2015-08-03","rating":5}],"destLat":51.2237,"destLon":17.2025},{"id":709,"lat":53.1883,"lon":18.0722,"rating":5,"reviews":3,"wait":1,"signal":null,"lastUsed":"2023-06-09","comments":[{"text":"Got a direct ride to Gdańsk from here instantly after I stood here.\r\nBut I learned out on this spot that I didn't get a job what I wanted :( Sad\r\nAnyways, the spot is really good and people were nice! Spread positivity with others, guys and stay healthy!","date":"2023-06-09","rating":5},{"text":"to Gdańsk, bus stop (line 415)","date":"2013-10-16","rating":5}],"destLat":54.4436,"destLon":18.4189},{"id":717,"lat":50.1419,"lon":19.9711,"rating":5,"reviews":3,"wait":13,"signal":null,"lastUsed":"2023-05-21","comments":[{"text":"Great spot, lots of cars going slowly. Stand at the crosswalk which is at too of “hill” so cars can see you. A few meters further down there is a bus stoo where they can pull over.\r\nEasy to get to by public transportation, we took bus 307 from center.","date":"2023-05-21","rating":5},{"text":"it's a very good spot to hitch, I never wait too long for someone to pick me up.","date":"2013-10-20","rating":5},{"text":"it's a very good spot to hitch, I never wait too long for someone to pick me up.\nThere is a bus stop (\"Michałowice Komora\" - bus 257, you'll need a ticket for second zone) just after a pedestrian crossing so cars drive slowly and can easly stop to get you.","date":"2013-10-20","rating":5}],"destLat":50.9013,"destLon":20.6169},{"id":21,"lat":52.5084,"lon":17.4736,"rating":5,"reviews":2,"wait":35,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"Group of employees were comming home. near to Gdansk.","date":"2026-01-16","rating":5},{"text":"Plenty space at the exit from the rest place, but not many cars coming. For a long distance HH still good I think.","date":"2025-08-29","rating":5}],"destLat":54.1218,"destLon":17.9783},{"id":48,"lat":50.1087,"lon":19.9659,"rating":5,"reviews":2,"wait":6,"signal":"sign","lastUsed":"2025-10-31","comments":[{"text":"Perfect spot to head north towards Warsaw. Use a sign though. There's a bus stop where the cars can pull over and even a pedestrian crossing with traffic lights you could abuse to your advantage if you're evil enough.","date":"2025-10-31","rating":5},{"text":"I was on the way to the roundebound and a car stopped to pick me up direction warzawa. On sunday morning 10 am. Some traffic and some space and lighttraffic to stop","date":"2024-10-27","rating":5}],"destLat":53.064,"destLon":21.982},{"id":64,"lat":52.2229,"lon":21.2434,"rating":5,"reviews":2,"wait":18,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Easy to Lublin","date":"2025-10-15","rating":5},{"text":"Szybko złapaliśmy stopa do Lublina","date":"2025-04-26","rating":5}],"destLat":51.2317,"destLon":22.5675},{"id":96,"lat":50.1211,"lon":18.8142,"rating":5,"reviews":2,"wait":8,"signal":null,"lastUsed":"2025-09-21","comments":[{"text":"Greaat spot to go to Katowice.","date":"2025-09-21","rating":5},{"text":"Very fast, there is a bus stop","date":"2025-04-24","rating":5}],"destLat":50.257,"destLon":19.0171},{"id":121,"lat":51.2583,"lon":17.0443,"rating":5,"reviews":2,"wait":5,"signal":"thumb","lastUsed":"2025-09-09","comments":[{"text":"Perfekt spot to go to Poznan. Many cars. Got a ride in a few minutes.","date":"2025-09-09","rating":5},{"text":"PERFECT.\r\nIf you are trying to get to Poznan, this is the best spot around. Most people stopping there are going towards Poznan anyway. Got a ride in few minutes.","date":"2023-04-10","rating":5}],"destLat":52.398,"destLon":16.9187},{"id":124,"lat":50.2525,"lon":18.8829,"rating":5,"reviews":2,"wait":18,"signal":"ask","lastUsed":"2025-09-08","comments":[{"text":"One of the best places to hitchhike near Katowice. We planned to go in the direction of Ostrava in the further Budapest and we managed to catch the driver to Vienna. Overall, a great place to catch a foot in the direction of Wroclaw, Berlin, Vienna. It is worth going to the parking lot and asking people where they are going - a lot of individual drivers and trucks.","date":"2025-09-08","rating":5},{"text":"Best spot in Katowice Area to get anywhere","date":"2024-04-10","rating":5}],"destLat":48.3109,"destLon":16.5147},{"id":169,"lat":51.6768,"lon":16.1008,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2025-08-28","comments":[{"text":"There is a exit from gas station with plenty space to hitchhike.","date":"2025-08-28","rating":5}],"destLat":51.8263,"destLon":16.5021},{"id":188,"lat":50.0897,"lon":22.177,"rating":5,"reviews":2,"wait":13,"signal":"thumb","lastUsed":"2025-08-24","comments":[{"text":"In no time I got ride to medyka border crossing however my driver told me that if I will wait for his wife to cross border I will be able to get to lviv with his wife's friend so I did it. However at the Ukrainian side I found out that she doesn't have a car and we ended up hitchhiking together to lviv itself or more exactly she ask someone near the border and he took us. If I knew that I would probably cross the border just after coming to medyka and then hitchhike to lviv by myself but in the ","date":"2025-08-24","rating":5},{"text":"one of my favourite ways to catch a car — waiting for cars to slowly exiting a patrol station. a lot of cars here are going towards ukraine/lviv/smth else, really nice spot. good in any time of a day","date":"2025-07-23","rating":5}],"destLat":49.8394,"destLon":24.0327},{"id":230,"lat":51.6662,"lon":16.0906,"rating":5,"reviews":2,"wait":18,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"We wanted to try after the pink bridge, but the place has been closed with a barrier so cars cannot stop. We tried just before the bridge, but as nobody was stopping, we moved to the bus stop, and got a ride in 20min.","date":"2025-08-11","rating":5}],"destLat":52.4049,"destLon":16.9189},{"id":252,"lat":49.5371,"lon":19.7156,"rating":5,"reviews":2,"wait":3,"signal":null,"lastUsed":"2025-08-06","comments":[{"text":"Got a short ride in no time.","date":"2025-08-06","rating":5},{"text":"We didnt even put our bags down when a guy heading in Jabłonka direction stopped and took us a few kilometers. Good bus stop and most people ride towards South","date":"2025-06-30","rating":5}],"destLat":49.5111,"destLon":19.7203},{"id":302,"lat":50.9732,"lon":20.7408,"rating":5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2025-07-13","comments":[{"text":"What was said before is true\r\nBut if you wait at the exit of the station/McDo, there is no place to stop and it's in a turn, or there is but the wrong side of the road. Actually it's no big deal, the spot is good","date":"2025-07-13","rating":5},{"text":"Amazing MOP for north direction, used a lot and most traffic goes serious long distance, a ride to Warszawa the least, you can ask around or thumb or use sign, I imagine everything would work here, wait times of 10-20 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":325,"lat":51.2121,"lon":19.4872,"rating":5,"reviews":2,"wait":8,"signal":null,"lastUsed":"2025-06-28","comments":[{"text":"Tutaj jest dobry spot na łapanie w kierunku Bełchatowa i A1","date":"2025-06-28","rating":5}],"destLat":51.206,"destLon":19.4939},{"id":478,"lat":49.6761,"lon":20.083,"rating":5,"reviews":2,"wait":2,"signal":null,"lastUsed":"2024-12-14","comments":[{"text":"Good visibility, much place to stop, people willing to take - two cars took group of 5 within 5 minutes","date":"2024-12-14","rating":5},{"text":"Good visibility, much place to stop, people willing to take - two cars took group of 5 within 5 minutes","date":"2024-12-14","rating":5}],"destLat":49.7042,"destLon":20.1322},{"id":533,"lat":53.1748,"lon":18.0562,"rating":5,"reviews":2,"wait":28,"signal":"sign","lastUsed":"2024-08-28","comments":[{"text":"It was late, we've already lost hope, but than...he arrived","date":"2024-08-28","rating":5},{"text":"Good spot for gdansk. We got nice ride almost to gdansk. It leads to atostrade.","date":"2023-08-09","rating":5}],"destLat":53.1749,"destLon":18.0561},{"id":585,"lat":50.9172,"lon":15.7713,"rating":5,"reviews":2,"wait":8,"signal":"sign","lastUsed":"2024-05-04","comments":[{"text":"Got a ride in a 5 minutes to Wrocław","date":"2024-05-04","rating":5},{"text":"Great spot. They can see you from traffic lights right on the opposite, so they can Made up their mind. There is a lot of space for stopping for the vehicle. \r\nWe had a great ride with an amazing woman, she drives to Wroclaw frequently, so if you meet her, say her hello from Czech couple😊. We were talking all the time untill we were Wroclaw.","date":"2023-08-09","rating":5}],"destLat":51.0569,"destLon":17.0329},{"id":602,"lat":54.3418,"lon":18.3601,"rating":5,"reviews":2,"wait":5,"signal":"thumb","lastUsed":"2024-04-22","comments":[{"text":"very good spot on a gas station","date":"2024-04-22","rating":5}],"destLat":54.2907,"destLon":18.3021},{"id":615,"lat":52.1622,"lon":21.1672,"rating":5,"reviews":2,"wait":9,"signal":null,"lastUsed":"2024-03-06","comments":[{"text":"You would find a way to get there.","date":"2024-03-06","rating":5},{"text":"Great place to get a lift towards Lublin. Usually takes not longer than 10 minutes.","date":"2023-07-31","rating":5}],"destLat":52.1619,"destLon":21.1672},{"id":657,"lat":54.7876,"lon":18.4074,"rating":5,"reviews":2,"wait":15,"signal":null,"lastUsed":"2023-08-26","comments":[{"text":"5,15 and 20 minutes waiting time","date":"2023-08-26","rating":5}],"destLat":54.3446,"destLon":18.6836},{"id":3,"lat":53.649,"lon":22.464,"rating":5,"reviews":1,"wait":4,"signal":"sign","lastUsed":"2026-01-25","comments":[{"text":"Not a bad spot. A truck leaving the parking lot across the road from Lidl waved at me and got me to a gas station, where I switched cars with one of his friends. I think you might be able to get a ride to Augustów from here relatively quickly.","date":"2026-01-25","rating":5}],"destLat":53.7736,"destLon":22.8172},{"id":5,"lat":53.3855,"lon":22.1501,"rating":5,"reviews":1,"wait":17,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"This is a good spot, but you have a dilemma here when going north. You can take either the highway exit or the local one; they are right next to each other. I chose the local route, and it might have been a mistake. Both of them have plenty of space to stop.","date":"2026-01-24","rating":5}],"destLat":53.5686,"destLon":22.2899},{"id":6,"lat":53.4153,"lon":21.9473,"rating":5,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"Not a bad spot, if you are going north, just take a short hitch to Stawiski and continue from there.","date":"2026-01-24","rating":5}],"destLat":53.385,"destLon":22.1498},{"id":7,"lat":52.8889,"lon":20.6288,"rating":5,"reviews":1,"wait":6,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"Ok, I might be a little bit biased, but this is one of those spots in my heart. The whole Wojska Polskiego Road is nice; there are places to stop every couple of meters, and I think there is a bus stop as well. I got lucky here and got a ride all the way to Kołno, even though I thought this would just be a short last ride of the day. They took me 100 km north, and it was a great ride.","date":"2026-01-24","rating":5}],"destLat":53.4094,"destLon":21.9279},{"id":8,"lat":52.6879,"lon":20.4727,"rating":5,"reviews":1,"wait":4,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"Perfect spot towards Ciechanów, there is a bus stop just after the roundabout, good visibility, and slow traffic.","date":"2026-01-24","rating":5}],"destLat":52.8886,"destLon":20.6296},{"id":9,"lat":52.6335,"lon":20.3882,"rating":5,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"Good spot, somewhere around here is a bus station. I would advise you to stay on that. Many cars go to Sochocin and Ciechanów.","date":"2026-01-24","rating":5}],"destLat":52.6871,"destLon":20.4726},{"id":10,"lat":52.3929,"lon":20.1793,"rating":5,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"Not a bad place towards Płońsk, cars go slowly and stop even though there isn't a great place to stop.","date":"2026-01-24","rating":5}],"destLat":52.6293,"destLon":20.392},{"id":14,"lat":50.8831,"lon":15.642,"rating":5,"reviews":1,"wait":null,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"If you want to Jelenia Gora, than this is a nice spot.","date":"2026-01-24","rating":5}],"destLat":50.9041,"destLon":15.7437},{"id":15,"lat":50.5616,"lon":22.0795,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-01-22","comments":[{"text":"Best spot if you want to go to bigger city (Rzeszów, Lublin) or just want to ride to the nearest expressway (S19)","date":"2026-01-22","rating":5}],"destLat":null,"destLon":null},{"id":17,"lat":50.4111,"lon":16.4426,"rating":5,"reviews":1,"wait":7,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"you are visible here, nothing special","date":"2026-01-16","rating":5}],"destLat":50.4336,"destLon":16.2396},{"id":22,"lat":52.3704,"lon":16.7664,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"We wanted to go northbut we were unlucky on the north direction of highway. So we decided to go like under Poznan. It was right decision.","date":"2026-01-16","rating":5}],"destLat":52.5069,"destLon":17.4713},{"id":25,"lat":50.4051,"lon":16.3855,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"It's better to hitchhike here than on border. People don't want to stop on border I guess. Couple of pensioners took as between Wroclaw and Leszno.","date":"2026-01-16","rating":5}],"destLat":51.5823,"destLon":16.8493},{"id":33,"lat":50.2086,"lon":20.02,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2026-01-02","comments":[{"text":"go long distances","date":"2026-01-02","rating":5}],"destLat":51.119,"destLon":20.8498},{"id":36,"lat":54.479,"lon":17.026,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-12-20","comments":[{"text":"Not to much traffic but spot in general is good","date":"2025-12-20","rating":5}],"destLat":54.5824,"destLon":16.8673},{"id":39,"lat":52.2235,"lon":21.2286,"rating":5,"reviews":1,"wait":4,"signal":null,"lastUsed":"2025-12-09","comments":[{"text":"perfect spot to take a ride to east Poland, good place to stop for drivers","date":"2025-12-09","rating":5}],"destLat":51.3888,"destLon":22.248},{"id":40,"lat":50.6072,"lon":16.8224,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-11-25","comments":[{"text":"First car took me to Brno","date":"2025-11-25","rating":5}],"destLat":49.1975,"destLon":16.6052},{"id":51,"lat":54.1312,"lon":22.9504,"rating":5,"reviews":1,"wait":27,"signal":"ask-sign","lastUsed":"2025-10-21","comments":[{"text":"It rained quite heavily, so I found shelter nearby Vynoteka. A lot of people going to Lithuania buy cheap alcohol in Poland's border, and I believe this is one of the last alcohol stores in the north.","date":"2025-10-21","rating":5}],"destLat":54.8901,"destLon":23.8647},{"id":52,"lat":50.8923,"lon":14.851,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-10-20","comments":[{"text":"Nia unua veturo post longa piediro el Zittau, ĉar multaj teamoj provis el la urbo, ni decidis iri al pli strategia loko. Sed ni strategiis malĝuste, ĉar mi ne sciis, ke ni finfine transirus la polan limon piede, kaj mi havas brazilan pasporton, do ili kondukis nin tien dum 30 minutoj por esplori Dion kaj la mondon.","date":"2025-10-20","rating":5}],"destLat":50.7837,"destLon":15.023},{"id":54,"lat":49.4861,"lon":20.6806,"rating":5,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"With a sign saying Piwniczna, got a ride directly to the border","date":"2025-10-15","rating":5}],"destLat":49.4204,"destLon":20.7253},{"id":55,"lat":49.5706,"lon":20.6611,"rating":5,"reviews":1,"wait":3,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"With sign to Piwniczna","date":"2025-10-15","rating":5}],"destLat":49.4861,"destLon":20.6806},{"id":56,"lat":49.592,"lon":20.6782,"rating":5,"reviews":1,"wait":4,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Sign saying Piwniczna, got a ride to a better spot","date":"2025-10-15","rating":5}],"destLat":49.5707,"destLon":20.6612},{"id":60,"lat":50.7503,"lon":23.2414,"rating":5,"reviews":1,"wait":8,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Space for cars to pull over, not hard to find a car to Lublin","date":"2025-10-15","rating":5}],"destLat":51.2314,"destLon":22.569},{"id":62,"lat":50.9668,"lon":23.1822,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Quickly got a ride to close to Zamość, lots of space for cars to pull over and they’re not going that fast","date":"2025-10-15","rating":5}],"destLat":50.8015,"destLon":23.2018},{"id":69,"lat":52.9432,"lon":23.4379,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Super easy to Białystok","date":"2025-10-15","rating":5}],"destLat":53.0829,"destLon":23.2577},{"id":70,"lat":52.9169,"lon":23.4108,"rating":5,"reviews":1,"wait":4,"signal":"thumb","lastUsed":"2025-10-15","comments":[{"text":"Better not to have a sign, it’s very likely the first car will take you to Trześcianka and you can go further from there. Started with a sign but people don’t wanna take you if you’re going too far","date":"2025-10-15","rating":5}],"destLat":52.9431,"destLon":23.4382},{"id":71,"lat":52.9392,"lon":23.4326,"rating":5,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2025-10-15","comments":[{"text":"I was walking, first car I thumbed stopped and took me to the next village","date":"2025-10-15","rating":5}],"destLat":52.9442,"destLon":23.3895},{"id":73,"lat":53.8255,"lon":22.9615,"rating":5,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Cars are fast but they can easily pull over, wasn’t too long to get a ride to Białystok even though it was a bit late","date":"2025-10-15","rating":5}],"destLat":53.1367,"destLon":23.1499},{"id":74,"lat":54.0359,"lon":23.3559,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Good to Augustów, space for cats to pull over on the bridge","date":"2025-10-15","rating":5}],"destLat":53.8237,"destLon":22.9618},{"id":79,"lat":50.8573,"lon":15.5967,"rating":5,"reviews":1,"wait":null,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Nice spot to Jelenia Gora.","date":"2025-10-15","rating":5}],"destLat":50.9073,"destLon":15.7462},{"id":93,"lat":50.2202,"lon":18.6851,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-09-25","comments":[{"text":"excellent spot for going south, a lot of traffic and they are going slowly. there is a good spot to stand behind the roundabout","date":"2025-09-25","rating":5}],"destLat":50.131,"destLon":18.6891},{"id":98,"lat":49.7975,"lon":18.6378,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-09-21","comments":[{"text":"I had a sign saying “Pavlowice”. First car stopped and gave me a ride to Żory.","date":"2025-09-21","rating":5}],"destLat":50.0369,"destLon":18.7011},{"id":117,"lat":54.3076,"lon":16.5148,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-09-09","comments":[{"text":"Lot of cars passing slow, someone will definitely take you. And there is even a busstop. So ideal place to park.","date":"2025-09-09","rating":5}],"destLat":54.4517,"destLon":17.3117},{"id":122,"lat":53.01,"lon":18.735,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-09","comments":[{"text":"Great spot to go to Gdansk even at night.","date":"2025-09-09","rating":5}],"destLat":54.3618,"destLon":18.6386},{"id":126,"lat":51.8795,"lon":20.8549,"rating":5,"reviews":1,"wait":5,"signal":"ask-sign","lastUsed":"2025-09-07","comments":[{"text":"Great place to go towards Krakow. gas station + McDonald's -> a lot of potential drivers and easy to catch them for a talk.","date":"2025-09-07","rating":5}],"destLat":50.2274,"destLon":20.0122},{"id":131,"lat":54.1298,"lon":22.9303,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-09-05","comments":[{"text":"Bus stop behind roundabout. Slow traffic. Perfect spot.","date":"2025-09-05","rating":5}],"destLat":54.2081,"destLon":22.912},{"id":133,"lat":53.5898,"lon":23.1098,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-09-04","comments":[{"text":"Good spot towards Augustow/Suwalki, cars are going slowly cause of speed cameras, there's a big exit/parking right next to it","date":"2025-09-04","rating":5}],"destLat":54.0648,"destLon":23.3592},{"id":134,"lat":51.6558,"lon":15.8361,"rating":5,"reviews":1,"wait":1,"signal":"thumb","lastUsed":"2025-09-04","comments":[{"text":"a nice MOP accessible from the old road (333), the gate was open, a guy took us right away when we arrived","date":"2025-09-04","rating":5}],"destLat":51.9054,"destLon":15.5893},{"id":136,"lat":50.9746,"lon":18.1836,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-09-03","comments":[{"text":"Na Wrocław bardzo szybko idzie złapać, czasem bezpośrednio a czasem na 2-3 razy","date":"2025-09-03","rating":5}],"destLat":50.9746,"destLon":18.1836},{"id":139,"lat":50.3722,"lon":18.7439,"rating":5,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2025-09-03","comments":[{"text":"Very good spot if you are going direction to Czech or Austria. Just showed my sign and the first truck took me to Brno","date":"2025-09-03","rating":5}],"destLat":49.1858,"destLon":16.7595},{"id":152,"lat":51.4429,"lon":21.0332,"rating":5,"reviews":1,"wait":30,"signal":"ask-sign","lastUsed":"2025-09-01","comments":[{"text":"30 min of asking people to take us","date":"2025-09-01","rating":5}],"destLat":50.8419,"destLon":20.4826},{"id":153,"lat":54.7899,"lon":18.4085,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-09-01","comments":[{"text":"Perfect spot, every car from Hel and nearby have to go through this round. After few minutes I got a catch exactly where I wanted, straight to Wrocław, but there was a lot of cars from all over poland, specially in the summer season.","date":"2025-09-01","rating":5}],"destLat":51.1098,"destLon":16.9557},{"id":154,"lat":52.1073,"lon":21.2227,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-08-31","comments":[{"text":"We got a car to Politechnika really fast. You can both ask at the gas station or on the minor road","date":"2025-08-31","rating":5}],"destLat":52.2152,"destLon":21.0213},{"id":155,"lat":49.7425,"lon":18.7905,"rating":5,"reviews":1,"wait":15,"signal":"ask-sign","lastUsed":"2025-08-31","comments":[{"text":"We got extremely lucky and found a car to Warsaw. It helped probably that it was the last day of the Easter holidays","date":"2025-08-31","rating":5}],"destLat":52.1636,"destLon":21.0855},{"id":161,"lat":51.1584,"lon":16.1734,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-08-30","comments":[{"text":"Very good traffic and place to pull over.","date":"2025-08-30","rating":5}],"destLat":51.0555,"destLon":16.8806},{"id":164,"lat":53.5003,"lon":18.6811,"rating":5,"reviews":1,"wait":7,"signal":null,"lastUsed":"2025-08-29","comments":[{"text":"Great spot. Cars are going slow from the roundabout and there is a space at the bus station.","date":"2025-08-29","rating":5}],"destLat":53.5896,"destLon":18.6333},{"id":168,"lat":51.8249,"lon":16.4836,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-08-28","comments":[{"text":"There is a space for a car to stop on a bus station.","date":"2025-08-28","rating":5}],"destLat":52.4034,"destLon":17.0534},{"id":171,"lat":51.0735,"lon":16.2133,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-08-28","comments":[{"text":"We waited at the exit from the rest place. There was a good visibility and space.","date":"2025-08-28","rating":5}],"destLat":51.5694,"destLon":16.0403},{"id":177,"lat":52.0553,"lon":15.1168,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-26","comments":[{"text":"A lot of cars and easy ride to Sulechów","date":"2025-08-26","rating":5}],"destLat":52.0823,"destLon":15.6213},{"id":178,"lat":52.145,"lon":15.1582,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-26","comments":[{"text":"Good spot to hitchhike to Krosno. Easy ride.","date":"2025-08-26","rating":5}],"destLat":52.0552,"destLon":15.099},{"id":179,"lat":52.2988,"lon":15.2492,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-26","comments":[{"text":"Great spot to hitchhike trough villaged and counties to Krosno Odrzanskie. Recommend to stop in the Gryżyny or Niedźwiedź village","date":"2025-08-26","rating":5}],"destLat":52.1452,"destLon":15.1589},{"id":185,"lat":52.7128,"lon":21.6928,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-25","comments":[{"text":"Gas station, McDonald's, quite a lot of foreign cars and trucks drivers. Just stood at the exit with sign Wrocław, and got a truck all the way.","date":"2025-08-25","rating":5}],"destLat":51.1102,"destLon":17.0353},{"id":191,"lat":51.9599,"lon":21.5681,"rating":5,"reviews":1,"wait":50,"signal":"thumb","lastUsed":"2025-08-24","comments":[{"text":"First service station after Warsaw on route to Lublin. Probably only reasonable way to get here is to be driven here by a driver","date":"2025-08-24","rating":5}],"destLat":50.0366,"destLon":22.0325},{"id":200,"lat":50.0011,"lon":19.9412,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-20","comments":[{"text":"Busstop on a highway ramp with shade. Local traffic but also cars going to the highway. Got a ride to gas station on the highway","date":"2025-08-20","rating":5}],"destLat":49.9875,"destLon":20.3414},{"id":203,"lat":52.3039,"lon":21.0894,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-19","comments":[{"text":"Bus stop on the road going to Marki, close to S8 road going north from Warsaw. Couple, ~25yo, summer sunny morning. Hitchhiked with \"S8\" sign. Recommend it. Catched a lady going north, to Wyszków.","date":"2025-08-19","rating":5}],"destLat":52.4581,"destLon":21.2931},{"id":206,"lat":51.1504,"lon":17.1217,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-18","comments":[{"text":"Many spice for car","date":"2025-08-18","rating":5}],"destLat":51.2095,"destLon":17.38},{"id":214,"lat":51.0523,"lon":16.9761,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-16","comments":[{"text":"Great spot to Poznań","date":"2025-08-16","rating":5}],"destLat":52.3956,"destLon":16.9504},{"id":227,"lat":53.5265,"lon":15.7956,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"We were 3 people but still got a ride quite fast to Szczecin!","date":"2025-08-11","rating":5}],"destLat":53.4284,"destLon":14.5486},{"id":228,"lat":53.1565,"lon":16.7378,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"A huge fan of polish history took us and told us all the history of Poland in 1H =)\r\nApart from that, the spot is nice, with a high visibility, and you don't have to walk a lot from the center.","date":"2025-08-11","rating":5}],"destLat":53.7045,"destLon":16.6985},{"id":229,"lat":52.4982,"lon":16.8393,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"It was the time of Poland'Rock festival, so a lot of cars were going to Czaplinek, as our drivers. We decided to stop to Pila, but could have reach the festival straight. Maybe on a standard day, it wouldn't work so easily...","date":"2025-08-11","rating":5}],"destLat":53.148,"destLon":16.7418},{"id":231,"lat":51.2369,"lon":16.1691,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"Huge place to stop, with a high visibility. Cannot be better =) \r\nAnd our crazy driver invited us to his place to have a coffee and eat some polish dishes, big love on him!","date":"2025-08-11","rating":5}],"destLat":51.6615,"destLon":16.0867},{"id":232,"lat":51.1566,"lon":16.1732,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"We tried at the petrol station, but nobody was stopping, so we went a bit further in the village, and got a ride in 5min. We were going to the north, and our driver nicely agreed to let us after the city, on the way to Lubin.","date":"2025-08-11","rating":5}],"destLat":51.2084,"destLon":16.1684},{"id":241,"lat":53.3467,"lon":18.7092,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2025-08-10","comments":[{"text":"We got a ride thanks to a guy that took us and asked some other Poles :)","date":"2025-08-10","rating":5}],"destLat":50.2699,"destLon":19.0182},{"id":242,"lat":54.4308,"lon":18.4823,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-10","comments":[{"text":"The driver was very nice, even took us further than was his destination and at MOP he talked to strangers and got us a ride to Katowice","date":"2025-08-10","rating":5}],"destLat":53.3255,"destLon":18.7067},{"id":245,"lat":51.0825,"lon":15.3322,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-08-08","comments":[{"text":"very good spot for going towards Görlitz if you're on this road.","date":"2025-08-08","rating":5}],"destLat":51.1561,"destLon":14.9967},{"id":246,"lat":50.9055,"lon":15.7162,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-08-08","comments":[{"text":"a pretty okay spot if you're going towards Görlitz","date":"2025-08-08","rating":5}],"destLat":51.0815,"destLon":15.3353},{"id":249,"lat":49.9875,"lon":18.955,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-06","comments":[{"text":"Good place to HH in all directions (Krakow, Wrocław, Gdańsk or Warsaw). There is a petrol station and McD.","date":"2025-08-06","rating":5}],"destLat":52.0018,"destLon":20.5587},{"id":251,"lat":49.5111,"lon":19.7203,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-06","comments":[{"text":"Good spot if u go to Slovakia. A lot of space for cars or trucks to stop.","date":"2025-08-06","rating":5}],"destLat":49.2128,"destLon":19.2976},{"id":254,"lat":51.2255,"lon":17.2038,"rating":5,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-08-05","comments":[{"text":"MOP Service station exit to the motorway, I waited near the exit, there is really good visibility, even at night there are 2 lampposts nearby to stand under. Had a sign for WAWA, but I'm sure just your thumb should do the trick as well if you're trying to get anywhere along the motorway 👍","date":"2025-08-05","rating":5}],"destLat":51.6027,"destLon":18.9324},{"id":255,"lat":50.4223,"lon":16.2583,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-05","comments":[{"text":"Very good spot at a bus stop going in the direction to Kłodzko if you can't get a ride out of the village, walk here and wait at the opening of the bus stop. I had a sign saying Kłodzko and got picked up in 20 minutes of waiting","date":"2025-08-05","rating":5}],"destLat":50.4527,"destLon":16.6354},{"id":256,"lat":53.0639,"lon":21.9769,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-05","comments":[{"text":"Lot's of cars, some trucks. Got a ride to Warsaw by asking around","date":"2025-08-05","rating":5}],"destLat":52.2011,"destLon":21.0041},{"id":262,"lat":51.0932,"lon":15.0222,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-08-04","comments":[{"text":"Towards Bogatynia or Zawidow, use the speeding lane here rather than the bus stop, good amount of traffic, good visibility","date":"2025-08-04","rating":5}],"destLat":null,"destLon":null},{"id":270,"lat":54.6187,"lon":18.8021,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-08-02","comments":[{"text":"Really nice spot if you want to go outside of the peninsula, we were lucky because we stopped a woman who went our direction. It is nice wide spot, and when the train passen it stops a lot of cars.","date":"2025-08-02","rating":5}],"destLat":54.6751,"destLon":17.6197},{"id":271,"lat":54.7126,"lon":17.5785,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-08-02","comments":[{"text":"It was really nice place, bus stop, we waited very short time. Many people are going to Lebork from there.","date":"2025-08-02","rating":5}],"destLat":54.5358,"destLon":17.7501},{"id":274,"lat":54.4782,"lon":18.2745,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-07-30","comments":[{"text":"Very good spot for going towards eastern poland, we are 2 guys and we had a stettin sign but we stil got picked up after only 20 minutes but we only got driven to slubsk","date":"2025-07-30","rating":5}],"destLat":54.445,"destLon":16.9451},{"id":279,"lat":51.9542,"lon":20.1602,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-07-28","comments":[{"text":"good spot to get to E8 road from skierniewice. usually takes around 15 minutes to get a ride","date":"2025-07-28","rating":5}],"destLat":null,"destLon":null},{"id":280,"lat":50.5756,"lon":19.0487,"rating":5,"reviews":1,"wait":20,"signal":"ask","lastUsed":"2025-07-28","comments":[{"text":"you can get to katowice or even kraków from here","date":"2025-07-28","rating":5}],"destLat":49.9772,"destLon":19.8239},{"id":281,"lat":51.9272,"lon":20.4635,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-07-28","comments":[{"text":"i hitchhiked here several times, usually it takes between 1-20 minutes to get a car going far south. a lot of people going south to częstochowa and katowice stop here. if you want to go to south of poland be patient and dont go to rawa mazowiecka (theres a lot of cars going there but getting out of rawa is difficult)","date":"2025-07-28","rating":5}],"destLat":null,"destLon":null},{"id":286,"lat":50.0828,"lon":19.7907,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-07-23","comments":[{"text":"cars go slowly here because of the queue for a troll station, the best place to hitchhike in this area towards east poland like rzeszow or ukraine","date":"2025-07-23","rating":5}],"destLat":50.0428,"destLon":21.9991},{"id":290,"lat":49.8967,"lon":20.1002,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-07-22","comments":[{"text":"there is a bus stop, we met a nice guy who let us smoke weed inside","date":"2025-07-22","rating":5}],"destLat":50.0861,"destLon":19.9794},{"id":296,"lat":50.079,"lon":19.9496,"rating":5,"reviews":1,"wait":9,"signal":"thumb","lastUsed":"2025-07-19","comments":[{"text":"Great place, cars have an option to park safely on BP station. We cought a ride after 9 mins to Warsaw.","date":"2025-07-19","rating":5}],"destLat":52.2484,"destLon":20.9229},{"id":297,"lat":54.3037,"lon":23.1158,"rating":5,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-07-18","comments":[{"text":"Very good spot now due to the increased controls on Polish side, so the cars are slow or even stay in line, so you can really make an impression on the drivers. Got taken by two Ukranianians going to Wroclaw. \r\n\r\nExtra note: The police asked us for passports too, IDs were not enough even though we are EU citizens.","date":"2025-07-18","rating":5}],"destLat":52.2941,"destLon":21.0134},{"id":303,"lat":50.5972,"lon":20.2538,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-07-13","comments":[{"text":"Basic and good spot at petrol station, good way to stay on the main road to Warsow","date":"2025-07-13","rating":5}],"destLat":50.8416,"destLon":20.484},{"id":304,"lat":49.8968,"lon":20.1018,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-07-12","comments":[{"text":"Poland is so easy to hitchike broo random bus stops I didn't even have a sign and a guy in a TRUCK stopped on the bus stop and took me to tarnow. Poland is the easiest country to autostop in my opinion (I've hitchhiked in Germany, Belgium, france, Italy, Austria, Hungary, Slovakia, Croatia, bosnia so I guess I know what I'm saying)","date":"2025-07-12","rating":5}],"destLat":49.9995,"destLon":20.9568},{"id":312,"lat":51.9098,"lon":19.434,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-07-03","comments":[{"text":"Not much traffic, but it's steady. Plenty of space to pull over. Cars are going slow and have lots of time to see you. \r\nA guy stopped after 5 min, but was going a different way. 5 min later another guy stopped and gave me a ride to a reststop 40km from Warsaw.","date":"2025-07-03","rating":5}],"destLat":52.1091,"destLon":20.4598},{"id":314,"lat":51.2277,"lon":17.3707,"rating":5,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-07-02","comments":[{"text":"Low-medium traffic. Cars go slow, lots of time to see you and lots of space to stop. Got a ride by a Ukranian family all the way to Lodz.","date":"2025-07-02","rating":5}],"destLat":51.8501,"destLon":19.3823},{"id":315,"lat":49.4646,"lon":19.6912,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-07-01","comments":[{"text":"There is a bus stop and this place is definitely the best for riding to slovakia","date":"2025-07-01","rating":5}],"destLat":49.3568,"destLon":19.5958},{"id":322,"lat":51.3482,"lon":19.3722,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-06-28","comments":[{"text":"good spot in directon to a1 and kamiensk","date":"2025-06-28","rating":5}],"destLat":null,"destLon":null},{"id":323,"lat":51.3932,"lon":19.6965,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-06-28","comments":[{"text":"great spot for catch cars in direction to Czestochowa by old road nr 91","date":"2025-06-28","rating":5}],"destLat":null,"destLon":null},{"id":324,"lat":51.2033,"lon":19.4987,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-06-28","comments":[{"text":"Świetne miejsce","date":"2025-06-28","rating":5}],"destLat":51.2033,"destLon":19.4986},{"id":328,"lat":54.3013,"lon":23.1176,"rating":5,"reviews":1,"wait":60,"signal":null,"lastUsed":"2025-06-25","comments":[{"text":"Many trucks want to transport us, but I traveled with my friend so we waited for cars. After 60 minutes at 8 AM we founded transport to Kaunas","date":"2025-06-25","rating":5}],"destLat":54.8562,"destLon":23.8902},{"id":339,"lat":52.3997,"lon":22.0336,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Sokolow Podlaski, great bus stop, good visibility and the speeds are not that high yet, wait time of 5-15 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":342,"lat":52.5886,"lon":21.4635,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Wide roadside shoulder towards S8 or Lochow, okay amount of traffic, low speeds, wait time of 5-10 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":343,"lat":52.5313,"lon":21.071,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Just after a roundabout decent width road for stopping a car going towards Wyszkow, okay amount of traffic, wait time of 5-15 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":345,"lat":52.4151,"lon":20.9636,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"The bus L-9 takes you here, as of now (June 2025) the road is under construction and this bus stop is ideal since the construction starts around here, the cars slow down and it's a nice bus stop to stop to go towards Serock, a lot of local traffic tho, expected wait time of 5-10 minutes if you are not picky with rides","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":347,"lat":50.7522,"lon":20.6183,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Kielce, there's actually busses here that you can just walk in and get free to Kielce but if you want to go further you can stand here, the bus stops were full of people but cars turning from Brzeziny will most likely stop with 5-10 minutes of waiting, where you can control more where you wanna go than with the bus","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":348,"lat":50.6138,"lon":20.7448,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Morawica/Kielce, there's a small side on the road where cars can stop, not the comfiest but speeds are slow so you will probably get a car within 10-15 minutes","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":351,"lat":50.4399,"lon":21.2878,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Good bus stop towards Staszow, decent amount of traffic, might get a ride to Kielce, speeds are slow due to roundabout earlier, wait time of 5-20 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":352,"lat":50.4065,"lon":21.3828,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Good bus stop towards Polaniec, very good visiblity for cars, pretty wide for stopping also, wait time of 5 minutes","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":353,"lat":50.3497,"lon":21.4036,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Same story, wide entrances for houses, good traffic with speeds not that high, for short rides to get out of Mielec this is a very good road, direction Gawluszowice, wait time of 5 minutes","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":354,"lat":50.3225,"lon":21.4116,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Wide entrances to the houses, since there is traffic light before the speeds are low, quite some cars, good for going northbound and getting out of Mielec, ask for Gawluszowice, don't expect a long distance ride here tho, wait times of 5-10 minutes expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":356,"lat":50.572,"lon":21.868,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Not much of a shoulder after the roundabout but the speeds are slow and you can catch a car going towards Tarnobrzeg within 10 minutes, just don't go too far away from the roundabout since they tend to speed up there quite fast","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":358,"lat":50.7528,"lon":22.1032,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Stalowa Wola, great spot, you can just hitchhike in Zaklikow, wide sidewalks and speeds are slow, long straight part with good visibility, nice amount of traffic and locals are friendly, wait time of 5 minutes to be expected","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":361,"lat":51.3569,"lon":22.6211,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Excellent bus stop for going towards Lublin, nice big building where u can hitch in rain as the roof covers you pretty well, speeds are very low, a lot of traffic and most cars go to Lublin the least, expected wait time of 5 minutes here (side note: probably will be outdated once the new road S19 has been built but for now this is amazing spot)","date":"2025-06-18","rating":5}],"destLat":null,"destLon":null},{"id":365,"lat":52.561,"lon":22.9119,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Wide entrance to those buildings, direction Siemiatycze, decent traffic, after this the speeds go up and I wouldnt recommend walking any further, expected wait time of 5-20 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":366,"lat":52.6458,"lon":23.0374,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Towards Siemiatycze, the houses here have wide entranceways, as well as the speeds are slow, expected wait time of 5-15 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":371,"lat":53.753,"lon":23.4016,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Towards Augustow, low traffic, but literally first cars pick you up around here, expected wait time of 5-15 minutes, barely any villages on the road so most likely you will get a direct ride to Augustow, if you go to LT direction avoid Gruszki road and still use this and hitch further from Augustow","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":372,"lat":53.6637,"lon":23.3437,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"To Lipsk, just after roundabout, low traffic but first car usually stops since basically everyone here goes to Lipsk, expected wait time of 5-15 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":373,"lat":53.4662,"lon":23.4691,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Dirction Dabrowa Bialostocka, just after guardrails it is very good road for hitching, first or second car will stop, low traffic, but friendly people. Wait time of 5-15 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":374,"lat":53.1197,"lon":23.1969,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Instead of going as far as other reviewers suggest you can just come by here, it has some entryroad on right to some parking that nobody uses and you can just stand before that to signal cars to turn over there, it's wide enough for them to stop, wait time of 5-15 minutes expected for the least Zabludow, but quite some cars go to Bielsk Podlaski all the way also","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":376,"lat":53.8469,"lon":23.0412,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Towards Sejny/LT, good visibility, decent traffic, be aware that some cars use the road to go Lipsk road so stay a bit further towards Augustow on the side of the road, don't block anyone, wait time of 5-20 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":379,"lat":54.0206,"lon":23.3398,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Good visibility if going south, nice walk from the lakes to here, wait time of 5-15 minutes","date":"2025-06-12","rating":5}],"destLat":null,"destLon":null},{"id":384,"lat":53.9983,"lon":22.8275,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-06-02","comments":[{"text":"At first I was holding a sign for Kaunas, but then I decided to use my thumb. The first car that stopped was a Lithuanian who was going to Vilnius","date":"2025-06-02","rating":5}],"destLat":54.6786,"destLon":25.2631},{"id":386,"lat":51.1047,"lon":20.8397,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-05-30","comments":[{"text":"Waited on the other side of town for about 2.5 hours. Went here and got picked up pretty much immediately","date":"2025-05-30","rating":5}],"destLat":50.8154,"destLon":20.5016},{"id":392,"lat":53.8945,"lon":14.2392,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-05-07","comments":[{"text":"Nice spot for going out of Swinoujscie, got 3 offers within 15 minutes, a lot of locals, you could try to get with them past the newbuilt tunnel to the port roundabout, seemed like a very good spot also, but I just waited here for a longer ride, ( you could get a car to all the way to Gdansk and surely to Szczecin)","date":"2025-05-07","rating":5}],"destLat":null,"destLon":null},{"id":393,"lat":50.9384,"lon":14.9201,"rating":5,"reviews":1,"wait":1,"signal":"sign","lastUsed":"2025-05-07","comments":[{"text":"Dont know the exact spot on the road, we just walked down with a sign after getting out of our sleeping spot(I recommend ear plugs here you’ll find out why). Got a ride almost immediatelly to Zgorzelec. \r\n\r\nIf you come here take a look around the town, everything revolves around the huge power plant. Try to look local though, got kicked out by security when looking aroud. They thought we are green peace. They also made us delete our photos lol.","date":"2025-05-07","rating":5}],"destLat":51.1599,"destLon":15.0285},{"id":397,"lat":53.3378,"lon":14.4252,"rating":5,"reviews":1,"wait":90,"signal":null,"lastUsed":"2025-05-01","comments":[{"text":"Many cars passing here. Just be patient and you will get a ride to east.\r\nPro tip: don't take the ride if the person is not going far. Many people here can drive you to Gdansk or Warsaw","date":"2025-05-01","rating":5}],"destLat":54.4605,"destLon":17.3198},{"id":398,"lat":54.4506,"lon":17.3055,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-05-01","comments":[{"text":"Perfect hitchhiking spot! Under 5 minutes I got a ride close to Gdansk, where a was heading to.\r\nThursday afternoon","date":"2025-05-01","rating":5}],"destLat":54.4265,"destLon":18.5792},{"id":403,"lat":50.1027,"lon":19.8615,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-04-29","comments":[{"text":"Got quite lucky, but managed to get a hike to Kato in a few minutes. There's a place to stop for cars and you can easily get here by public transport.","date":"2025-04-29","rating":5}],"destLat":50.252,"destLon":19.0486},{"id":412,"lat":50.0505,"lon":18.7006,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-04-24","comments":[{"text":"Great stop, visible, very fast (lot of cars)","date":"2025-04-24","rating":5}],"destLat":50.0656,"destLon":18.6618},{"id":425,"lat":53.8056,"lon":21.9607,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Good bus station towards Elk, little traffic, mainly locals or people headed to Warszawa, second or third car picked up within 15 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":429,"lat":53.8415,"lon":21.3104,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Late in the evening towards Mikolajki, very little traffic and at winter not well plowed, but still first car picked up after 15 minutes (most traffic wintertimes goes either two of the other directions) this area is better during summer, pretty touristic :)","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":430,"lat":53.8376,"lon":20.7009,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Great spot towards Mragowo, decent amount of cars, got a ride within 5 minutes, long speedup lane for cars as well","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":434,"lat":53.5944,"lon":19.435,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"There's a small bus stop here towards the direction of Ilawa, little traffic and mostly local but got a ride with 10 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":435,"lat":53.6009,"lon":19.2584,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Not too much traffic, lots of locals, direction of Ilawa, got a ride with 5 minutes still","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":436,"lat":52.3249,"lon":14.622,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Amazing spot for going towards east, 1st car stopped, not too much traffic as morningtime, but seems like a great spot, you can get both cars from Slubice or from highway, wait time of 1 minute","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":438,"lat":51.2569,"lon":15.5187,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards Zgorzelec, a lot of traffic at slow speeds, as well as small parking lot next to cemetary and wide opening to that, got a car with first minute out here","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":447,"lat":52.1211,"lon":19.189,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Good long straight road towards north, got a ride within 5 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":448,"lat":52.0663,"lon":19.1971,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Good spot for going north, just make sure the car doesn't turn from the next junction, lots of locals tho, wait time of 5 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":449,"lat":51.8313,"lon":19.2859,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Small road with decent traffic, direction of Parzeczew, got a car within 5 minutes, you can honestly stand anywhere before or after the curve south from my location, everything will work","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":450,"lat":52.1109,"lon":20.4617,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Not too much of lights, neither it isn't the most used MOP, however I was here quite late in the evening, lots of cars going all over Poland, no foreign ones, also lots of truckers, got a ride within 30 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":455,"lat":52.2119,"lon":20.7395,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"There's a bus stop here, you can get with city bus from Warszawa to Koprki Agricoop bus stop and then walk a little here, waited for 10 minutes, not the best spot at dark tho, lots of locals","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":456,"lat":50.6231,"lon":20.2837,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Very good gas station, as well as Mcdonalds next to it, a lot of traffic going south does a stop here, first guy gave me a ride south","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":466,"lat":54.1067,"lon":23.2488,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards Suwalki, great spot, just walk til the bollards by sidewalk end so drivers can see you, straight road, first car stopped and picked me up, I also tried Krasnopol's turnway but it's way worse than here","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":467,"lat":54.1094,"lon":23.3337,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards Suwalki, wide old trucks weigh station or some sort of parking by side of the road, really easy for cars to stop, lots of locals but quite a busy road, got a ride within 10 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":472,"lat":53.3008,"lon":20.4373,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-12-17","comments":[{"text":"also quick","date":"2024-12-17","rating":5}],"destLat":54.4272,"destLon":18.4914},{"id":473,"lat":54.4287,"lon":18.4958,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-12-17","comments":[{"text":"we werent event trying","date":"2024-12-17","rating":5}],"destLat":54.4375,"destLon":18.5761},{"id":477,"lat":49.7044,"lon":20.1323,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2024-12-14","comments":[{"text":"Staliśmy w miejscu zaraz za przejazdem kolejowym, trochę miejsca żeby się zatrzymać, miła pani (godz. 13:30, sobota, grudzień)","date":"2024-12-14","rating":5}],"destLat":49.7451,"destLon":20.1335},{"id":481,"lat":50.6821,"lon":21.0339,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-11-08","comments":[{"text":"Best spot for going to Kielce. Waiting time from 5-60 min so far. Hitchhiking regularly from here.","date":"2024-11-08","rating":5}],"destLat":50.8724,"destLon":20.6244},{"id":482,"lat":50.8122,"lon":20.7334,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-11-08","comments":[{"text":"Most of the traffic from Kielce to Rzeszów goes here, guided by Google maps. The best spot for me to get to Raków, or further to Staszów, Rzeszów. Possible to get there with 11 (exactly) and 14 (500 m walk from last stop) public bus. I use it regularly.","date":"2024-11-08","rating":5}],"destLat":50.676,"destLon":21.045},{"id":483,"lat":50.8199,"lon":20.6887,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2024-11-08","comments":[{"text":"Bus stop. You can get there easy with public transport. Second best spot from Kielce to Staszów/Rzeszów (the best is in Niestachów skrzyżowanie crossroad)","date":"2024-11-08","rating":5}],"destLat":50.6704,"destLon":21.0491},{"id":485,"lat":54.1666,"lon":19.3571,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-10-27","comments":[{"text":"Was lucky, had a sign Ostroda and work instantly. On Wednesday afternoon","date":"2024-10-27","rating":5}],"destLat":53.6742,"destLon":19.9928},{"id":494,"lat":53.1756,"lon":23.1473,"rating":5,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2024-10-10","comments":[{"text":"Best spot as have more space. 1 km forward you can swim (under the bridge)","date":"2024-10-10","rating":5}],"destLat":53.1756,"destLon":23.1473},{"id":495,"lat":52.4021,"lon":21.1944,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2024-10-10","comments":[{"text":"Very good place to hitchike Lomza/Bialystok/LT/BY direction","date":"2024-10-10","rating":5}],"destLat":52.4021,"destLon":21.1944},{"id":497,"lat":50.7936,"lon":16.8449,"rating":5,"reviews":1,"wait":50,"signal":"sign","lastUsed":"2024-10-02","comments":[{"text":"On a way to Czech.","date":"2024-10-02","rating":5}],"destLat":50.4389,"destLon":16.6539},{"id":499,"lat":52.8285,"lon":18.3089,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2024-09-28","comments":[{"text":"Straight to the Inowrocław. This is the bus stop, cars are going slowly cause of the traffic lights","date":"2024-09-28","rating":5}],"destLat":52.7849,"destLon":18.2532},{"id":501,"lat":53.0851,"lon":18.6196,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2024-09-28","comments":[{"text":"Straight to city - Toruń","date":"2024-09-28","rating":5}],"destLat":53.0315,"destLon":18.612},{"id":502,"lat":53.3203,"lon":18.5048,"rating":5,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2024-09-28","comments":[{"text":"Bus stop, great to go to Toruń","date":"2024-09-28","rating":5}],"destLat":53.0864,"destLon":18.6199},{"id":503,"lat":53.6055,"lon":18.9396,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2024-09-28","comments":[{"text":"There is a Dino shop, cars are going slowly here. Easy to interract","date":"2024-09-28","rating":5}],"destLat":53.3213,"destLon":18.505},{"id":504,"lat":53.7185,"lon":18.9417,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-09-28","comments":[{"text":"I was going to the spot next to gas station and have my sign on my backpack. Car stopped me before i reached my orginal spot.","date":"2024-09-28","rating":5}],"destLat":53.6049,"destLon":18.9397},{"id":506,"lat":50.773,"lon":16.0095,"rating":5,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2024-09-18","comments":[{"text":"You can easily catch sth to Lubawka or somewhere to Czech Republik. Just wait next to road, there are two place where drivers can stop.\r\n@skazani.na.stopy","date":"2024-09-18","rating":5}],"destLat":50.6858,"destLon":15.9833},{"id":507,"lat":51.2837,"lon":16.1495,"rating":5,"reviews":1,"wait":60,"signal":"sign","lastUsed":"2024-09-18","comments":[{"text":"Great spot on the expressway. Mcdonalds, petrol station, showers and lots of truckers.\r\nYou can go around to ask people or stand on the way out of the McDonalds.\r\n@skazani.na.stopy","date":"2024-09-18","rating":5}],"destLat":51.0893,"destLon":16.184},{"id":509,"lat":52.2374,"lon":16.674,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-09-18","comments":[{"text":"We got a ride almost instantly, they where going to Legnica. Good spot on the expressway. @skazani.na.stopy","date":"2024-09-18","rating":5}],"destLat":51.284,"destLon":16.1496},{"id":511,"lat":49.4383,"lon":21.6902,"rating":5,"reviews":1,"wait":3,"signal":"ask","lastUsed":"2024-09-16","comments":[{"text":"A big station where all trucks stop when they're going to Slovakia, Hungary, Moldova, Romania and further. Once even the driver asked me first where I'm traveling when I arrived at the station, so it's really very easy. The best time is on Sunday evening because often the road to Slovakia is closed till 10pm and a lot of trucks are waiting for it to be open. There's a nice restaurant and you can exchange currency.","date":"2024-09-16","rating":5}],"destLat":47.8927,"destLon":21.5413},{"id":513,"lat":51.2244,"lon":17.2024,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2024-09-09","comments":[{"text":"Great spot for Warsaw. Got picked up super quick. Previous driver lived in Wrocław but was so kind and dropped me at this station.","date":"2024-09-09","rating":5}],"destLat":52.2028,"destLon":20.9427},{"id":531,"lat":52.2614,"lon":20.9526,"rating":5,"reviews":1,"wait":45,"signal":null,"lastUsed":"2024-08-29","comments":[{"text":"A bus stop is there, quite a lot of cars turn from the town to the E67 and E30 highway in direction of Lodz. Drivers are friendly.","date":"2024-08-29","rating":5}],"destLat":51.8977,"destLon":19.1808},{"id":534,"lat":54.2378,"lon":18.201,"rating":5,"reviews":1,"wait":2,"signal":null,"lastUsed":"2024-08-20","comments":[{"text":"traffic jam towards gdansk in the late afternoon on a sunday, immediately got a ride. cars can see you quite well and bus stop makes it easy to stop","date":"2024-08-20","rating":5}],"destLat":54.387,"destLon":18.5936},{"id":537,"lat":50.4987,"lon":16.3832,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-08-18","comments":[{"text":"Many cars, there is place to stop and also bus stop nearby, where they can stop as well, not so much cars, but we waited only 10 minutes to Kudowa Zdroj","date":"2024-08-18","rating":5}],"destLat":50.4987,"destLon":16.3832},{"id":542,"lat":52.2827,"lon":20.991,"rating":5,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2024-08-06","comments":[{"text":"Excelent spot to Białystok/Suwałki direction, big bus stop, huge traffic trucks and cars, you are very visiable here.","date":"2024-08-06","rating":5}],"destLat":52.2827,"destLon":20.991},{"id":544,"lat":53.5836,"lon":20.1812,"rating":5,"reviews":1,"wait":80,"signal":"sign","lastUsed":"2024-08-06","comments":[{"text":"A good place to get a lift towards Gdansk. A lot of relevant traffic as well as a Subway at this station.","date":"2024-08-06","rating":5}],"destLat":54.3552,"destLon":18.6455},{"id":547,"lat":50.6081,"lon":16.8246,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2024-08-05","comments":[{"text":"Very good spot","date":"2024-08-05","rating":5}],"destLat":51.042,"destLon":16.9697},{"id":551,"lat":52.5101,"lon":21.3944,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-07-26","comments":[{"text":"Drivers stops really often but you would probably only be possible to get ride to Wyszków","date":"2024-07-26","rating":5}],"destLat":52.6208,"destLon":21.5017},{"id":552,"lat":50.7969,"lon":16.0396,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-07-19","comments":[{"text":"Cars have plenty of space for stopping and they don’t go fast. Great spot for getting to Wroclaw.","date":"2024-07-19","rating":5}],"destLat":51.0966,"destLon":17.0262},{"id":554,"lat":53.9985,"lon":22.8246,"rating":5,"reviews":1,"wait":30,"signal":"ask","lastUsed":"2024-07-18","comments":[{"text":"Not hell. Got a direct ride to Vienna through a night over in Warsaw.","date":"2024-07-18","rating":5}],"destLat":48.1853,"destLon":16.4541},{"id":556,"lat":51.1542,"lon":15.0315,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-07-17","comments":[{"text":"Very good spot, many cars passing to jelenia gora and enough place to stop without blocking traffic, also good visibility from far. Even a bit of shade under the trees.","date":"2024-07-17","rating":5}],"destLat":50.8998,"destLon":15.7347},{"id":563,"lat":53.7091,"lon":19.9784,"rating":5,"reviews":1,"wait":null,"signal":"sign","lastUsed":"2024-07-06","comments":[{"text":"Great spot to go towards Gdans. Big gas station, planty of drivers to ask for a ride.","date":"2024-07-06","rating":5}],"destLat":54.351,"destLon":18.6328},{"id":565,"lat":53.1875,"lon":22.0878,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2024-07-03","comments":[{"text":"you dont even need to go all the way, this spot is completely sufficent","date":"2024-07-03","rating":5}],"destLat":53.6788,"destLon":22.4382},{"id":566,"lat":52.1557,"lon":20.6871,"rating":5,"reviews":1,"wait":30,"signal":"ask","lastUsed":"2024-07-03","comments":[{"text":"Wanted to get to Poznan/Berlin, got lucky and found a ride to Brussels.\r\nGreat spot for going west.\r\nIf u get there on foot, u have to get over a 2m fence or wait until someone goes out and it opens","date":"2024-07-03","rating":5}],"destLat":50.8944,"destLon":4.6879},{"id":567,"lat":50.7844,"lon":19.0045,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-07-03","comments":[{"text":"Little bit far from centre, but imo best spot from Czestochowa towards west (Opole, Wroclaw, etc.) Cars are driving slow and very visible spot from far!","date":"2024-07-03","rating":5}],"destLat":50.7028,"destLon":18.7346},{"id":571,"lat":53.7696,"lon":20.3441,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2024-06-30","comments":[{"text":"Very good spot, but hard to get to. Traffic merges into one lane and goes slow, as this is a very popular spot for police traffic control stops. They allowed me to hitchike here.","date":"2024-06-30","rating":5}],"destLat":53.7081,"destLon":19.9778},{"id":572,"lat":50.3569,"lon":18.9365,"rating":5,"reviews":1,"wait":null,"signal":"sign","lastUsed":"2024-06-25","comments":[{"text":"2 people waiting, we had a sign. Took a moment, but eventually got a ride. Make sure you're visible","date":"2024-06-25","rating":5}],"destLat":50.7474,"destLon":19.046},{"id":577,"lat":52.5647,"lon":17.6116,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2024-05-31","comments":[{"text":"It’s a good spot to go to znin and after !","date":"2024-05-31","rating":5}],"destLat":null,"destLon":null},{"id":578,"lat":51.9945,"lon":21.2091,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-05-26","comments":[{"text":"Good spot for hitchiking, there is a bus bay in which driver can easily stop","date":"2024-05-26","rating":5}],"destLat":52.0825,"destLon":21.1315},{"id":580,"lat":53.3948,"lon":14.5023,"rating":5,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2024-05-13","comments":[{"text":"Good Spot. The cars can stop very good. A lot of German cars. Got a ride to Berlin.","date":"2024-05-13","rating":5}],"destLat":52.5046,"destLon":13.3159},{"id":581,"lat":53.2627,"lon":14.4946,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2024-05-11","comments":[{"text":"Very good for direction Stettin","date":"2024-05-11","rating":5}],"destLat":53.4116,"destLon":14.5504},{"id":590,"lat":49.9845,"lon":19.9129,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-05-01","comments":[{"text":"Wanted to go to budapest, taken to rabka zdrój.","date":"2024-05-01","rating":5}],"destLat":49.6056,"destLon":19.9268},{"id":592,"lat":50.0745,"lon":18.6625,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-04-27","comments":[{"text":"Great spot, it's very easy to find a lift to Brno and many cars are going to Austria.","date":"2024-04-27","rating":5}],"destLat":49.2596,"destLon":16.991},{"id":596,"lat":50.8428,"lon":16.4612,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-04-24","comments":[{"text":"Good spot. Position yourself behind the roundabout, before the bus stop.","date":"2024-04-24","rating":5}],"destLat":50.7708,"destLon":16.2742},{"id":606,"lat":52.0001,"lon":16.5277,"rating":5,"reviews":1,"wait":5,"signal":"ask-sign","lastUsed":"2024-04-19","comments":[{"text":"Lots of cars here, but I'm not sure if most of them go to leszno. I asked around and got really lucky - got ride to Wroclaw.","date":"2024-04-19","rating":5}],"destLat":51.225,"destLon":17.2029},{"id":609,"lat":50.2515,"lon":18.8814,"rating":5,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2024-04-07","comments":[{"text":"Had a sign to Krakow, immediately got a lift after getting dropped off here!","date":"2024-04-07","rating":5}],"destLat":50.0515,"destLon":19.9867},{"id":611,"lat":50.5762,"lon":19.0512,"rating":5,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2024-03-25","comments":[{"text":"asking around, was pretty busy :))","date":"2024-03-25","rating":5}],"destLat":50.8474,"destLon":19.0452},{"id":618,"lat":49.6229,"lon":18.8745,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2024-01-03","comments":[{"text":"We left for Katowice, shop nearby and good stopping point for cars","date":"2024-01-03","rating":5}],"destLat":50.2551,"destLon":19.0172},{"id":620,"lat":49.5974,"lon":19.9191,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-11-12","comments":[{"text":"Bus stop in the direction of Slovakia, I prepared a \"SK\" sign and got a lift after 5 minutes","date":"2023-11-12","rating":5}],"destLat":49.3675,"destLon":19.8169},{"id":624,"lat":53.8865,"lon":18.6288,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-10-13","comments":[{"text":"Hey, i used that spot three times, usually i was waiting for 30 minutes, always caught a car going to the south","date":"2023-10-13","rating":5}],"destLat":52.404,"destLon":16.9165},{"id":625,"lat":49.9593,"lon":18.524,"rating":5,"reviews":1,"wait":45,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"pretty decent spot worked for us we got a ride at 6:45 am with a 45 minute wait and got a hitch all the way to Graz, Austria","date":"2023-10-12","rating":5}],"destLat":49.9596,"destLon":18.5241},{"id":627,"lat":50.3578,"lon":18.9363,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"Great spot to go to Katowice","date":"2023-10-12","rating":5}],"destLat":50.2699,"destLon":18.9958},{"id":630,"lat":49.826,"lon":19.0983,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"I've got a ride easier than I thought. The person was going to Vienna.","date":"2023-10-12","rating":5}],"destLat":49.6722,"destLon":18.3288},{"id":638,"lat":50.4677,"lon":17.956,"rating":5,"reviews":1,"wait":4,"signal":null,"lastUsed":"2023-09-16","comments":[{"text":"Good spot for going south.","date":"2023-09-16","rating":5}],"destLat":50.4677,"destLon":17.956},{"id":640,"lat":53.0967,"lon":17.9037,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-09-15","comments":[{"text":"good spot for Poznań, a lot of cars going in that direction with Poznań license plates","date":"2023-09-15","rating":5}],"destLat":52.3541,"destLon":16.8405},{"id":642,"lat":51.6009,"lon":19.9203,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-09-14","comments":[{"text":"Good spot to Lodz","date":"2023-09-14","rating":5}],"destLat":51.7143,"destLon":19.4708},{"id":643,"lat":53.1194,"lon":22.0323,"rating":5,"reviews":1,"wait":null,"signal":null,"lastUsed":"2023-09-13","comments":[{"text":"I had a sign Warszawa hanging off my backpack, a car stopped even before i got to the spot. I didnt even put a thumb out.","date":"2023-09-13","rating":5}],"destLat":53.1655,"destLon":21.9783},{"id":651,"lat":53.7704,"lon":20.3657,"rating":5,"reviews":1,"wait":3,"signal":null,"lastUsed":"2023-09-04","comments":[{"text":"good spot, cars don't go so fast after the roundabout, a lot of space and it is safe for them to stop","date":"2023-09-04","rating":5}],"destLat":54.1518,"destLon":19.3912},{"id":654,"lat":52.2986,"lon":15.2538,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-08-30","comments":[{"text":"Good spot","date":"2023-08-30","rating":5}],"destLat":52.2986,"destLon":15.2539},{"id":656,"lat":52.2292,"lon":15.5471,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-08-30","comments":[{"text":"20 minutes to find someone who is going to south","date":"2023-08-30","rating":5}],"destLat":52.2292,"destLon":15.5471},{"id":660,"lat":51.5146,"lon":19.9055,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-08-23","comments":[{"text":"KFC near, nice spot","date":"2023-08-23","rating":5}],"destLat":49.9179,"destLon":18.4289},{"id":671,"lat":50.8272,"lon":15.5249,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-08-09","comments":[{"text":"Very good spot behind the taxi parking.","date":"2023-08-09","rating":5}],"destLat":50.8948,"destLon":15.7324},{"id":676,"lat":50.7477,"lon":19.0459,"rating":5,"reviews":1,"wait":45,"signal":null,"lastUsed":"2023-08-04","comments":[{"text":"Dobre miejsce, ale więcej osób jedzie w stronę Warszawy niż Gliwic. W końcu ktoś się zgodził nas zabrać na południe.","date":"2023-08-04","rating":5}],"destLat":50.0744,"destLon":18.6623},{"id":678,"lat":51.0847,"lon":19.3799,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-08-04","comments":[{"text":"Super miejsce. Duży ruch.","date":"2023-08-04","rating":5}],"destLat":50.9104,"destLon":19.2097},{"id":681,"lat":49.8699,"lon":19.5472,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-08-03","comments":[{"text":"Direction: krakow / crakow\r\nCars drive slowly. I used this spot twice in the morning on sundays during summer. I waited first time 5 min and secound time 20 minutes.","date":"2023-08-03","rating":5}],"destLat":50.0553,"destLon":19.9394},{"id":685,"lat":50.369,"lon":20.0455,"rating":5,"reviews":1,"wait":3,"signal":null,"lastUsed":"2023-07-31","comments":[{"text":"Best spot ever! Got offers every minute or so, could pick and choose the best one!","date":"2023-07-31","rating":5}],"destLat":52.2173,"destLon":20.8725},{"id":686,"lat":50.8149,"lon":20.5016,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-07-31","comments":[{"text":"2023- the bus stop is a nice spot, with good visibility and traffic- got offers to Krakow really fast, but no one going to Warsaw in any direction, it's better to get back on the highway in Krakow direction and switch sides","date":"2023-07-31","rating":5}],"destLat":49.9989,"destLon":19.9525},{"id":689,"lat":52.155,"lon":20.6884,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-29","comments":[{"text":"Best spot to get through Warszawa to east border of Poland and Lithuania.","date":"2023-07-29","rating":5}],"destLat":52.8661,"destLon":22.0136},{"id":690,"lat":49.9725,"lon":18.5348,"rating":5,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-07-29","comments":[{"text":"Best spot to the highway A1 and get ride to Katowice.","date":"2023-07-29","rating":5}],"destLat":50.0769,"destLon":18.664},{"id":691,"lat":49.7068,"lon":20.7642,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2023-07-29","comments":[{"text":"instant spot, stood there behind the hill for 5 seconds and caught a car that took us 15kms to the south","date":"2023-07-29","rating":5}],"destLat":49.707,"destLon":20.7641},{"id":698,"lat":54.0438,"lon":22.4663,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-07-13","comments":[{"text":"Many cars gaining speed after the crossroads, but you are easily visible and there is much space to stop. Got a ride directly to Gdańsk after 20 mins.","date":"2023-07-13","rating":5}],"destLat":54.3281,"destLon":18.5832},{"id":699,"lat":54.0967,"lon":22.6435,"rating":5,"reviews":1,"wait":3,"signal":null,"lastUsed":"2023-07-13","comments":[{"text":"A good spot to hitchhike as the cars are climbing the hill and you are easily visible. Got a ride to Olecko after 3 minutes.","date":"2023-07-13","rating":5}],"destLat":54.0438,"destLon":22.4663},{"id":700,"lat":54.091,"lon":22.8633,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-07-13","comments":[{"text":"Many cars with low speed as they are leaving the roundabout. We were standing with the sign \"Gdańsk\", got a ride to Bakałarzewo after 5 minutes.","date":"2023-07-13","rating":5}],"destLat":54.0954,"destLon":22.6463},{"id":718,"lat":49.6312,"lon":20.6456,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-05-19","comments":[{"text":"It's a bus stop, I caught car for 130 km to Kęty","date":"2023-05-19","rating":5}],"destLat":49.8796,"destLon":19.2225},{"id":720,"lat":49.8523,"lon":19.0278,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-05-02","comments":[{"text":"If you want to go south (for example Bulgaria, Romania) it is better to stand with two signs with different directions (Brno, Zylina). In the evening (Saturday) there is not a lot of traffic. Drivers often stop there to buy highway ticket so you can always ask for a drive.","date":"2023-05-02","rating":5}],"destLat":49.7621,"destLon":18.6084},{"id":735,"lat":54.3474,"lon":18.6696,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-04-14","comments":[{"text":"It is a perfect spot. I did get a ride to Warsaw in less than 15 minutes.\r\nIt is very convenient bus stop \"Brama Żuławska 04\". You can get there easily by the public transportation.\r\nIt was Friday approx 11:00 (am)","date":"2023-04-14","rating":5}],"destLat":52.2435,"destLon":21.0017},{"id":739,"lat":52.4579,"lon":21.2933,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2023-03-29","comments":[{"text":"We (2 people) got a ride here after only 1 minute on a weekday, after somebody drove us here from Warsaw. And they drove us straight to Riga (about 8h). Very funny ride with three Georgians we squeezed in the car with. They were very hospitable and even invested us to several beers and burgers. I guess we got very lucky, but it seems like a decent spot.","date":"2023-03-29","rating":5}],"destLat":56.9014,"destLon":24.1021},{"id":740,"lat":51.1879,"lon":15.1063,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-03-27","comments":[{"text":"Very good spot to go to Germany","date":"2023-03-27","rating":5}],"destLat":51.1881,"destLon":15.1063},{"id":748,"lat":49.9267,"lon":21.8757,"rating":5,"reviews":1,"wait":5,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Direction: Bieszczady\r\nFrom the bus stop","date":"2023-01-03","rating":5}],"destLat":49.9267,"destLon":21.8757},{"id":750,"lat":51.0889,"lon":22.3665,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Direction: Rzeszów\r\nÓn the bus stop","date":"2023-01-03","rating":5}],"destLat":51.0889,"destLon":22.3665},{"id":757,"lat":52.5799,"lon":14.6296,"rating":5,"reviews":1,"wait":30,"signal":null,"lastUsed":"2022-11-29","comments":[{"text":"na Berlin","date":"2022-11-29","rating":5}],"destLat":52.4175,"destLon":13.4033},{"id":759,"lat":52.6982,"lon":15.232,"rating":5,"reviews":1,"wait":15,"signal":null,"lastUsed":"2022-11-29","comments":[{"text":"wjazd na autostradę, można złapać stopa w kierunku Zielonej Góry lub Świebodzina","date":"2022-11-29","rating":5}],"destLat":51.9218,"destLon":15.5113},{"id":293,"lat":50.0808,"lon":19.7729,"rating":4.93,"reviews":15,"wait":27,"signal":"ask","lastUsed":"2025-07-21","comments":[{"text":"Szybko złapaliśmy pierwsze lepsze auto, panowie do Szwajcarii jechali.","date":"2025-07-21","rating":5},{"text":"The bus ride here was long but worth it, found a ride to Wroclaw after 5 minutes of asking around. There is a corner in the fence that has supports that makes it easy to jump.","date":"2024-08-07","rating":5},{"text":"Spot is ok, you can get there via bus 209. I relocated here after the spot near the jan paweł II airport didn't work out.  Warning: if you're going from the side of the bus stop [balice winna góra], there's a closed gate at the back that you have to jump through. There is no break in the fence.","date":"2023-05-06","rating":4},{"text":"Easy to get there by bus and easy to catch a car. Me: about 20 min","date":"2016-08-18","rating":5},{"text":"I came there (alone girl) on early Sunday afternoon (during long weekend in Poland) and asked first of many passenger cars doing a break there, they agreed to picked me up to the lastgas station before exit to A1 that I needed. Three Polish guys travelled to Hamburg so I could go there with them (unfortunatelly I had no time for the trip ;-)","date":"2016-08-16","rating":5}],"destLat":49.26,"destLon":16.9919},{"id":549,"lat":52.3508,"lon":16.7324,"rating":4.92,"reviews":26,"wait":32,"signal":"sign","lastUsed":"2024-07-31","comments":[{"text":"Stright ride to Berlin","date":"2024-07-31","rating":5},{"text":"A2","date":"2024-05-01","rating":5},{"text":"Got a ride to the Berlin ring in about 10-15 minutes and a ride thru across the highway with cops xd because we were on the wrong side just stand in the parking for trucks after the toll booths","date":"2023-08-04","rating":5},{"text":"Not a great spot for me. I started before the toll booth trying to get a ride to Berlin or Leipzig, and a service guy came out and escorted to the parking lot after the toll booth. This was very quiet, with only a few trucks around. Pretty frustrating, but I finally got a ride to a station near the border.","date":"2023-07-17","rating":3},{"text":"Got a ride to a station at the border","date":"2023-02-20","rating":5}],"destLat":52.5057,"destLon":13.3978},{"id":278,"lat":52.3139,"lon":15.7824,"rating":4.88,"reviews":8,"wait":27,"signal":"thumb","lastUsed":"2025-07-29","comments":[{"text":"Got ride in no time","date":"2025-07-29","rating":5},{"text":"Busy spot, we stood with sign at the exit.","date":"2025-07-22","rating":5},{"text":"Good spot, got a ride to the border, ppl are going to Berlin/Hanover/Hamburg. Standing with a sign in Poland won’t do much for you, so have a chat and you will get somewhere.","date":"2023-08-20","rating":4},{"text":"Me and my friend (two guys) found a ride here straight to Berlin in 20min (it was sunday evening). You can ask people on the gas station or stay just after Mcdonalds (people are in good mood after the meal haha) or stay right on the exit.","date":"2017-09-13","rating":5},{"text":"waited sth like 30min to get a ride to hannover, it was friday, 2PM","date":"2015-09-18","rating":5}],"destLat":52.1858,"destLon":11.4486},{"id":12,"lat":51.8027,"lon":19.4937,"rating":4.86,"reviews":7,"wait":9,"signal":"sign","lastUsed":"2026-01-24","comments":[{"text":"This is a perfect spot towards Warsaw, and I wanted to avoid Warsaw, so I went to Lowicz.  Guy stopped here almost immediately and got me a bag full of groceries.","date":"2026-01-24","rating":5},{"text":"A fair amount of traffic at low speed. Easy for the cars to stop and with tram 6 almost going to the spot from center.","date":"2025-07-27","rating":5},{"text":"Someone behind us asked if he could help us, we're two guys with big backpacks, he brought us to the entrance of the highway to Warsaw","date":"2023-07-13","rating":4},{"text":"Great place, indeed!","date":"2015-03-13","rating":5},{"text":"There is even a bakery for having breakfast ! The bus stop is nice place to stop cars.","date":"2014-08-30","rating":5}],"destLat":52.1229,"destLon":19.9443},{"id":647,"lat":53.339,"lon":14.424,"rating":4.83,"reviews":6,"wait":102,"signal":null,"lastUsed":"2023-09-12","comments":[{"text":"Quite a nice place. You can rest here and talk with locals. I was trying to ask someone to give me a lift, but at first people seemed to be quite rude. Then I stood with a sign that I want to get to Germany and after around 2 hours a crazy cool guy stopped and took me directly to Denmark! You can get really lucky here","date":"2023-09-12","rating":4},{"text":"Was here with a scouting group (well, first at the other station on the west which is useless).\n\nWe managed to get out of here within a time span of less than 2 hours. That's 23 people straight to Berlin!\n\nAlso, if you're coming from the bus stop and look at this direction and see a derelict station: you're looking at something else! this is further along (that's what sent me to the other, useless station)","date":"2015-12-15","rating":5},{"text":"suprisingly long wait, but some days are just like that. good spot","date":"2015-02-21","rating":5},{"text":"Tracks crossable - don't be shy. From a German POV: worth riding into Poland to get to this place, if stuck in north and going to Berlin.","date":"2011-11-27","rating":5},{"text":"Should be easy to find a truck going to Germany.\nA guy from the gas station's crew offered to keep an eye on my things while I go around and ask. Really good spot.","date":"2011-07-26","rating":5}],"destLat":55.5305,"destLon":9.4645},{"id":205,"lat":51.8995,"lon":19.7064,"rating":4.8,"reviews":5,"wait":15,"signal":"thumb","lastUsed":"2025-08-18","comments":[{"text":"Solo, m\r\nMonday morning\r\nBig petrol station, Thumbed with a sign Berlin, got a ride to Poznan. Poznan is a bit of a dead spot though, so you might want to considering taking a lift that takes you further","date":"2025-08-18","rating":4},{"text":"Good spot, got ride far behind Poznań","date":"2025-07-29","rating":5},{"text":"Me and my friend got a ride around the sunset straight to Hannover with a guy who was driving to Düsseldorf. So we drove the whole night until the sunrise, which was perfect. :)","date":"2025-07-22","rating":5},{"text":"MOP Nowostawy service station, dir. Poznan / Berlin, last station before junction Strykow (dir. Gdansk / Katowice)","date":"2015-04-11","rating":5}],"destLat":52.3499,"destLon":16.8361},{"id":510,"lat":50.012,"lon":21.9676,"rating":4.8,"reviews":5,"wait":13,"signal":"thumb","lastUsed":"2024-09-16","comments":[{"text":"Majority of the cars are from Rzeszów and don't going outside of the city so you have to watch the license plates.","date":"2024-09-16","rating":4},{"text":"Very fast, but note: I was a girl, alone. \r\nLocation seems nice. There is a gas station, but early in the morning it was mostly empty.\r\nNext to it there is a bus stop and it turned out to be a perfect hitchhiking spot! \r\n2 minutes or less waiting","date":"2023-09-07","rating":5},{"text":"Great place indeed. lift for Barwinek, Sanok, Krosno guaranteed","date":"2017-04-20","rating":5},{"text":"Last bus stop (near to the gas station) is the best place - lot of cars slows down here.","date":"2016-08-08","rating":5},{"text":"Very good place at a bus stop of the border to Barwinek.","date":"2013-07-29","rating":5}],"destLat":49.8065,"destLon":21.8846},{"id":644,"lat":50.0726,"lon":18.6626,"rating":4.8,"reviews":5,"wait":45,"signal":null,"lastUsed":"2023-09-13","comments":[{"text":"After 20 minutes we get a ride to Hungary Gyor","date":"2023-09-13","rating":5},{"text":"It isn't the best spot- people weren't so happy to see us asking for a ride - but it's a MOP near main road that can take you near Ostrava, then to Olomouc and than to Brno. We met a cute, polish couple who took us because their destination was Czech Republic. There are clean toalets for free and a huge parking.","date":"2023-08-11","rating":4},{"text":"Good spot, comfortable for searching for a driver. Many people going in direction of Czechia, Austria. Free toilet and nice staff.","date":"2023-08-01","rating":5},{"text":"Good spot in direction of Cieszyn, Ostrava, Brno. We waited one hour, thursday 1 p.m.","date":"2023-07-27","rating":5}],"destLat":50.0736,"destLon":18.6631},{"id":266,"lat":50.371,"lon":18.7451,"rating":4.75,"reviews":4,"wait":7,"signal":"thumb","lastUsed":"2025-08-03","comments":[{"text":"not a lot of traffic on a sunday afternoon. I was standing near the highway exit and declined 9 cars going to cities close by or different directions. 10th car took me almost to warsaw. so i reccomend using a sign.","date":"2025-08-03","rating":4},{"text":"Took a number 57 bus from Gliwice and walked 2,5km through forest and fields (see on maps) there is a open door hugging the bridge near here, so you can get here by walking. Had a sign saying Warszawa","date":"2024-07-28","rating":5},{"text":"Lot of cars from Belarus or Lithuania and trucks which are driving the direction to east border of Poland. Best spot when u want to get through Warszawa.","date":"2023-07-29","rating":5},{"text":"I catch truck straight to Gdańsk, 520 kilometers","date":"2023-05-19","rating":5}],"destLat":51.9942,"destLon":20.9341},{"id":309,"lat":50.8931,"lon":20.6774,"rating":4.75,"reviews":4,"wait":26,"signal":null,"lastUsed":"2025-07-06","comments":[{"text":"Got ride almost to Warsaw. Can't think of better spot on that direction.","date":"2025-07-06","rating":5},{"text":"Ok spot, cars coming slowly from around the curve, and plenty of space to stop. Waited for about 30 min, finally got a ride to a small town further ahead","date":"2023-05-21","rating":4},{"text":"Good place to catch hitchhiking towards Warsaw (Radom, Skarżysko-Stone)\nIt is a land of places on the side of the road with a stop. The waiting period is approx. 15 min.","date":"2015-03-23","rating":5}],"destLat":51.9694,"destLon":20.8337},{"id":522,"lat":52.1002,"lon":20.8848,"rating":4.71,"reviews":7,"wait":45,"signal":"sign","lastUsed":"2024-09-06","comments":[{"text":"Best hitchhiking spot I’ve seen in my life so far. Cars coming in from 3 directions, traffic lights & good space to stop. Got a ride from Warsaw to Radom in literally 4 minutes","date":"2024-09-06","rating":5},{"text":"Technically this is a perfect spot, enough space for cars to stop,  the direction is clear and they can easily see you. Maybe I was just unlucky or it was the wrong time of the day,  but I had to wait over 3 hours.. Got a lift to kielce in the end though","date":"2023-11-09","rating":3},{"text":"Trafic lights and bus stop , ideal spot to catch a ride to krakow","date":"2023-04-29","rating":5},{"text":"Best spot ot get to Krakow. You can also find a car to Radom, but you'll wait a little bit longer (max. of 10 mins.)","date":"2023-02-20","rating":5},{"text":"Good place if you want to travel to Kraków. Got lift in less than 5 minutes, but I was very lucky :)","date":"2015-06-27","rating":5}],"destLat":50.8105,"destLon":20.5401},{"id":41,"lat":50.9891,"lon":16.9492,"rating":4.67,"reviews":9,"wait":9,"signal":"sign","lastUsed":"2025-11-25","comments":[{"text":"First car took me to ząbkowice","date":"2025-11-25","rating":5},{"text":"This is still the best spot to go south. It was so much better, before they build roundabout. Now there is no big bus stop as it was, so it can be more difficult","date":"2025-10-12","rating":4},{"text":"Got a ride rather quick but only a short distance.","date":"2023-05-24","rating":4},{"text":"It's great place to go to Klodzko and than to the border. We waited about 20 minutes","date":"2015-10-23","rating":5},{"text":"2 cars in 10 minutes :)","date":"2015-04-13","rating":5}],"destLat":50.6075,"destLon":16.8228},{"id":76,"lat":52.4594,"lon":21.2958,"rating":4.67,"reviews":9,"wait":36,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"With a sign saying LT, got a ride to Kaunas within an hour. Definitely stand at the bus stop at the exit instead of the gas station parking, that way you’ll catch all the traffic.","date":"2025-10-15","rating":4},{"text":"Great spot","date":"2025-10-06","rating":5},{"text":"Couple, ~25yo. Sunny morning. Gas station with mcdonalds. Waited a while and a girl approached us and offered a ride.","date":"2025-08-19","rating":5},{"text":"lot of traffic, declined 5 cars going to bialystok, ostrow and wyzskow and got a ride to suwalki!","date":"2025-08-04","rating":5},{"text":"Tons of room and traffic but everyone goes a different direction so we suggest to just take a short trip if offered, not worth to wait for the 400km trip.","date":"2025-07-17","rating":4}],"destLat":54.9183,"destLon":23.9862},{"id":413,"lat":52.3279,"lon":17.0925,"rating":4.67,"reviews":6,"wait":21,"signal":"thumb","lastUsed":"2025-04-06","comments":[{"text":"We were lucky, ride took all the way to Kaunas","date":"2025-04-06","rating":5},{"text":"More suitable for going North. I left the highway by accident because my driver wanted to avoid the toll.","date":"2024-12-18","rating":4},{"text":"Heading towards Mazury, got a ride in 30 minutes. Pretty good spot, 30 minutes walking from Tulce/Kościół bus stop, you will sometimes have to jump the fence, but for us, seciurity opened the gate","date":"2024-05-06","rating":4},{"text":"Someone asked us after our lunch at the petrol station, so we waited just 1 minute to go to Warsaw. We were very lucky!","date":"2015-10-31","rating":5},{"text":"At night it's perfect, during the day it might be better to stand at the toll just a few km west.","date":"2014-10-20","rating":5}],"destLat":54.8105,"destLon":23.8729},{"id":724,"lat":50.0568,"lon":21.9634,"rating":4.67,"reviews":6,"wait":46,"signal":null,"lastUsed":"2023-05-01","comments":[{"text":"We were waiting 40 minutes for car to Krakow and then we found a car to Debica.","date":"2017-12-09","rating":5},{"text":"There are a lot of cars which are going to Krakow. We've been waiting only for 20 minutes","date":"2017-12-03","rating":5},{"text":"Waiting 15 min to Krakow","date":"2016-08-02","rating":4},{"text":"to Krakow","date":"2014-04-26","rating":5}],"destLat":50.0511,"destLon":21.9621},{"id":91,"lat":52.0648,"lon":20.7452,"rating":4.67,"reviews":3,"wait":37,"signal":"sign","lastUsed":"2025-09-30","comments":[{"text":"I think this is the best spot towards Katowice after they finished all new roads constructions. For sure spots in Warsaw are worse than earlier. Got a ride to Katowice in about 25min on early Monday morning. Reachable with 733 bus.","date":"2025-09-30","rating":5},{"text":"sign for katowice helped, less traffic than expected for 19:00 with a mcdonalds. no luck asking so stood by the exit, where you are visible to all cars from reasonably far :)","date":"2024-08-20","rating":4},{"text":"Nice spot","date":"2023-08-23","rating":5}],"destLat":50.5748,"destLon":19.0495},{"id":127,"lat":52.169,"lon":20.9796,"rating":4.67,"reviews":3,"wait":17,"signal":"sign","lastUsed":"2025-09-07","comments":[{"text":"We are heading towards Krakow -> Budapest. A lot of cars, good contact with people - they see the inscription, they react. Unfortunately, a lot of local drivers - you have to count on the fact that one of them will give you a drive to a better location - e.g. MOP Grójec. From where it should be easier to go to catch something to Krakow.","date":"2025-09-07","rating":4},{"text":"Put my the thumb out and the first car stopped.","date":"2025-05-30","rating":5},{"text":"We made a sign of destination (Krakow), after 10 minutes we got a direct ride to our destination. Recommend place","date":"2023-07-07","rating":5}],"destLat":51.8797,"destLon":20.855},{"id":267,"lat":50.1158,"lon":18.5483,"rating":4.67,"reviews":3,"wait":15,"signal":"thumb","lastUsed":"2025-08-03","comments":[{"text":"bus stop direction Gliwice","date":"2025-08-03","rating":4},{"text":"The place there is very good. It was a day with no traffic at all (Sunday) and the second car pick us up (a girl and me)","date":"2014-01-06","rating":5},{"text":"There's a bus stop. IMHO the best place to hitch towards Gliwice. Got a lift in less than 5 min.","date":"2013-04-30","rating":5}],"destLat":50.2607,"destLon":18.6564},{"id":307,"lat":51.9449,"lon":19.1793,"rating":4.67,"reviews":3,"wait":17,"signal":null,"lastUsed":"2025-07-08","comments":[{"text":"Not a bad spot at all, quite a few cars going through all the time.","date":"2025-07-08","rating":4},{"text":"easter monday 8PM, was hitch hiking to Bremen. 10min after I arrived a car with licence plate from Bremen took me all the way, so had big luck, but i guess this place is also good to ask drivers in general to get west.","date":"2015-04-07","rating":5}],"destLat":52.1528,"destLon":18.2778},{"id":326,"lat":50.0839,"lon":19.7883,"rating":4.67,"reviews":3,"wait":23,"signal":null,"lastUsed":"2025-06-27","comments":[{"text":"caught a car to katowice in 5 min. this is part of free of charge road, so people here are more flexible))","date":"2015-09-04","rating":5},{"text":"I just wait 30 seconds for have a car in Berlin Direction, where the road are split it in to, for Berlin and for Dresden","date":"2013-08-08","rating":5}],"destLat":50.2478,"destLon":19.0074},{"id":614,"lat":49.9888,"lon":20.5912,"rating":4.67,"reviews":3,"wait":5,"signal":null,"lastUsed":"2024-03-19","comments":[{"text":"VERY good in direction Krakow, cars stopped for me within minutes. Unfortunately I am going the opposite direction. Better luck hitching directly from the highway when heading eastward.","date":"2024-03-19","rating":4},{"text":"Good if you're going to Kraków. I'd spent 40 minutes waiting for a lift to Rzeszów when I decided to go to Kraków instead, once I changed my sign I literally waited just a few seconds for the first car to stop.","date":"2014-05-05","rating":5},{"text":"There You can easy find car to direction Kraków[west] or Tarnów[east]. You should hitchhike before parking. It's not problem at night because there is many lights, good and easy place. :)","date":"2013-10-17","rating":5}],"destLat":49.9265,"destLon":20.5376},{"id":703,"lat":51.8815,"lon":19.5824,"rating":4.67,"reviews":3,"wait":13,"signal":null,"lastUsed":"2023-07-13","comments":[{"text":"We're two guys with big backpacks, got a ride to Warsaw on thursday afternoon. A very kind man who didn't speak any English put effort into dropping us off in a good place.","date":"2023-07-13","rating":4},{"text":"Probably all cars from Łódź going direction Warsaw (and some for Poznań) pass this place. The spot has enough place for a car to stop safely, without disturbing others. In addition, often there is a traffic jam before the roundabout, so cars go slowly and you have a pretty good chance of being noticed.","date":"2014-04-16","rating":5}],"destLat":52.2278,"destLon":20.9773},{"id":711,"lat":52.1115,"lon":20.4655,"rating":4.67,"reviews":3,"wait":21,"signal":null,"lastUsed":"2023-05-28","comments":[{"text":"Big gas station/KFC/truck stop in the direction of west (Lodz, Poznan, Berlin)\r\nNot so many cars, but pretty much everyone is going in the direction you want to go, so sooner or later someone will take you. We stood at the very end, where all the little roads joined the onramp. Two cars in one day asked for payment, like blablacar. After about 20 min a Polish man who didnt speak English picked us up to Konin.","date":"2023-05-28","rating":4},{"text":"Very good spot if u are going in direction of Berlin/Poznań/Wrocław","date":"2022-08-16","rating":5},{"text":"MOP Baranów service station, dir. Poznan / Berlin.","date":"2015-04-11","rating":5}],"destLat":52.1528,"destLon":18.272},{"id":719,"lat":50.2509,"lon":18.8831,"rating":4.67,"reviews":3,"wait":14,"signal":null,"lastUsed":"2023-05-13","comments":[{"text":"Slow spot as there weren't so many cars coming from the gas station/KFC. But we were lucky, got a ride in 20 min to Krakow our destination.\r\nPeople were friendly, willing to help. Many were turning around and going back opposite way.","date":"2023-05-13","rating":4},{"text":"Gas stations + parking, you can always meet hichhayker\nTwice found the truck up to the border with Ukraine.","date":"2014-01-07","rating":5}],"destLat":50.0415,"destLon":19.9347},{"id":104,"lat":52.6762,"lon":21.6164,"rating":4.6,"reviews":5,"wait":16,"signal":"ask","lastUsed":"2025-09-13","comments":[{"text":"Pretty good spot to get to Suwałki/Augustów/Białystok, within 5 minutes got ride to Augustów. Just ask around people at McDonald's parking/gas station.","date":"2025-09-13","rating":5},{"text":"Sunny morning, couple ~25yo. Without a sign.Got a ride to Augustów.","date":"2025-08-19","rating":5},{"text":"Really fair spot honestly. Stand outside the McDonald's driveway and wait. Thursday, 8pm, 4 machines stopped in 20 minutes.","date":"2025-07-17","rating":5},{"text":"Really good spot in my opinion\r\nNot so much cars, okay, but it worked well for me, to Bialystok, and i was put on the road towards Augustow\r\nAnd there are a lot of Lituanian cars if ever","date":"2025-07-15","rating":5},{"text":"Not too much traffic. I was trying to get to Lithuania with a sign Litwa (Lithuania in Polish). Noone wanted to pick me up even though some truck drivers I knew was going to Lithuania. But after 30 min I found a guy with Lithuanian number plates to get me to Vilnius. Probably helped a lot that I spoke lithuanian to him as I am lithuanian.","date":"2025-04-29","rating":3}],"destLat":53.8422,"destLon":22.9776},{"id":382,"lat":51.7117,"lon":19.4286,"rating":4.6,"reviews":5,"wait":10,"signal":null,"lastUsed":"2025-06-09","comments":[{"text":"Very good spot for catching cars to Wrocław.","date":"2025-06-09","rating":5},{"text":"Amazing spot. Waited only 30 seconds. There is a full one line for stopping, enough space for trucks too. And ppl go often on the highway, far.","date":"2023-09-16","rating":5},{"text":"A very nice spot to get from Lodz to Wroclaw. The cars slow down before the lights and there is enough place for them to stop. Started at 5:30 pm and got a ride within 10 minutes :)","date":"2023-05-24","rating":5},{"text":"I stood there for 7 minutes. Then car stopped. And I came in Wroclaw in 2 hours.\nПодобрали сразу, стояла несколько минут. Вскоре была во Вроцлаве :)","date":"2015-08-09","rating":4}],"destLat":51.0503,"destLon":16.9714},{"id":45,"lat":49.4757,"lon":20.051,"rating":4.5,"reviews":4,"wait":6,"signal":"sign","lastUsed":"2025-11-06","comments":[{"text":"I think the spot is great to go Slovakia but I was even luckier, I managed to go to Miskolc, Hungary with a Slovakia sign.\r\nThe cars can see you from a distance and the bus stop is perfect for stopping.","date":"2025-11-06","rating":5},{"text":"With SK/Prešov sign, got picked up by a fellow hitchhiker going to Białka almost immediately. Be careful about where you get dropped tho, all the traffic going to Slovakia follows the main road but not all spots are safe.","date":"2025-08-23","rating":5},{"text":"We wanted to go to Slovak borders and after 10 minutes one lady offered us a ride to Niedzica (3 km before borders but different direction than we planned). We took it, but the problem is that in Spišská Stará Ves (first village behind the borders) traffic is very low, almost none. Anyway, this spot is very good.","date":"2016-04-20","rating":4},{"text":"Towards Slovakian border, there is a bus stop just after a roundabout with fair amount of slow traffic going towards Slovakia. Waited 15 minutes before I guy took me","date":"2012-07-25","rating":4}],"destLat":48.0994,"destLon":20.8103},{"id":111,"lat":49.8873,"lon":19.4803,"rating":4.5,"reviews":4,"wait":15,"signal":"sign","lastUsed":"2025-09-13","comments":[{"text":"Sign, direct ride","date":"2025-08-10","rating":5},{"text":"Direction Cieszyn","date":"2016-02-24","rating":4}],"destLat":49.8417,"destLon":19.0684},{"id":207,"lat":50.4533,"lon":16.6356,"rating":4.5,"reviews":4,"wait":18,"signal":"sign","lastUsed":"2025-08-18","comments":[{"text":"To Wrocław","date":"2025-08-18","rating":5},{"text":"Waiting at the corner intersection of the traffic lights, with the drivers turning right towards the S8 heading to Łódź. I had a sign saying WAWA for Warszawa but got a ride to a town close to Łódź","date":"2025-08-05","rating":5},{"text":"Good place to HH toward Wrocław. Many cars go by, many locals but also Wrocław inhabitants (W or WR plates). There are traffic lights so cars don't speed. Try WROCŁAW / WRCŁW sign.","date":"2014-07-01","rating":4}],"destLat":51.1088,"destLon":17.0272},{"id":363,"lat":50.4628,"lon":18.1614,"rating":4.5,"reviews":4,"wait":5,"signal":null,"lastUsed":"2025-06-15","comments":[{"text":"Found a ride within 25 minutes but they weren't leaving for 6 hours, but they were going all the way to Hamburg","date":"2023-10-10","rating":3},{"text":"2guys, waited 8:30AM, got a ride to Wroclaw within 10minutes... normal tuesday morning","date":"2014-05-02","rating":5},{"text":"MOP Wysoka / MOP Góra Świętej Anny.\n\nBig service areas, another side crossable. Gas station and KFC/McDonald.","date":"2013-01-14","rating":5}],"destLat":51.3034,"destLon":15.7268},{"id":18,"lat":50.5018,"lon":16.7271,"rating":4.5,"reviews":2,"wait":8,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"you stand on horizon so that's kinda bad, but still good place","date":"2026-01-16","rating":4},{"text":"to Kłodzko","date":"2014-07-31","rating":5}],"destLat":50.4148,"destLon":16.4478},{"id":72,"lat":53.1081,"lon":23.2116,"rating":4.5,"reviews":2,"wait":1,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Had a Zabłudów sign, immediately got a ride straight to Trześcianka","date":"2025-10-15","rating":5}],"destLat":52.9403,"destLon":23.4405},{"id":75,"lat":54.0965,"lon":23.3475,"rating":4.5,"reviews":2,"wait":4,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Quickly got a ride to the main road towards Augustów","date":"2025-10-15","rating":5},{"text":"If you want to get a ride outside of Sejny in south direction, just walk along the road and one of the first few cars will pick you up, but beware, it's mostly locals and not too much traffic, wait time of 10-25 minutes expected","date":"2025-06-12","rating":4}],"destLat":54.0337,"destLon":23.3534},{"id":99,"lat":51.2263,"lon":17.2053,"rating":4.5,"reviews":2,"wait":5,"signal":"sign","lastUsed":"2025-09-16","comments":[{"text":"99% of the cars are going to Wrocław. It is a petrol station so you can also ask around.","date":"2025-09-16","rating":5},{"text":"Pretty good spot to go to Legnica","date":"2023-10-12","rating":4}],"destLat":51.1222,"destLon":17.0304},{"id":151,"lat":50.8419,"lon":20.4827,"rating":4.5,"reviews":2,"wait":23,"signal":"ask-sign","lastUsed":"2025-09-01","comments":[{"text":"Lots of people, KFC and Shell. 15 min of asking and we caught a ride to Kraków.","date":"2025-09-01","rating":5},{"text":"MOP Szewce. A medium sized parking lot next to S7 motorway. \r\nYou can get there from Kielce by bus no. 19 (get off at Szewce wiadukt bus stop). Go to the right, upstairs and through the door. If the door is locked, you can jump over the fence or try the gate a little bit further the small road.\r\nMost of the people go to Kraków or Katowice from here.","date":"2024-12-07","rating":4}],"destLat":50.0067,"destLon":19.9245},{"id":165,"lat":53.4197,"lon":18.4757,"rating":4.5,"reviews":2,"wait":23,"signal":"ask-sign","lastUsed":"2025-08-29","comments":[{"text":"We tried to get to Gdańsk, but people were mainly locals, so we got short ride.","date":"2025-08-29","rating":4},{"text":"Lots of drivers goint to Mazury","date":"2024-05-06","rating":5}],"destLat":53.508,"destLon":18.6863},{"id":176,"lat":51.7033,"lon":19.6052,"rating":4.5,"reviews":2,"wait":1,"signal":"ask","lastUsed":"2025-08-26","comments":[{"text":"good spot both to Warsaw and west towards Poznan! busy gas station, easy to get there from the city with a bus. (summer 2023)","date":"2025-08-26","rating":4},{"text":"Me and my friend caught a ride to Warsaw in 20 seconds!\r\nNot even joking, this spot is very crowded.\r\nMcdonald's, gas station and a lot of people going to Warsaw. HIGHLY RECOMEND","date":"2023-09-24","rating":5}],"destLat":52.2278,"destLon":21.0388},{"id":183,"lat":51.1768,"lon":15.0323,"rating":4.5,"reviews":2,"wait":88,"signal":"ask","lastUsed":"2025-08-26","comments":[{"text":"We got lucky very quick, only had to ask 3 people and the guy took us to katowice","date":"2025-08-26","rating":5},{"text":"ASR - we waited long, but there were also a lot of hitchhikers going in the same direction, which made it harder to find the driver.","date":"2024-04-28","rating":4}],"destLat":50.2591,"destLon":19.0086},{"id":194,"lat":49.3338,"lon":20.1466,"rating":4.5,"reviews":2,"wait":15,"signal":"sign","lastUsed":"2025-08-23","comments":[{"text":"Not too much traffic and cars coming from the main road are going quite fast, try to stand somewhere where road signs won’t hide you from them. Not ideal, but basically all traffic to eastern Slovakia from this part of Poland goes through here. Ideally avoid getting dropped here and get a direct ride to Slovakia from further north.","date":"2025-08-23","rating":4},{"text":"Cars are going slowly","date":"2025-08-15","rating":5}],"destLat":49.1219,"destLon":20.0749},{"id":399,"lat":51.8419,"lon":19.6571,"rating":4.5,"reviews":2,"wait":10,"signal":null,"lastUsed":"2025-05-01","comments":[{"text":"Very nice people but in fancy cars only not sympatehic","date":"2025-05-01","rating":5},{"text":"Was dropped off here trying to head to Wroclaw. Some trucks and cars that you can ask a ride from. Possible to get kinda stuck here too but should be fine.","date":"2023-05-23","rating":4}],"destLat":51.8419,"destLon":19.6571},{"id":487,"lat":50.7905,"lon":16.8446,"rating":4.5,"reviews":2,"wait":10,"signal":"sign","lastUsed":"2024-10-27","comments":[{"text":"Good spot fot hitchiking to Wrocław/Chech","date":"2024-10-27","rating":5}],"destLat":null,"destLon":null},{"id":560,"lat":51.2156,"lon":17.3614,"rating":4.5,"reviews":2,"wait":28,"signal":"thumb","lastUsed":"2024-07-09","comments":[{"text":"Best spot in Oleśnica in direction of Wrocław","date":"2024-07-09","rating":4},{"text":"Great place to get to Wrocław, because there is enough space for cars to stop and in a Worst-Case-Scenario you can easily take the train to Wrocław (although you have to wait for it). A very friendly elderly couple took me with them.","date":"2024-03-15","rating":5}],"destLat":51.2153,"destLon":17.3607},{"id":628,"lat":51.7501,"lon":19.5893,"rating":4.5,"reviews":2,"wait":23,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"Great place towards Warsaw, Częstochowa and Wrocław. I tried all directions a lot of times and always the waiting time is acceptable.","date":"2023-10-12","rating":5}],"destLat":51.2044,"destLon":17.3161},{"id":670,"lat":51.1644,"lon":17.022,"rating":4.5,"reviews":2,"wait":4,"signal":null,"lastUsed":"2023-08-11","comments":[{"text":"You have to stay in the grass because There is a sign behind which you are not seen very good.\r\nWe cought a man driving right to Warszaw. Goal","date":"2023-08-11","rating":5}],"destLat":51.1637,"destLon":17.0219},{"id":682,"lat":50.8427,"lon":16.4631,"rating":4.5,"reviews":2,"wait":13,"signal":null,"lastUsed":"2023-08-02","comments":[{"text":"Ride to Wroclaw - not great, not terrible…","date":"2023-08-02","rating":4}],"destLat":51.0604,"destLon":16.9382},{"id":42,"lat":51.0503,"lon":16.9696,"rating":4.45,"reviews":62,"wait":52,"signal":"sign","lastUsed":"2025-11-23","comments":[{"text":"Perfect spot to travel towards west. Don’t forget do sign on guardrails ;) we got to similar place close to Legnica.","date":"2025-11-23","rating":5},{"text":"When i arrived a truck was there and upon asking took me straight to leipzig. To get to the spot i took the bus to Auchan and walked along the fence until i found a hole","date":"2025-11-14","rating":5},{"text":"Such good spot - lots of trafic but hard to stay for cars and they go fast","date":"2025-09-02","rating":3},{"text":"Not good. Not a lot of traffic from the highway stopping, very small, and all the cars entering from the ramp are local. Had sign DE, ended up just getting a short ride, but was happy to get out of there.","date":"2025-08-28","rating":3},{"text":"Amazing spot, guaranteed ride towards krakow","date":"2025-08-14","rating":5}],"destLat":51.1613,"destLon":16.1698},{"id":77,"lat":52.3071,"lon":21.0928,"rating":4.45,"reviews":20,"wait":28,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"With a sign saying LT, I do tend to agree with other comments that having a sign for a closer destination would work better. Eventually some guy picked me up and drove me to a gas station","date":"2025-10-15","rating":4},{"text":"Perfect spot to get out of Warsaw - waited only 3 minutes with Ostrów sign.","date":"2025-09-13","rating":5},{"text":"Busy spot but very easy for a car to stop. I got a short ride to a very inconvenient village - Troyan. I feel like I should have waited longer for someone going a longer distance. Ended up having to stitch my journey from multiple 5-10km rides from bad spots in small places.","date":"2025-09-13","rating":4},{"text":"Got picked up by the 2nd car","date":"2025-08-08","rating":5},{"text":"Very busy spot, it is better if your sign will be to Ostrów, bcs it’s not so far.","date":"2025-08-06","rating":5}],"destLat":52.4579,"destLon":21.2933},{"id":107,"lat":53.167,"lon":23.1484,"rating":4.4,"reviews":10,"wait":30,"signal":"sign","lastUsed":"2025-09-13","comments":[{"text":"Good spot. Got a ride to Augustow in 20 min but i feel like i could have waited longer and gotten further without so many stops.","date":"2025-09-13","rating":4},{"text":"Good spot if you are heading north","date":"2025-07-04","rating":5},{"text":"Towards Augustow/LT, lots of locals, usually i get quite some offers nearby, which can be tiring, wait times of 30-40 minutes til I get a ride with decent distance, it's still probably best spot around here","date":"2025-06-12","rating":4},{"text":"had several offers towards augustow (which i declined), after 90mins someone took me to suwałki \r\nnot many foreign license plates, so maybe not the best sport to ask for a ride all the way to lithuania (?)\r\nvery easy to reach by bus, very spacious","date":"2024-08-23","rating":4},{"text":"Really good spot, we wanted to go to Kaunas and somebody picked us up in a few minutes and took us to Suwalki. Its visible and the cars can stop in the bus stop.","date":"2024-03-09","rating":5}],"destLat":53.8439,"destLon":22.9788},{"id":613,"lat":50.0054,"lon":20.0177,"rating":4.4,"reviews":5,"wait":30,"signal":null,"lastUsed":"2024-03-19","comments":[{"text":"Not very easy to get to this spot, much better luck on highway A4","date":"2024-03-19","rating":2},{"text":"Much space, much posibilites to catch something ;)","date":"2018-02-10","rating":5},{"text":"It is now available. the best spot when you are heading east","date":"2017-04-20","rating":5},{"text":"Roadworks in July 2015 - the ramp is closed.","date":"2015-08-24","rating":5},{"text":"Wsiadamy w autobus jadący do przystanku Wielicka n/ż, przechodzimy przez barierkę i wchodzimy na ślimaka prowadzącego na autostradę A4. Jest tam szerokie pobocze, na którym może zatrzymać się nawet i autobus.","date":"2014-02-09","rating":5}],"destLat":49.9971,"destLon":19.9855},{"id":664,"lat":52.3254,"lon":14.6522,"rating":4.4,"reviews":5,"wait":71,"signal":null,"lastUsed":"2023-08-20","comments":[{"text":"Not a great spot if you are trying to go south, amazing for western Germany or the Netherlands. Waited for 1,5/2h to get a ride to Potsdam, as anywhere in Poland, go to ppl and have a chat rather than standing with a sign","date":"2023-08-20","rating":4},{"text":"Many cars, had to wait a long time but finally found someone who took us to Berlin.","date":"2023-01-02","rating":3},{"text":"Our driver was heading to Amsterdam: we went with him just to Berlin/Michendorf.","date":"2016-05-20","rating":5},{"text":"Found a ride to Utrecht (NL) in 5min! Packed with lots and lots of cars queued up to refill their tank with cheap petrol.","date":"2012-09-09","rating":5},{"text":"MOP Gliniec, A2 towards Frankfurt (Oder) / Berlin.","date":"2012-02-02","rating":5}],"destLat":52.302,"destLon":13.0199},{"id":607,"lat":52.3173,"lon":16.7925,"rating":4.38,"reviews":8,"wait":27,"signal":"sign","lastUsed":"2024-04-19","comments":[{"text":"Good spot, sign recommended. Lots of traffic and cars have to stop at the traffic lights, but I stood bit behind them in from or the bus stop. Took ride to Smiegel (direction Wroclaw) in 20-30 min.","date":"2024-04-19","rating":4},{"text":"About 45 minutes of waiting, and get a short ride to Stęszew.","date":"2024-02-11","rating":3},{"text":"good place. I cought a truck to wroclaw. 30 minutes of waiting. It ia better to have a sigh.","date":"2016-06-05","rating":4},{"text":"There were 4 of us (a guy and three girls) and got a ride to Leszno (although we were going to Prague) by the first car.","date":"2015-10-28","rating":5},{"text":"Used this spot for Wroclaw direction and found it average enough, mostly local traffic but it's good to take any lift going in the right direction. I travelled from Poznan to Wrocalw then onto Budapest. [Blog Post](http://www.hobospirit.com/hitchhiking-from-poznan-to-wroclaw/)","date":"2015-01-09","rating":5}],"destLat":52.004,"destLon":16.526},{"id":744,"lat":51.9144,"lon":19.3645,"rating":4.33,"reviews":6,"wait":8,"signal":null,"lastUsed":"2023-03-19","comments":[{"text":"This spot doesn't exist anymore","date":"2023-03-19","rating":1},{"text":"It`s a good place but I recommend the toll gates, they are 1km further.","date":"2013-02-15","rating":5},{"text":"Koendev - toll booths are actually a bit to the northeast from this crossing (5min by feet) :).","date":"2012-06-01","rating":5},{"text":"Works very well if you just ask the drivers the moment they're stopping at the toll booth (if I am recalling the right place).","date":"2011-12-14","rating":5},{"text":"well first thing a bit confusing was to get there: you just can buy ticket in tram.\r\nyou need a 30-minutes ticket of lodz (you can buy everywhere in Lodz: 2,40Zloty) and 2 other zones 1,80Zloty each... you can buy at tram driver the 1,80 tickets...\r\n------------\r\nand now experience about the spot:\r\ni put berlin and poznan on my sign, no much trafic, but after 15minutes a car for poznan stop.","date":"2011-03-06","rating":5}],"destLat":51.9144,"destLon":19.3645},{"id":85,"lat":50.4705,"lon":16.697,"rating":4.33,"reviews":3,"wait":8,"signal":"sign","lastUsed":"2025-10-12","comments":[{"text":"Petrol station exit, direction CR.","date":"2014-10-08","rating":4}],"destLat":50.2323,"destLon":15.7917},{"id":159,"lat":50.0794,"lon":19.7578,"rating":4.33,"reviews":3,"wait":15,"signal":"ask","lastUsed":"2025-08-31","comments":[{"text":"Found Slovakian guys driving from England to Košice.","date":"2025-08-31","rating":5},{"text":"Good for going East indeed. I tried going north to Kielce with no luck, realized too late that nobody would take that route from here. If you're in the same situation, get a ride to Krakow and then walk to the S7.","date":"2020-07-19","rating":4},{"text":"MOP Morawica\nStation at Morawica\nYou can easly catch something to Rzeszów. It's good place too if you go to East (Ucraina), \nFrom Kraków you can get there by bus 209 and 226 (near is bus stop Morawica, you have to walk about 10-15min to station)","date":"2014-01-12","rating":4}],"destLat":48.7163,"destLon":21.2609},{"id":222,"lat":52.4418,"lon":21.2475,"rating":4.33,"reviews":3,"wait":8,"signal":"sign","lastUsed":"2025-08-13","comments":[{"text":"Kfc and petrol station leading to fine ish onramp","date":"2025-08-13","rating":4},{"text":"First car we asked agreed to drive us to bialystok, they eventually even went out of their way to drop us off at our accommodation. Very nice","date":"2025-07-04","rating":5},{"text":"We were sitting in front of the entrance of the gas station with a sign saying LI. Very soon, two girls picked us up.","date":"2024-09-15","rating":4}],"destLat":52.6199,"destLon":21.5009},{"id":224,"lat":52.7322,"lon":23.599,"rating":4.33,"reviews":3,"wait":2,"signal":"sign","lastUsed":"2025-08-12","comments":[{"text":"To Białowieza","date":"2025-08-12","rating":5},{"text":"To Bialowieza.","date":"2012-10-25","rating":4}],"destLat":52.7322,"destLon":23.599},{"id":233,"lat":51.1559,"lon":15.0291,"rating":4.33,"reviews":3,"wait":18,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"We were standing on the spot before the pedestrian crossing. A lot of space to stop. \r\nIt was starting to rain, so luckily we got a ride really fast =) The guy was going to Katowice, but we wanted to go North so we stopped at Legnica.","date":"2025-08-11","rating":5},{"text":"Road leading to the motorway (typical Polish overland road with lots of space to come to a halt). Got a ride here within minutes to Wroclaw.","date":"2011-07-31","rating":4}],"destLat":51.1991,"destLon":16.1554},{"id":318,"lat":49.6017,"lon":19.9231,"rating":4.33,"reviews":3,"wait":18,"signal":"sign","lastUsed":"2025-06-30","comments":[{"text":"We didnt have to wait much just after we wrote Chyzne/SK on our cardboard some people stopped and they took us. There s not really space for trucks but cars can stop very easily","date":"2025-06-30","rating":4},{"text":"Stood with a sign Slovakia. Got off in Ružomberok, because the driver was going south and I wanted to go to high tatras. Pretty good spot because cars are slow after roundabout and there is just about enough space to stop.","date":"2025-04-29","rating":4},{"text":"Wanted to go to budapest, taken to trdvosin.","date":"2024-05-01","rating":5}],"destLat":49.5372,"destLon":19.7157},{"id":362,"lat":51.3038,"lon":15.7267,"rating":4.33,"reviews":3,"wait":71,"signal":null,"lastUsed":"2025-06-15","comments":[{"text":"Great petrol station, in fact two of them, lot of place to sleep (just in case) KFC and planty of other food stuff. Really easy to catch someone going west.","date":"2015-05-17","rating":4},{"text":"Statoil, Orlen","date":"2013-10-27","rating":4}],"destLat":51.2947,"destLon":13.7353},{"id":375,"lat":53.8315,"lon":22.9591,"rating":4.33,"reviews":3,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Just after zebra, great spot for going to Bialystok, wait time of 5-20 minutes expected","date":"2025-06-12","rating":5},{"text":"Direction Grajewo, Warsaw. \nJust next to the zebra crossing on the exit road from the roundabout - there is room for a car to stop off the road.","date":"2013-09-16","rating":4}],"destLat":null,"destLon":null},{"id":484,"lat":53.6807,"lon":20.0028,"rating":4.33,"reviews":3,"wait":9,"signal":null,"lastUsed":"2024-10-27","comments":[{"text":"With a sign Warszawa, It brings me at 70 km of the city. traffics ok","date":"2024-10-27","rating":5},{"text":"It is good to go a little further from this point and go to a place after big road curve - there is a point few meters up with good visibility and a path for pedestrians with light.","date":"2013-05-02","rating":4},{"text":"To Warsaw. High speed, but good visibility and wide roadside. Also there is nice lake and place for camp :)","date":null,"rating":4}],"destLat":52.6047,"destLon":20.3784},{"id":562,"lat":51.7085,"lon":19.4867,"rating":4.33,"reviews":3,"wait":20,"signal":null,"lastUsed":"2024-07-07","comments":[{"text":"Wait just after the bus station, there is enough room for the cars to stop.","date":"2024-07-07","rating":5},{"text":"Bus stop on merge lane in the direction of Katowice, Krakow. You can get here by bus no. 70 from railway station Lodz Fabryczna.","date":null,"rating":4}],"destLat":50.3051,"destLon":19.016},{"id":587,"lat":54.534,"lon":17.7625,"rating":4.33,"reviews":3,"wait":8,"signal":"thumb","lastUsed":"2024-05-02","comments":[{"text":"Very good spot! Two cars stopped. The way to Gdańsk","date":"2024-05-02","rating":5},{"text":"Towards Gdynia - gas station escape.","date":"2011-12-07","rating":4}],"destLat":54.53,"destLon":17.7625},{"id":608,"lat":51.1664,"lon":17.0275,"rating":4.33,"reviews":3,"wait":26,"signal":"sign","lastUsed":"2024-04-19","comments":[{"text":"Głównie miejscowi tedy jeżdżą. Miejscowi nie chcą chętnie brać z tego miejsca.\r\n\r\nPokazywali z jadą na miejsce tutaj. Ostatecznie złapaliśmy (f i m) podwózkę na stację benzynową/McDonald koło Trzebnicy.\r\nTam przez otwartą furtkę na teren MOP\r\n\r\nMainly local résidents are driving here and are less likely to pick some hitchhikers.\r\n\r\nWe were given a ride to closes pertol station not through S5 Road but some local Road. Then we entered the terrain of MOP Using opened gate for pedestrians.","date":"2024-04-19","rating":3},{"text":"go to bus stop 'rondo obrońców grodna' after roundbout.","date":"2016-07-30","rating":5},{"text":"Good place to HH to Poznań. 2016 - The place is under construction which gives even better opportunities. The cars don't speed because there is a roundabout. There's also a bus stop so cars have a place to stop. Stand as close to the roundabout as you can to give drivers time to make decision whether to stop on the bus stop. POZNAŃ sign is helpful. Look for P... or PO plates.","date":"2016-07-28","rating":5}],"destLat":51.2602,"destLon":17.047},{"id":632,"lat":49.321,"lon":19.9861,"rating":4.33,"reviews":3,"wait":15,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"Great spot for going to Kraków","date":"2023-10-12","rating":5},{"text":"We got a lift to Nowy Targ after 20-30min.","date":"2014-06-01","rating":4}],"destLat":50.0073,"destLon":19.9241},{"id":641,"lat":51.5575,"lon":19.9993,"rating":4.33,"reviews":3,"wait":9,"signal":null,"lastUsed":"2023-09-14","comments":[{"text":"Best spot to catch a ride from Tomaszow to Lodz","date":"2023-09-14","rating":5},{"text":"Good place(a bus stop) to catch a car to Łódź.","date":"2014-01-31","rating":4}],"destLat":51.6798,"destLon":19.4385},{"id":710,"lat":52.0397,"lon":20.698,"rating":4.33,"reviews":3,"wait":4,"signal":null,"lastUsed":"2023-05-29","comments":[{"text":"Great place to hitchhike in Katowice direction. Reachable from Warsaw by suburb bus","date":"2023-05-29","rating":5},{"text":"We were staying at the entrance of petrol station, we were very lucky because we got a girl to Katowice after less than a minute.","date":"2015-09-22","rating":4},{"text":"Quite little petrol station ORLEN but everyone here is going in direction of Katowice.","date":"2015-09-22","rating":4}],"destLat":50.3711,"destLon":18.7438},{"id":747,"lat":49.9877,"lon":19.915,"rating":4.33,"reviews":3,"wait":23,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Direction: Radom\r\nWhen I was wating for a bus to Kraków/Cracow I try catch a car to Radom\r\nBus stop + traffic lights + a lot of car + in front of the highway/expressway = good place","date":"2023-01-03","rating":5},{"text":"to Wroclaw","date":"2014-06-11","rating":4}],"destLat":49.9876,"destLon":19.915},{"id":749,"lat":50.0204,"lon":21.9801,"rating":4.33,"reviews":3,"wait":32,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Direction: Boguchwała / Babica / Bieszczady \r\nTraffic light + bus stop = good place","date":"2023-01-03","rating":5},{"text":"big traffic, great spot, summer and noone wanted to stop..","date":"2013-03-17","rating":4},{"text":"Good spot for travelers going south, there is a bus stop just after traffic lights so cars gain relatively low speed there. Lidl and another supermarket nearby.","date":"2012-05-11","rating":4}],"destLat":50.0202,"destLon":21.9799},{"id":193,"lat":49.9865,"lon":19.9139,"rating":4.3,"reviews":10,"wait":22,"signal":"sign","lastUsed":"2025-08-23","comments":[{"text":"Many cars going slowly and leaving Krakow, lots of space for them to pull over at the bus stop but be careful because you have to stand on a slim patch of grass for drivers to see you. With a sign saying SK I got a ride to Nowy Targ by a guy going to Slovakia but not the right direction.","date":"2025-08-23","rating":4},{"text":"8 am in the morning with \"SK\" sign.","date":"2025-08-06","rating":3},{"text":"Just thumb, car to Zakopane","date":"2025-07-30","rating":5},{"text":"Good spot just behind the lights in the bus stop. Its a bit annoying that there is this big bush in front of bus stop, so you have to stand quite close to the road. But the spot is good if you are trying to get south. I stood with a sign Rabka/Slovakia. Got picked up to Rabka","date":"2025-04-29","rating":4},{"text":"I was 30 min walking from this bus stop, once the van arrived I asked in Polish how much for a ride to Opatkowice and he probably said something like \"nah I got you\" because I didn't paid nothing. Maybe if you try to ask in the local language you can get one too ;)\r\n\r\nPretty sure this spot is illegal since it's already on the main road and it's a bus stop, but with a \"Rabka\" sign I got a ride to Myślenice in less than 5 min. \r\nIf you stay there for a long time, just be careful","date":"2023-04-28","rating":5}],"destLat":49.3016,"destLon":19.958},{"id":244,"lat":52.4302,"lon":17.0114,"rating":4.29,"reviews":7,"wait":30,"signal":"sign","lastUsed":"2025-08-09","comments":[{"text":"We tried to get to Bydgoszcz or alternatively another place on the way, but we didn't have any luck. We tried both, without and with a sign, in both cases not even a single car stopped. There was one lady who stopped while we had a break, but she only drove a very short distance, not even to Gnozno.","date":"2025-08-09","rating":1},{"text":"We wanted to get straight to Gdańsk but the wait got very long so we changed the sign to Gniezno and waited maybe even less than 10 minutes","date":"2024-08-28","rating":5},{"text":"Nice spot, decent traffic. We get ride to gnezno.","date":"2023-08-08","rating":4},{"text":"Good spot, I got a ride from here directly to Gdansk in just 15 minutes, I think I was too lucky though :)","date":"2013-06-27","rating":5},{"text":"Was there on my way to Lithuania, very good spot","date":"2013-06-25","rating":5}],"destLat":52.4041,"destLon":17.0068},{"id":333,"lat":52.1296,"lon":20.8967,"rating":4.29,"reviews":7,"wait":34,"signal":"sign","lastUsed":"2025-06-20","comments":[{"text":"Good spot, between the ikea exit and bus stop .had a sign for Radom 577, Was picked up and dropped off just before Radom at a gas station","date":"2025-06-20","rating":5},{"text":"Very good stop if you are going to Krakow.","date":"2024-04-13","rating":5},{"text":"After 15 minutes got a ride to Kielce! :) Great place towards KRAKOW as well.","date":"2015-08-16","rating":4},{"text":"We were lifted there from P+R al. Krakowska by a friendly guy (thanks you once more). From here we found another lift quite fast, after 15 min. Prepare card with written direction.","date":"2013-05-02","rating":4},{"text":"13 Oct 2011: the bus is no longer free. 2 zlotys now. And leaves from \"Okęcie\" or \"P+R al. Krakowska\" bus stop.\nThen you have to walk a little bit from Janki to the nearest bus stop (good place for cars to stop).\nHowever, the place is good, really, specially in summer. One holiday we got a direct Warsaw-Cracow lift after... 30 minutes?","date":"2011-10-13","rating":4}],"destLat":51.6989,"destLon":20.9293},{"id":148,"lat":49.8455,"lon":19.9262,"rating":4.25,"reviews":4,"wait":24,"signal":"sign","lastUsed":"2025-09-01","comments":[{"text":"Great spot, but we made a bad decision getting into the first car that stopped and we only drove 30 km","date":"2025-09-01","rating":5},{"text":"Pretty unlucky. There was construction work and no one was going to Slovakia. Took a ride to Zakopane in the end","date":"2025-08-26","rating":3},{"text":"Used two times. Got a ride to Poprad, Sk once with a sign SK","date":"2023-01-03","rating":5}],"destLat":49.6439,"destLon":19.9142},{"id":162,"lat":51.666,"lon":14.7643,"rating":4.25,"reviews":4,"wait":19,"signal":null,"lastUsed":"2025-08-30","comments":[{"text":"Wednesday about 15:00. Thought there would be much more traffic because idk but I had hope in the polish people and got picked up by a trucker. Not sure how it is on other times, but the medium-low traffic maybe made the people more likely to stop.","date":"2025-08-30","rating":5},{"text":"for me it was horrible place for hitchhiking, we waiting two hours to somebody want to lift us to Wrocław, it isn't highway, this is country road nr 18","date":"2013-09-09","rating":4},{"text":"Had a ride to Wrocław from here with a trucker.","date":"2013-08-12","rating":4},{"text":"Petrol station on the first exit on A18 in Poland, Olszyna. Many people fill up on petrol here, so a good choice to get a ride further.","date":"2013-07-19","rating":4}],"destLat":51.1583,"destLon":16.1738},{"id":192,"lat":50.0904,"lon":19.9596,"rating":4.25,"reviews":4,"wait":40,"signal":"ask-sign","lastUsed":"2025-08-23","comments":[{"text":"Good spot to Warsaw","date":"2025-08-23","rating":5},{"text":"2023- the road was being renovated so it was auite easy to catch a car north, one star as it is in direct sunlight so it can be hard in sunny weather","date":"2023-07-29","rating":4},{"text":"sept 2019 40 minutes waiting. Ride to the Warsaw\n@soymartanegro","date":"2019-10-01","rating":4},{"text":"BP petrol station on road 7 direction Warsaw. If you stand around 100m in front of the station at the bus stop you have good chances for a long ride!","date":"2012-12-16","rating":4}],"destLat":50.8415,"destLon":20.575},{"id":414,"lat":49.4235,"lon":21.6932,"rating":4.25,"reviews":4,"wait":32,"signal":"sign","lastUsed":"2025-04-04","comments":[{"text":"A lot of space to take a ride. But we have to stay one night because was to small traffic and nobody take us. Next day was much better!","date":"2025-04-04","rating":4},{"text":"The comment from 2013 it's probably about the bigger station on the other side of the road, 5 minutes walking.","date":"2024-09-16","rating":5},{"text":"I heard, that all the traffic from PL and the baltic countries to Romania, Bulgaria and even directly to Turkey goes through there. Never used it though.","date":"2013-05-30","rating":4}],"destLat":48.0989,"destLon":20.7916},{"id":539,"lat":50.1491,"lon":19.2973,"rating":4.25,"reviews":4,"wait":17,"signal":"ask-sign","lastUsed":"2024-08-08","comments":[{"text":"To Ostrava, 2 people","date":"2024-08-08","rating":5},{"text":"Easy for a ride straight to Wrocław.","date":"2016-05-20","rating":4},{"text":"On sunday not so much traffic. We got a ride after 30 minutes to Wroclaw.","date":"2014-10-06","rating":4},{"text":"to Wroclaw","date":"2014-06-11","rating":4}],"destLat":49.9033,"destLon":18.3043},{"id":545,"lat":52.3064,"lon":20.9326,"rating":4.25,"reviews":4,"wait":27,"signal":"sign","lastUsed":"2024-08-06","comments":[{"text":"I confirm it as a good place to hitchhike toward Gdansk! If you stay on the bus stop it's enough place for cars to stop, but not enough place for drivers to see you after the traffic light, since there is a lot of traffic in general.","date":"2024-08-06","rating":4},{"text":"I confirm that this spot is very good. \r\nI got a ride to Gdańsk. At 11:00 Sunday. \r\n\r\nIt's easy to get there. I confirm that the instructions given in other reviews are still valid. \r\n\r\nThe only disadvantage is that the bus stop is on a runway, and a lot of cars are passing by, just to merge traffic on the other lane. But still it is very good place.","date":"2023-04-14","rating":5},{"text":"It took 35 minutes for me to find car to Modlin Airport. May be because I was trying to hitchhike on Thursday morning","date":"2016-06-17","rating":4},{"text":"Nice place at the bus stop ('Muzealna') just after the traffic lights. Drivers see you quite well, have time for decision to lift you or not and it's not problem to stop the car at the bus stop.\nBus 114 from underground station Młociny.","date":"2015-12-28","rating":4}],"destLat":53.5836,"destLon":20.1808},{"id":576,"lat":52.3087,"lon":20.9281,"rating":4.25,"reviews":4,"wait":7,"signal":"thumb","lastUsed":"2024-06-02","comments":[{"text":"We were at first on the muzealna 02 spot, but it's not good place to stop the car, there we were waiting 3minutes and we get the straight ride to Gdańsk (we travel in 3 people)","date":"2024-06-02","rating":5},{"text":"we was waiting there for a 5 mins\nand then we catch a car to gdansk!\nreally simple to catch cars to gdansk(mcdonalds, a lot of place to stop, traffic light)","date":"2016-08-30","rating":4},{"text":"I was waiting on the previous spot at the bus stop Muzealna for 30 mins and nothing. An old lady advised me to change the spot to this one and I cought a car after 5 minutes. Maybe it's luck, or maybe this spot is better.","date":"2016-07-16","rating":4},{"text":"Towards Gdańsk.","date":"2012-07-28","rating":4}],"destLat":54.3445,"destLon":18.6489},{"id":594,"lat":49.3406,"lon":20.0034,"rating":4.25,"reviews":4,"wait":78,"signal":null,"lastUsed":"2024-04-27","comments":[{"text":"Most of traffic was local, it's worth to hitch  cars from both the lines, altough it's hard to the cars from second line to stop for you it's not impossible. About 2 hours of waiting (unlucky or bad spot?)","date":"2024-04-27","rating":2},{"text":"Spot is good, but although there are 2 lanes in the direction of Kraków, cars from only one lane can stop, as the other lane has a non-crossable line. Another potential good spot would be bus stop \"poronin za torem\", which is closer to Zakopane","date":"2023-05-06","rating":5},{"text":"Bus stop with roof, lots of traffic, and enough space for trucks. We got ride to Novy Targ in 10 minutes.","date":"2016-04-19","rating":5}],"destLat":49.9805,"destLon":19.9109},{"id":721,"lat":49.9764,"lon":18.9582,"rating":4.25,"reviews":4,"wait":10,"signal":null,"lastUsed":"2023-05-02","comments":[{"text":"Good place, a crossroad of the national road to the south of the border, there is also parking. where you can for a lift. Cars not going fast because before the spot there are traffic lights","date":"2023-05-02","rating":5},{"text":"I got a ride somewhere on the main road. I waited at the traffic lights until it was red, than I showed my sign 'Bielsko Biala'","date":"2014-09-17","rating":4},{"text":"We were trying to get to Katowice, instead we got a ride just to Kobior.","date":"2014-05-11","rating":4},{"text":"There is a shopping center where you can ask for a ride.","date":"2014-05-11","rating":4}],"destLat":49.8519,"destLon":19.0279},{"id":102,"lat":54.1274,"lon":22.9471,"rating":4.2,"reviews":10,"wait":32,"signal":"sign","lastUsed":"2025-09-13","comments":[{"text":"Good spot to get a lift by lithuanian drivers - there is a roundabout before the spot so traffic is a bit slower. I stayed with sign Kaunas before \"Taxi\" road sign, as there is enough space to stop for drivers. Got direct ride to Kaunas within 10 minutes (but maybe I was a bit lucky).\r\n\r\nYou can also try your luck by asking around at the gas station across the street.","date":"2025-09-13","rating":5},{"text":"Saturday noon not the best time but good spot, lots of local traffic","date":"2025-08-23","rating":4},{"text":"Good spot how to get to Lithuania. Infront of the gas station. After 25 mins guy called us from gas station and take us to Kaunas.","date":"2025-08-08","rating":5},{"text":"very difficult, we had at the sign inscription Lithuania and Marijampole, and waited 2 hour, It was friday late afternoon","date":"2016-07-15","rating":4},{"text":"December 2014, waiting for 15min with my girlfriend.\n\nToward MARJANPOLE, without sign.","date":"2015-01-07","rating":4}],"destLat":54.8985,"destLon":23.9042},{"id":313,"lat":51.2593,"lon":22.5309,"rating":4.2,"reviews":5,"wait":40,"signal":null,"lastUsed":"2025-07-03","comments":[{"text":"Good spot for escaping lublin, literally first car stopped","date":"2025-07-03","rating":5},{"text":"search for place with outside of the city but not express trasa something in the middle and near to the space like bus stop ( I used blablacar to go home but I think somewhere can be good spot )","date":"2024-03-06","rating":1},{"text":"where ?","date":"2017-10-10","rating":5},{"text":"New spot for Warsaw after highway opened.","date":"2014-11-06","rating":5},{"text":"to Warszawa, to Radom.  Thre is a bus stop and a lot of place for stop the car. Speed of  cars is high, so be visible and write down your destination place:)","date":null,"rating":5}],"destLat":51.3898,"destLon":22.2495},{"id":655,"lat":51.9582,"lon":15.5272,"rating":4.2,"reviews":5,"wait":10,"signal":null,"lastUsed":"2023-08-30","comments":[{"text":"After one minute I got ride directly to Wrocław","date":"2023-08-30","rating":5},{"text":"Dobre miejsce do łapania stopa, zwłaszcza jeżeli pójdziemy troszkę dalej w kierunku zjazdu na \"Skę\", jest tam dość długa zatoczka. Można łapać w wielu kierunkach, polecam","date":"2019-12-12","rating":4},{"text":"I was wainting there about 5 min(alone girl). Is very good spot to hitchhike, but ATENITION you have to walk a little bit (100-200m) behind the circle and then you will find a car bay- place where cars can stop, otherwise a car have to stop on the road. Good luck bastards :))","date":"2013-10-17","rating":4},{"text":"It is a great spot for a short and long rides, but it is mostly used by people going to Poznan and north (Swiebodzin and futher)","date":"2013-07-20","rating":4},{"text":"to PoznaÅ„, Szczecin, GorzÃ³w Wielkopolski","date":null,"rating":4}],"destLat":51.9582,"destLon":15.5272},{"id":149,"lat":50.0069,"lon":19.9246,"rating":4.18,"reviews":11,"wait":22,"signal":"sign","lastUsed":"2025-09-01","comments":[{"text":"Nice spot, crossroad, bus stop and \r\nheavy traffic but lots of locals.","date":"2025-09-01","rating":5},{"text":"I’ve decided to use this spot because of bus stop, where I could hide in case of heavy rain (it was a rainy day). There are also traffic lights just before the bus stop, so cars are slowed down a bit. Plus they can safely use the bus stop to stop there. It took me only about 20m to get a direct ride back home to Zilina (Slovakia) which is around 190km.","date":"2025-08-04","rating":5},{"text":"We´ve been waiting there around one hour and the we get a ride only to Myslenice. Continue to Rabka from Myslenice is really difficult, but there is a bus stop before exit to a motorway, where you can try it.","date":"2016-04-20","rating":4},{"text":"it is definately ok spot. Bus stop is for buses, but only 5% drivers can have problem with that :P","date":"2015-01-27","rating":4},{"text":"direct Bielsko-Biała, good place, in Myślenice, You must turn right on the road directly to B-B;)","date":"2013-10-24","rating":4}],"destLat":49.8424,"destLon":19.9298},{"id":631,"lat":49.9059,"lon":19.8592,"rating":4.17,"reviews":6,"wait":10,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"Good spot for going to Bielsko-Biała","date":"2023-10-12","rating":5},{"text":"We've got a ride to Cieszyn afrer about 15 min of waiting.","date":"2015-09-25","rating":4},{"text":"it's good spot but not for long distances, we've got ride only to kalwaria from there","date":"2013-05-04","rating":4},{"text":"2 boys got a lift to Andrychów after circa 20min of waiting.","date":"2012-05-11","rating":4},{"text":"Never wait longer then 5 min, even when we were two.","date":"2011-07-26","rating":4}],"destLat":49.8306,"destLon":19.053},{"id":300,"lat":52.3242,"lon":14.6519,"rating":4.14,"reviews":7,"wait":31,"signal":"sign","lastUsed":"2025-07-16","comments":[{"text":"Waited around the station for a while, even with a sign, but nothing. Got a lift the moment we went to the exit.","date":"2025-07-16","rating":4},{"text":"Direct to warsaw, stand at the exit with a sign.","date":"2025-06-29","rating":5},{"text":"A lot of traffic, but also a lot of people selling fake tech products to the drivers, which makes it a bit harder to talk to the drivers. In the end a guy approached us when we were sitting in front of the entrance with our sign.","date":"2024-09-15","rating":3},{"text":"good spot , many cars and most going towards poznan or warsaw . just asked few cars and found a guy that took me directly to warsaw .","date":"2024-04-11","rating":5},{"text":"NIce station with a correct traffic, but i still waited 1 h 30 before to find a lift to Poznan.\n\nAt least Frankfurt is not far so you may find a couch using the free wifi.","date":"2015-05-19","rating":4}],"destLat":52.4049,"destLon":16.9189},{"id":684,"lat":52.1312,"lon":20.8882,"rating":4.11,"reviews":9,"wait":32,"signal":null,"lastUsed":"2023-08-01","comments":[{"text":"Great spot! Easy to stop by Gor card, cause they’re not fast yet. We’ve waited about 10-15 minutes and got the first car! :)","date":"2023-08-01","rating":5},{"text":"It took us 3 minutes to catch a lorry directly to Wrocław (thursday 7.30am) It seems very good place for hhiking (bus stop \"Janki Małe\").","date":"2015-03-22","rating":4},{"text":"very good spot, once we catch one car in 5 people! we appear on the bus stop and start waving and in the same time car stops;) the fastest catching in my life ;p\n\nbut another time it was longer.. ;p but big traffic, for sure someone will stop:D","date":"2013-03-17","rating":4},{"text":"I wrote sensless to double warn people about construction in this road going to Warcalw. Took us about 6 hours of driving and there are many traffic jams and criss-cross on the road. If you aren't lucky to get a direct ride to Warclaw, it's certain you better pick a different road until construction is over.","date":"2012-09-15","rating":4},{"text":"Watch out now, since route 8 is under construction so less and less drivers use it to get to Wrocław (most tak A4 to Łódź and then take the turn to Kalisz). We waited there looong hours. Better check before how is the road.","date":"2012-08-22","rating":4}],"destLat":52.1302,"destLon":20.8881},{"id":225,"lat":54.0703,"lon":22.9332,"rating":4.09,"reviews":11,"wait":21,"signal":"thumb","lastUsed":"2025-08-12","comments":[{"text":"perfect spot to Augustow.","date":"2025-08-12","rating":5},{"text":"Took 30 seconds for someone to pick us up to Augustow","date":"2025-08-09","rating":5},{"text":"At evening here small cars","date":"2023-08-23","rating":3},{"text":"after 15 minutes we couth car to Augustow","date":"2016-07-16","rating":4},{"text":"Nice place towards WARSAW. It was early evening around 6 pm, when I was standing here with a WARSAW sign, then got a ride (4 czech cyclist guys :D) directly to WARSAW! :) Good luck there!","date":"2015-08-16","rating":4}],"destLat":53.8401,"destLon":22.9805},{"id":141,"lat":51.1613,"lon":16.1697,"rating":4,"reviews":9,"wait":76,"signal":"sign","lastUsed":"2025-09-02","comments":[{"text":"Good spot for going to Dresden","date":"2025-09-02","rating":5},{"text":"Didn't hitch here as my drivers took me to a better place when noticing this spot was totally empty. Better go to the next ones if you can.","date":"2025-08-28","rating":3},{"text":"You see the time... but the spot isn't that bad at all, maybe we were just unlucky, there is some place to stop a car and it is pretty visible, one more star is because lady from gas station gave us chocolate and tea after 3 hours of waiting for free.","date":"2025-08-03","rating":2},{"text":"I took ride to Hamburg here","date":"2025-06-10","rating":5},{"text":"Great place to go to Dresden. Usually I ask ppl directly if they go to my direction, as the gas station is super small.","date":"2023-10-12","rating":5}],"destLat":51.0288,"destLon":13.7116},{"id":622,"lat":52.3298,"lon":17.0892,"rating":4,"reviews":7,"wait":65,"signal":null,"lastUsed":"2023-10-13","comments":[{"text":"We waited 90 minutes for a car to the polish/german border, but we did it. Lot of people go to Poznan unfortunately","date":"2023-10-13","rating":4},{"text":"chujowe, nie pozdrawiam","date":"2019-08-14","rating":4},{"text":"We didn't even have to use the sign, because as we were having a break, a driver going to Hamburg offered us a ride :)","date":"2016-05-20","rating":4},{"text":"We waited 3 hours to take a car directly to Berlin.","date":"2016-04-18","rating":4},{"text":"Great spot to get to Berlin and may as well work for Szcecin.","date":"2015-07-09","rating":4}],"destLat":52.355,"destLon":14.5647},{"id":190,"lat":51.0505,"lon":16.965,"rating":4,"reviews":5,"wait":18,"signal":null,"lastUsed":"2025-08-24","comments":[{"text":"A little illegal spot, in my opinion the cars were a little to fast here to stop, we changed it after a bit to the station nearby and got a ride there in 30 minutes to the border","date":"2025-06-21","rating":4},{"text":"As a Wrocław resident I always hitchhike from this spot towards German or Czech border,if u r lucky enough u can get straitght to Prague or Dresden.While hitchhiking towards Prague make sure u stay conected to A4 highway and then to S3/E65.Hitchhiking through S8/E67 is barely possible.Out of 10 rides the longest waiting time was 30 minutes,rly recomend this spot","date":"2025-04-28","rating":5},{"text":"I have catched  the car after 1 hour to Berlin","date":"2015-05-23","rating":3},{"text":"It was hard to stop anyone here one day. After 1,5h with sunset I got back home (Wroclaw). Next day from the station few meters before was fine. And I met some hikers there I could talk to and share experience","date":"2014-02-26","rating":3}],"destLat":50.587,"destLon":16.8211},{"id":59,"lat":51.2274,"lon":22.4736,"rating":4,"reviews":4,"wait":53,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Not sure why it took so long, but I got a ride with a sign saying Rzeszów after a while with a guy going to Oświęcim","date":"2025-10-15","rating":4},{"text":"Got a ride to Nowy Sacz through Rzeszow in 10 minutes","date":"2016-09-17","rating":4},{"text":"I used to Hitchhike to Bieszczady mountains from this spot. Thumbs Up !","date":"2014-09-14","rating":4},{"text":"Road to KrakÃ³w, Sandomierz and Kielce. There is a little parking just after crossing two big streets and lights. Traffic is quite big, but cars don't want to stop so much (especially cars to near KraÅ›nik with plate 'LKR'). To catch a car to KrakÃ³w taking me usually 40-60 min but I have to go sometimes with stop in KraÅ›nik.","date":null,"rating":4}],"destLat":50.0419,"destLon":20.8882},{"id":63,"lat":51.2232,"lon":22.6327,"rating":4,"reviews":4,"wait":28,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Had a sign for Zamość, got a ride to Krasnystaw","date":"2025-10-15","rating":4},{"text":"Direct ride to Lviv in 10min","date":"2014-05-16","rating":4},{"text":"got a ride to Krasnystaw after waiting 30minutes","date":"2013-05-31","rating":4},{"text":"Przystanek autobusowy. Zaraz za skrzyżowaniem. Dobra komunikacja z miasta, wystarczy dostać się na Krakowskie przedmieście i wsiąść w Autobus o kierunku Felin.","date":"2012-03-19","rating":4}],"destLat":50.9706,"destLon":23.183},{"id":306,"lat":52.1528,"lon":18.2779,"rating":4,"reviews":4,"wait":29,"signal":null,"lastUsed":"2025-07-08","comments":[{"text":"The traffic speed is quite high there but they slow down a bit and you are quite visible there. 2 people, got ride in 80 mins.","date":"2025-07-08","rating":3},{"text":"Toll on highway. Free clean bathrooms. \r\nPrevious ride dropped us here from Warsaw; dont know how you would get here from Konin town as there is a big fence separating highway from the small road.\r\nCars dont have to stop because it’s an e-toll and there arent that many cars, but still someone going to Poznan picked us up in less than 10 minutes.","date":"2023-05-28","rating":5},{"text":"Very good spot but to get there use one of the gates near bridge or ask nicely a guard and use gate for highway workers because the guard may get lower salary because of YOU!","date":"2015-10-10","rating":4},{"text":"Toll booth Żdżary just before exit Konin-east on A2 Warsaw - Świecko.","date":"2013-08-10","rating":4}],"destLat":52.2952,"destLon":17.6524},{"id":523,"lat":52.4581,"lon":16.6409,"rating":4,"reviews":4,"wait":15,"signal":"thumb","lastUsed":"2024-09-06","comments":[{"text":"Lots of traffic in the morning but cars have space to stop if they want to.","date":"2024-09-06","rating":4},{"text":"Very nice roundabout. I was going west to Germany and cars have to slow down a lot and have enough room to pull over. Go for it!","date":"2015-11-14","rating":4},{"text":"We have been there for travelling to the west (direction Germany) for 1 hour but we must have bad luck because it is a very good spot, many cars going there slowly because of roundabout and also there is some place to stop.","date":"2015-08-03","rating":4},{"text":"Roundabout at the end of Tarnowo Podgorne. Cars have to slow down and there is enough place for them to stop. Go to Ochrody by tram, take bus 91 to Smochowice and then bus 01 to Tarnowo Podgorne. Should take you about an hour to get here.","date":"2011-08-11","rating":4}],"destLat":52.5942,"destLon":15.5056},{"id":557,"lat":50.8588,"lon":20.5854,"rating":4,"reviews":4,"wait":30,"signal":"thumb","lastUsed":"2024-07-17","comments":[{"text":"Got a lift to klemencice gas station on the way to krakow or katowice im 30min","date":"2024-07-17","rating":4},{"text":"The spot is great, I waited about 30 minutes when there was low traffic. I prepared a sign \"E77 -> Krakow\". Since the spot is still kinda in the city not every car goes to the highway, but those who do can easily see you and there is enough space and time for them to stop.","date":"2023-11-09","rating":4},{"text":"A bus stop where you can easily hitch onto the road E77 towards KRAKOW.","date":"2015-08-16","rating":4}],"destLat":50.5577,"destLon":20.2064},{"id":745,"lat":51.9192,"lon":19.3551,"rating":4,"reviews":4,"wait":17,"signal":null,"lastUsed":"2023-03-19","comments":[{"text":"Well, this place is not this attractive anymore. It's possible to get a ride here, but the road is under construction and barely someone will stop here/almost no drivers here as it's not allowed to stop here. But I see no other spots to catch autostop to Poznań in this location, think I just got lucky.","date":"2023-03-19","rating":4},{"text":"Great spot before TOLL check. First time when 2 cars stopped for me in the same time.","date":"2015-07-09","rating":4},{"text":"Here is parking for highway service, so you can catch truck. Great place :)","date":"2015-02-11","rating":4},{"text":"Very good place in direction to Poznań, Berlin. Behind the toll gates, a lot of place for drivers to stop.You can try near traffic circle and if it doesnt work you can walk 1km here.","date":"2013-02-17","rating":4}],"destLat":52.4164,"destLon":16.9046},{"id":26,"lat":50.4298,"lon":16.1977,"rating":4,"reviews":3,"wait":30,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"Lot of czech cars going by. Mostly to Kudowa-Zdrój.","date":"2026-01-16","rating":3},{"text":"Good spot to get to the Wrocław, a lot of trucks","date":"2023-08-15","rating":5},{"text":"Looks like the parking lane on the border is often full and trucks dont have any place to stop. Passenger cars are mostly locals (H number sign) going  shopping in kudowa. Waited one hour to get lift to Zabkowice and Wroclaw.","date":"2015-04-18","rating":4}],"destLat":50.4051,"destLon":16.3855},{"id":234,"lat":50.1057,"lon":19.9647,"rating":4,"reviews":3,"wait":103,"signal":null,"lastUsed":"2025-08-11","comments":[{"text":"I think the place is perfect. There is a bus stop for cars to stop and it's very well reachable via Tram 18 and 50. Also quite busy road but somehow we still waited for over 2 hours. Probably this isn't normal but it happened to us.","date":"2025-08-11","rating":4},{"text":"Nice place to hith-hiking to Warszawa, Radom, Kielce... Bus stop there to make easier stop the cars. \n\nI was waiting like 1:40h but I think normally is less time.\n\nIf rains you should look for another place before or after where is a bridge.","date":"2014-10-13","rating":4}],"destLat":51.119,"destLon":20.8506},{"id":288,"lat":50.0164,"lon":20.1408,"rating":4,"reviews":3,"wait":38,"signal":null,"lastUsed":"2025-07-22","comments":[{"text":"to Rzeszow","date":"2014-06-11","rating":4}],"destLat":49.9866,"destLon":20.342},{"id":292,"lat":52.2622,"lon":20.9525,"rating":4,"reviews":3,"wait":34,"signal":"sign","lastUsed":"2025-07-22","comments":[{"text":"Lot of traffic, bus stop with enough space for small cars. We held sign Brwinow (20km).","date":"2025-07-22","rating":4},{"text":"bus stop Gen. Maczka, S8 towards Poznań.","date":"2012-09-01","rating":4}],"destLat":52.1556,"destLon":20.683},{"id":599,"lat":52.2778,"lon":16.6875,"rating":4,"reviews":3,"wait":15,"signal":"ask-sign","lastUsed":"2024-04-24","comments":[{"text":"It's good to also ask at the gas station. Lot of local ppl, but I got a ride to Wroclaw.","date":"2024-04-24","rating":4},{"text":"Right after the roundabout there's enough space to hitch.","date":"2016-05-20","rating":4}],"destLat":51.0427,"destLon":16.9718},{"id":46,"lat":53.9979,"lon":22.8261,"rating":4,"reviews":2,"wait":28,"signal":"thumb","lastUsed":"2025-10-31","comments":[{"text":"Works very well for Kaunas. Okay amount of traffic.","date":"2025-10-31","rating":4},{"text":"Most cars were ignoring me but fortunately I found a ride to Kaunas","date":"2025-07-04","rating":4}],"destLat":54.9351,"destLon":23.8706},{"id":50,"lat":51.9057,"lon":15.5893,"rating":4,"reviews":2,"wait":3,"signal":"ask","lastUsed":"2025-10-22","comments":[{"text":"To all non polish hitchhikers. There is a shooting range nearby this service station owned by former policeman who is allso a psychopath. He has 4 aggressive dogs that roam freerly in forest next to this service station. AVOID CAMPING OUTSIDE OF SERVICE STATION AND DON'T GO TO THE FOREST","date":"2025-10-22","rating":3},{"text":"a beautiful gas station with KFC, we got a ride all the way to Szczecin. look at the license plates ;)","date":"2025-09-04","rating":5}],"destLat":53.4275,"destLon":14.5555},{"id":66,"lat":53.1445,"lon":23.0833,"rating":4,"reviews":2,"wait":63,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Probably the best place to get out of Białystok in direction Warsaw. For some reason no one picked me up for an hour and a half, I gave up for the night then came back in the morning and got a ride to a gas station in 20 minutes","date":"2025-10-15","rating":3},{"text":"5min waiting for transport to warsaw","date":"2025-07-24","rating":5}],"destLat":53.1441,"destLon":22.7933},{"id":82,"lat":50.1024,"lon":19.007,"rating":4,"reviews":2,"wait":10,"signal":"sign","lastUsed":"2025-10-12","comments":[{"text":"Nice couple took us, also one van stopped and offered 5km ride","date":"2025-08-10","rating":5}],"destLat":50.2079,"destLon":19.1663},{"id":90,"lat":50.5748,"lon":19.0494,"rating":4,"reviews":2,"wait":73,"signal":"sign","lastUsed":"2025-09-30","comments":[{"text":"It seems to be great for Czech and Austria, but actually there are a lot of cars going S1 not A1, highly recommended to make a sign with direction. I waited there almost two hours, but after that I was taken by truck driver going to Slovenia. We managed to get to Brno in his driving time limit.","date":"2025-09-30","rating":4},{"text":"Good spot with a lot of trucks going to CZ, RO, SK, IT. But a lot of local cars who are very helpful and want to ride you further even if it's just few kilometers .","date":"2025-09-03","rating":4}],"destLat":49.1176,"destLon":16.6043},{"id":202,"lat":53.8468,"lon":23.0018,"rating":4,"reviews":2,"wait":30,"signal":null,"lastUsed":"2025-08-19","comments":[{"text":"Couple ~25yo. Not a good spot for stopping, even though there's a small crossing right after it. Decent traffic, cars going slow after the roundabout. Lots of local traffic. Finally got a ride to Giby, just to go past the local traffic.","date":"2025-08-19","rating":3}],"destLat":54.0462,"destLon":23.3559},{"id":235,"lat":50.8472,"lon":19.0446,"rating":4,"reviews":2,"wait":53,"signal":"thumb","lastUsed":"2025-08-11","comments":[{"text":"Most of cars are going in kłobuck direction it is not the best for katowice or kraków","date":"2025-08-11","rating":3},{"text":"super busy, fast ride","date":"2024-03-25","rating":5}],"destLat":49.9733,"destLon":19.9196},{"id":308,"lat":50.5721,"lon":21.1699,"rating":4,"reviews":2,"wait":15,"signal":null,"lastUsed":"2025-07-06","comments":[{"text":"Okay traffic, many locals going halfway/all the way to Kielce. Not the best for stopping a car but doable for someone who's willing to help.","date":"2025-07-06","rating":4},{"text":"To get out of Staszow towards west, not too much traffic as well as there isn't really a good spot for cars to stop but it will do the job, wait time of 10-30 minutes expected","date":"2025-06-18","rating":4}],"destLat":50.8752,"destLon":20.6276},{"id":317,"lat":51.1093,"lon":16.9297,"rating":4,"reviews":2,"wait":23,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Stood at the busstop. Lots of traffic. Got a ride to Olesnica.","date":"2025-07-01","rating":4},{"text":"Ride to Olesnica, I would say it is a better place than the one on the other side of the highway…","date":"2023-08-02","rating":4}],"destLat":51.227,"destLon":17.3683},{"id":357,"lat":50.5695,"lon":22.0348,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Pretty fine spot towards Tarnobrzeg, not the most traffic but will do the job, a lot of locals, wait time of 20-30 minutes to be expected","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":428,"lat":53.8066,"lon":21.5788,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Pretty nice spot, first car picked up yet again towards Elk, local traffic mostly during winter, wait time of 2 minutes","date":"2025-01-31","rating":5}],"destLat":null,"destLon":null},{"id":604,"lat":50.4345,"lon":16.2369,"rating":4,"reviews":2,"wait":30,"signal":"ask","lastUsed":"2024-04-19","comments":[{"text":"Smaller gas station with middle traffic. Lot of locals. There were some Czech cars on the parking lots of Lidl and Biedronka. One of them took me to Náchod.","date":"2024-04-19","rating":4}],"destLat":50.4167,"destLon":16.1685},{"id":666,"lat":53.8247,"lon":22.962,"rating":4,"reviews":2,"wait":90,"signal":null,"lastUsed":"2023-08-17","comments":[{"text":"Great spot for baltic countries. Many lithuanian trucks drive by. After hour we stopped a car to Vilnius","date":"2023-08-17","rating":4},{"text":"There's parking for trucks and small restaurant, good place to stop, but unfortunately cars are going pretty fast. Many Lithuanian cars drive by","date":"2023-04-29","rating":4}],"destLat":54.5893,"destLon":25.2778},{"id":708,"lat":52.1849,"lon":20.9739,"rating":4,"reviews":2,"wait":26,"signal":null,"lastUsed":"2023-07-02","comments":[{"text":"Good spot, with space for them to stop.","date":"2023-06-15","rating":5}],"destLat":52.1849,"destLon":20.9739},{"id":754,"lat":51.4143,"lon":21.2045,"rating":4,"reviews":2,"wait":20,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Za wyjazdem z mcdonalda jest barierka przy drodze i za tą barierką jest małe pobocze z kamyczków","date":"2023-01-03","rating":4}],"destLat":51.4145,"destLon":21.2092},{"id":1,"lat":53.8335,"lon":22.9647,"rating":4,"reviews":1,"wait":2,"signal":"sign","lastUsed":"2026-01-25","comments":[{"text":"Even though this was a quick ride for me, you can likely find a better spot. There is a large truck parking lot and a McDonald's drive-through; many people use it, so that might be a good opportunity. Also, there is free Wi-Fi at the nearby McDonald's.","date":"2026-01-25","rating":4}],"destLat":54.1149,"destLon":22.9367},{"id":38,"lat":49.634,"lon":21.7856,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-12-09","comments":[{"text":"ok spot to hitchhike towards Slovakia","date":"2025-12-09","rating":4}],"destLat":49.5038,"destLon":21.6983},{"id":57,"lat":49.8735,"lon":20.8119,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"To Nowy Sącz","date":"2025-10-15","rating":4}],"destLat":49.6093,"destLon":20.6998},{"id":58,"lat":49.9792,"lon":20.9059,"rating":4,"reviews":1,"wait":100,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"For some reason no one wanted to pick me up in the evening so I gave up and got a ride within 5 minutes the next morning","date":"2025-10-15","rating":4}],"destLat":49.874,"destLon":20.8124},{"id":78,"lat":50.9186,"lon":15.7565,"rating":4,"reviews":1,"wait":60,"signal":"sign","lastUsed":"2025-10-15","comments":[{"text":"Not really a great spot, but I believe it is the best in the Wroclaw direction. Hiched from here early summer morning, got a  ride all the way to Wroclaw.","date":"2025-10-15","rating":4}],"destLat":51.1199,"destLon":17.0343},{"id":92,"lat":50.1312,"lon":18.6832,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-09-25","comments":[{"text":"some traffic both ways. cars are going slowly, you dont have a side walk though.","date":"2025-09-25","rating":4}],"destLat":49.9443,"destLon":18.4304},{"id":94,"lat":50.2661,"lon":18.6598,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-09-25","comments":[{"text":"Pretty good spot, a lot of people going south. not much traffic into chechia itself, but you can get closer to the border.","date":"2025-09-25","rating":4}],"destLat":50.2182,"destLon":18.6859},{"id":97,"lat":50.0369,"lon":18.7011,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-09-21","comments":[{"text":"Not a lot of cars, but opened 24/7. Take any ride that takes you closer to Katowice.","date":"2025-09-21","rating":4}],"destLat":50.1208,"destLon":18.8142},{"id":103,"lat":53.8588,"lon":23.0049,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-09-13","comments":[{"text":"A bus stop with enough space for cars to stop. Good spot if you want to get out of Augustów and go to Suwałki (which is eventually much better city to get a ride to Lithuania). Waited 25 minutes with sign Suwałki/Kaunas.","date":"2025-09-13","rating":4}],"destLat":54.1285,"destLon":22.9403},{"id":115,"lat":54.2775,"lon":18.589,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-09-11","comments":[{"text":"Had luck, but if you are in a direction of Warsaw and you ask around, people will take you at least to the first gas station on the highway (10 km). Which is a good one with McDonald's.","date":"2025-09-11","rating":4}],"destLat":52.3288,"destLon":17.0899},{"id":125,"lat":50.2279,"lon":20.0115,"rating":4,"reviews":1,"wait":20,"signal":"ask","lastUsed":"2025-09-07","comments":[{"text":"Quite a good place to continue on the road outside Krakow - in the direction of Czech Republic/Slovakia","date":"2025-09-07","rating":4}],"destLat":50.2453,"destLon":19.0373},{"id":130,"lat":50.9107,"lon":20.6806,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-06","comments":[{"text":"Years ago on my first trip i got a trucker stop here in the middle of the night and took me to Warsaw. No shade, no facilities, just visability and plenty o’room to stop for even the bigest trucks","date":"2025-09-06","rating":4}],"destLat":52.2413,"destLon":21.0086},{"id":135,"lat":51.524,"lon":16.0603,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-09-04","comments":[{"text":"there's a wide side next to the road, cars go fast but have plenty of space to stop. a local guy told us that this is where people go to smoke weed and that prostitutes wait there in the summer, so it's probably a good spot for stopping cars:)","date":"2025-09-04","rating":4}],"destLat":51.5773,"destLon":15.9485},{"id":138,"lat":51.0272,"lon":16.1843,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-09-03","comments":[{"text":"a bus stop next to a tank station, where we refilled our water. a nice guy on his way to work drove us to legnica and gave us tips where to hitch next. there's a bush on the corner covering the view a bit, though.","date":"2025-09-03","rating":4}],"destLat":51.1846,"destLon":16.1664},{"id":143,"lat":50.3052,"lon":18.6309,"rating":4,"reviews":1,"wait":1,"signal":"sign","lastUsed":"2025-09-02","comments":[{"text":"If you want to go out of Gliwice you can try to get here lift to kozłów McDonald's (then we go on the West - Wrocław)","date":"2025-09-02","rating":4}],"destLat":50.312,"destLon":18.5513},{"id":145,"lat":49.5577,"lon":19.7603,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-09-01","comments":[{"text":"A good spot with a beautiful view. Mostly locals, but we quickly got a ride right up to the Slovak border.","date":"2025-09-01","rating":4}],"destLat":49.417,"destLon":19.666},{"id":146,"lat":49.6065,"lon":19.9265,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-09-01","comments":[{"text":"Mostly locals, we quickly caught a short ride towards the Slovak border.","date":"2025-09-01","rating":4}],"destLat":49.5575,"destLon":19.7599},{"id":157,"lat":49.6479,"lon":18.8675,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-31","comments":[{"text":"We were looking for tourists but eventually found a local going to Ustron. Should have probably waited more for longer distance","date":"2025-08-31","rating":4}],"destLat":49.7227,"destLon":18.7964},{"id":160,"lat":54.0686,"lon":18.4544,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-30","comments":[{"text":"Many locals use to go over there","date":"2025-08-30","rating":4}],"destLat":53.9671,"destLon":18.5323},{"id":163,"lat":53.5876,"lon":18.6353,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-08-29","comments":[{"text":"The spot was not ideal as there was little space for a car to stop, but the cars drove slowly as there is roundabout. We got lucky that one nice guy stopped at the parking lot and took us.","date":"2025-08-29","rating":4}],"destLat":54.4708,"destLon":18.4878},{"id":166,"lat":52.4043,"lon":17.058,"rating":4,"reviews":1,"wait":7,"signal":null,"lastUsed":"2025-08-29","comments":[{"text":"Cars are going fast, but there is a bus stop with a space to stop. We stood at the light to be visible.","date":"2025-08-29","rating":4}],"destLat":52.5069,"destLon":17.472},{"id":170,"lat":51.5692,"lon":16.0403,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-08-28","comments":[{"text":"The cars are going fast, but there is a space at bus stop.","date":"2025-08-28","rating":4}],"destLat":51.6595,"destLon":16.084},{"id":180,"lat":52.3305,"lon":15.2815,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-08-26","comments":[{"text":"Just a few cars but good spot to get out from Łagów","date":"2025-08-26","rating":4}],"destLat":52.3048,"destLon":15.2489},{"id":186,"lat":53.2702,"lon":22.1247,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-08-25","comments":[{"text":"Truck stop, no gas station just bathrooms. Not that many cars or trucks, but still a decent steady drop. Asked around and got a car quite soon.","date":"2025-08-25","rating":4}],"destLat":52.7137,"destLon":21.6937},{"id":195,"lat":49.3942,"lon":20.1051,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2025-08-23","comments":[{"text":"Quite a lot of traffic and space to pull over, however you’re a bit to the right from the road so it might be a bit hard for drivers to see you.","date":"2025-08-23","rating":4}],"destLat":49.3406,"destLon":20.1415},{"id":216,"lat":53.4523,"lon":14.3792,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-14","comments":[{"text":"bus stop, people drive slowly. there is tariff patrol stationed on the opposite side but they don't care you're here. 90% german cars not going very far","date":"2025-08-14","rating":4}],"destLat":null,"destLon":null},{"id":217,"lat":53.428,"lon":14.4744,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-08-14","comments":[{"text":"surprisingly good spot for getting out of the city, you only need to ride a tram and walk a bit to get there. a big parking lot for cars to stop comfortably, people driving very slowly. mostly locals but they'll take you to the border crossing","date":"2025-08-14","rating":4}],"destLat":53.4525,"destLon":14.3779},{"id":220,"lat":51.1588,"lon":15.0293,"rating":4,"reviews":1,"wait":2,"signal":null,"lastUsed":"2025-08-14","comments":[{"text":"Cars are going fast, but there is space for them to stop and most are going in the direction of wroclaw, krakow etc","date":"2025-08-14","rating":4}],"destLat":51.0604,"destLon":16.9382},{"id":221,"lat":50.4774,"lon":17.3394,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-08-13","comments":[{"text":"Quite a nice spot. We waited here around one hour and some kind, old hitchhiker in camper van took us to Zlote Hory.","date":"2025-08-13","rating":4}],"destLat":50.2539,"destLon":17.3991},{"id":237,"lat":49.8138,"lon":18.9194,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-08-10","comments":[{"text":"Nice spot at bus stop, also a petrol and McD nearby.","date":"2025-08-10","rating":4}],"destLat":49.7498,"destLon":18.6241},{"id":238,"lat":50.5739,"lon":19.0501,"rating":4,"reviews":1,"wait":80,"signal":"sign","lastUsed":"2025-08-10","comments":[{"text":"Probably just bad luck, many cars passing by, mostly families with full car","date":"2025-08-10","rating":4}],"destLat":50.1049,"destLon":19.0068},{"id":239,"lat":49.8438,"lon":19.0345,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-08-10","comments":[{"text":"There is a light close to the traffic light. Cars go fast in a lot of lines. We get a direct ride to check cziesin","date":"2025-08-10","rating":4}],"destLat":49.7331,"destLon":18.629},{"id":240,"lat":49.6492,"lon":19.8981,"rating":4,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-08-10","comments":[{"text":"With sign a direct stop. Fast going cars","date":"2025-08-10","rating":4}],"destLat":49.8874,"destLon":19.4803},{"id":243,"lat":53.9789,"lon":23.2871,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2025-08-09","comments":[{"text":"Not that many cars but got a lift pretty quickly.","date":"2025-08-09","rating":4}],"destLat":54.2275,"destLon":23.5257},{"id":250,"lat":49.858,"lon":19.026,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-08-06","comments":[{"text":"Okey spot to go in direction to Tychy. We had a sign \"Warszawa\".","date":"2025-08-06","rating":4}],"destLat":49.9875,"destLon":18.955},{"id":263,"lat":50.2763,"lon":18.6614,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-08-04","comments":[{"text":"I got picked up by a truck driver who was going straight to Vienna. Although he said that it's not a good spot for that far as many ppl head there towards Rybnik.","date":"2025-08-04","rating":4}],"destLat":48.1986,"destLon":16.3849},{"id":272,"lat":54.533,"lon":17.7597,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-08-02","comments":[{"text":"We waited with the sign, many people went to the gas station, but after like 25 minutes a guy stopped and brought us to Gdańsk.","date":"2025-08-02","rating":4}],"destLat":54.3566,"destLon":18.6548},{"id":277,"lat":50.1509,"lon":19.4386,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-07-30","comments":[{"text":"Very good to hike west-north towards katowice","date":"2025-07-30","rating":4}],"destLat":50.2451,"destLon":19.0367},{"id":294,"lat":54.1295,"lon":22.9492,"rating":4,"reviews":1,"wait":52,"signal":"sign","lastUsed":"2025-07-19","comments":[{"text":"Relatively long wait but we got a very good ride to Panevezys. Slow traffic, but most cars are local","date":"2025-07-19","rating":4}],"destLat":55.7808,"destLon":24.3648},{"id":311,"lat":51.3902,"lon":22.2461,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2025-07-04","comments":[{"text":"We've asked a few people on the gas station and one agreed to pick us up, drove straight toWarsaw.","date":"2025-07-04","rating":4}],"destLat":52.182,"destLon":21.0231},{"id":319,"lat":51.3921,"lon":19.4057,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-06-28","comments":[{"text":"Goodd spot for find a cars in direction to Piotrkow","date":"2025-06-28","rating":4}],"destLat":null,"destLon":null},{"id":321,"lat":51.0728,"lon":19.4469,"rating":4,"reviews":1,"wait":5,"signal":"sign","lastUsed":"2025-06-28","comments":[{"text":"Good place to catch a car to Kamiensk","date":"2025-06-28","rating":4}],"destLat":null,"destLon":null},{"id":329,"lat":50.4335,"lon":16.2057,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-06-22","comments":[{"text":"Not so good, but the people who exchange some Money can take you for a small road ! 🌸","date":"2025-06-22","rating":4}],"destLat":50.716,"destLon":16.8276},{"id":330,"lat":51.3858,"lon":21.0926,"rating":4,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-06-20","comments":[{"text":"Ok spot, cars can easily stop and are moving slow. I got lucky the guy was going to a town nearby but decided to go on a detour and drop me at the MOP on the E77","date":"2025-06-20","rating":4}],"destLat":51.0307,"destLon":20.8167},{"id":334,"lat":52.7425,"lon":22.3143,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Czyzew, a bit more traffic here but still lots of locals, no shoulders or anything but cars can stop on the road due to low traffic, wait time of 10-20 minutes expected","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":337,"lat":52.5817,"lon":22.2917,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Ceranow, very low traffic, mostly locals, one of these Polish smaller towns and villages where u can just walk next to the road on sidewalk and stop the cars coming, wide road, wait time expected to be 5-20 minutes","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":344,"lat":52.4449,"lon":21.0017,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Towards Serock, as of June 2025 there are construction works going on so the speeds are slow, the workers advised me to stay on this side focusing on cars coming from Nieporet as it would be hard to stop cars already on the road due to the nature of the road works, and it did work, a ride within 5-10 minutes, but no real shoulder for them to stop so just be fast to jump into the car","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":350,"lat":50.5262,"lon":20.8868,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Barely any traffic, but locals are very friendly, most likely first car will pick you up and get you closer to Chmielnik, the question only would be when is the first car gonna come, you can hitch anywhere on this road, wait time of 5-30 minutes expected","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":359,"lat":51.1907,"lon":22.4348,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-18","comments":[{"text":"Pretty decent MOP, good for southbound traffic, doesn't get most amount of traffic but you'll find a ride south within a hour","date":"2025-06-18","rating":4}],"destLat":null,"destLon":null},{"id":367,"lat":52.6707,"lon":23.0988,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Not on this map, but actually there's a bus stop towards Bocki, decent traffic, quite high speeds but literally the only hitchable location around here, wait time around 20 minutes","date":"2025-06-12","rating":4}],"destLat":null,"destLon":null},{"id":369,"lat":52.7338,"lon":23.1591,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Towards south, decent village to hitchhike from, but this is about the last good spot around here, so try to accept only rides that go at least to Bocki, wait time of 5-15 minutes","date":"2025-06-12","rating":4}],"destLat":null,"destLon":null},{"id":370,"lat":52.749,"lon":23.1709,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Wide shoulder before roundabout, since everybody goes south anyways might just hitchhike here, wait time of 5-20 minutes, but a lot of locals","date":"2025-06-12","rating":4}],"destLat":null,"destLon":null},{"id":378,"lat":53.9522,"lon":23.2066,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-06-12","comments":[{"text":"Towards Augustow, you'll get a car there pretty fast, but not further, locals turning usually just go to there, wait time of 5-20 minutes","date":"2025-06-12","rating":4}],"destLat":null,"destLon":null},{"id":385,"lat":52.4224,"lon":21.1912,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2025-06-02","comments":[{"text":"Good spot to escape Radzymin if you want go to Łomża/Białystok/Suwałki","date":"2025-06-02","rating":4}],"destLat":52.4582,"destLon":21.2937},{"id":405,"lat":49.6874,"lon":21.7516,"rating":4,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-04-29","comments":[{"text":"There aren't many good places around, so I recommend asking drivers using gas station. We were lucky and left with the first one asked :-)","date":"2025-04-29","rating":4}],"destLat":49.4756,"destLon":21.7084},{"id":406,"lat":50.0761,"lon":18.6642,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2025-04-29","comments":[{"text":"Just asked everybody to get a lift to Warsaw. After 20 mins found a guy next to toilet area going to Warsaw. Probably the best place to hitch north because some people were going to Gdansk and Lodz.","date":"2025-04-29","rating":4}],"destLat":52.2172,"destLon":20.9609},{"id":409,"lat":53.9387,"lon":21.5532,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2025-04-29","comments":[{"text":"Spot to move from Ryn to Giżycko","date":"2025-04-29","rating":4}],"destLat":54.0386,"destLon":21.7531},{"id":424,"lat":53.7904,"lon":21.976,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Around bus station towards Elk, there's also streetlights (not the best) very little traffic around 8-9pm but got a ride with 35 minutes, speeds are low","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":433,"lat":53.5996,"lon":19.5805,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Decent bus stop but still in the city, hard to get out, direction towards Ostroda, got a ride within 15 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":439,"lat":51.0379,"lon":16.8924,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Would put 5, but not sure how legal it would be, got a car towards west within couple minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":441,"lat":52.185,"lon":18.8814,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards Dabie, good straight road, but little traffic, mainly local, wait time of 20 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":442,"lat":52.2274,"lon":18.901,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards Dabie, good location, especially when trains stop the traffic, waited here, there was sort of a shoulder, took me 30 minutes but it was early in the morning, not too many cars","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":451,"lat":52.147,"lon":20.6152,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Decent spot to get towards Lodz, I was there late in the evening so not a lot of traffic, speeds are down but be sure to walk down here as up cars cant tell which direction you want to go to, also got recommended parking lot at the other side of the road, but at that time there was only 1 car there, waiting time of 30-35 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":452,"lat":52.1804,"lon":20.6114,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Long straight part with speeds down, no shoulder but also not much traffic, towards the direction of Tluste, waited 10 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":453,"lat":52.2053,"lon":20.6461,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Nice straight part, last place to get a ride before Blonie if headed to west, also traffic light does slow cars down, got a car here immediately but lots of local traffic","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":460,"lat":50.8252,"lon":20.6221,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Not the best but decent spot towards south, note that most cars here are local, bust stop with decent width, speeds arent that bad, wait time of 10 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":462,"lat":52.7491,"lon":22.8253,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Decent bus stop towards the direction of Szepietowo, not the best but will do the job, little traffic with mostly locals, but got a ride within 20 minutes","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":465,"lat":53.0747,"lon":23.0884,"rating":4,"reviews":1,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Decent spot towards Lapy or Sokoly, not too much space but speeds are low, wait time of 20 minutes or so","date":"2025-01-31","rating":4}],"destLat":null,"destLon":null},{"id":476,"lat":54.1369,"lon":19.4155,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2024-12-14","comments":[{"text":"I got a ride towards Warsaw in 20min. TBH we were lucky with that, but okay.","date":"2024-12-14","rating":4}],"destLat":52.2216,"destLon":21.0661},{"id":479,"lat":50.8912,"lon":20.6189,"rating":4,"reviews":1,"wait":25,"signal":null,"lastUsed":"2024-12-05","comments":[{"text":"Bus stop. Good spot to catch a ride towards Łódź.","date":"2024-12-05","rating":4}],"destLat":51.7656,"destLon":19.4527},{"id":480,"lat":49.4292,"lon":20.2658,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2024-11-17","comments":[{"text":"Really good spot on the bus stop. Easy to get a ride to Nowy Targ or Kraków even.","date":"2024-11-17","rating":4}],"destLat":49.9903,"destLon":19.9175},{"id":488,"lat":49.9585,"lon":19.7329,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-10-25","comments":[{"text":"It's quite a busy gas station, so I got a ride pretty quickly (without asking, just hitching at the exit). A truck driver passing Kraków took me to the Kraków ring road and dropped me off on the highway. I took a short walk to the nearby Lidl for a bus.","date":"2024-10-25","rating":4}],"destLat":50.0012,"destLon":19.9409},{"id":500,"lat":52.9929,"lon":18.5888,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2024-09-28","comments":[{"text":"I was going next to the road with my sign on my backpack and some driver pull over to pick me. I was going to the gas station.","date":"2024-09-28","rating":4}],"destLat":52.8285,"destLon":18.309},{"id":514,"lat":51.3285,"lon":22.3896,"rating":4,"reviews":1,"wait":35,"signal":null,"lastUsed":"2024-09-09","comments":[{"text":"Not that much space for drivers to pull over but a steady flow of cars. Very clear at least where you are wanting to get to.","date":"2024-09-09","rating":4}],"destLat":52.0935,"destLon":20.8104},{"id":515,"lat":51.2749,"lon":22.4846,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-09-09","comments":[{"text":"Trying for ride to Warsaw. Driver was not going far so they dropped me further down road at on ramp to S12.","date":"2024-09-09","rating":4}],"destLat":51.328,"destLon":22.392},{"id":517,"lat":50.6745,"lon":18.648,"rating":4,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2024-09-08","comments":[{"text":"I guess it's ok. Some waiting, but mostly local traffic, although I think it's possible to get long ride here. A lot of traffic and place to stop. Cars are going pretty slow","date":"2024-09-08","rating":4}],"destLat":50.7069,"destLon":18.5597},{"id":520,"lat":54.2337,"lon":18.6074,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2024-09-08","comments":[{"text":"There's not much space to stop there. Some local traffic, which means only short rides, but still a good place to go somewhere from Pruszcz Gdański","date":"2024-09-08","rating":4}],"destLat":54.1044,"destLon":18.6922},{"id":524,"lat":49.5438,"lon":21.689,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-08-31","comments":[{"text":"road with almost no place to stop except pathwalk, but its a main road to slovakia, hungary and romania. Romanian truck stopped and took me straight to Oradea.","date":"2024-08-31","rating":4}],"destLat":47.0472,"destLon":21.9197},{"id":526,"lat":49.9519,"lon":21.914,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2024-08-30","comments":[{"text":"there is bus stop so cars can stop easily","date":"2024-08-30","rating":4}],"destLat":49.5559,"destLon":21.6831},{"id":528,"lat":52.2229,"lon":21.231,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2024-08-30","comments":[{"text":"Nice place to hitch to Siedlce or Lublin, with sign and thumb it was 20 minutes for a ride","date":"2024-08-30","rating":4}],"destLat":51.386,"destLon":22.2465},{"id":529,"lat":52.3231,"lon":14.658,"rating":4,"reviews":1,"wait":120,"signal":null,"lastUsed":"2024-08-29","comments":[{"text":"Been thumbing at the exit, not a lot of cars stop. Not the best spot, but could work for Poznan/Warsaw direction. Also a bonus point for having a Zabka shop","date":"2024-08-29","rating":4}],"destLat":52.3089,"destLon":16.4022},{"id":546,"lat":51.1577,"lon":17.0287,"rating":4,"reviews":1,"wait":15,"signal":"ask-sign","lastUsed":"2024-08-06","comments":[{"text":"In my opnion good spot.. a loooot of cars going around! I recommend a big sign and someone will pick you up!","date":"2024-08-06","rating":4}],"destLat":52.4055,"destLon":16.9084},{"id":568,"lat":51.1092,"lon":16.9416,"rating":4,"reviews":1,"wait":45,"signal":"sign","lastUsed":"2024-07-02","comments":[{"text":"Lot of traffic coming through, worth trying if you are nearby.","date":"2024-07-02","rating":4}],"destLat":51.212,"destLon":16.1541},{"id":573,"lat":49.8492,"lon":19.2146,"rating":4,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2024-06-11","comments":[{"text":"Great spot to catch something to Bielsko-Biała","date":"2024-06-11","rating":4}],"destLat":49.8086,"destLon":19.0453},{"id":574,"lat":54.209,"lon":16.1525,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2024-06-08","comments":[{"text":"People took us to go to szczecin ! Really nice, not the best spot, but car can stop on the band for the petrolstation.","date":"2024-06-08","rating":4}],"destLat":null,"destLon":null},{"id":593,"lat":50.2092,"lon":18.9647,"rating":4,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2024-04-27","comments":[{"text":"It's a good spot, however cars drive a bit too fast (it may lower the catch rate).","date":"2024-04-27","rating":4}],"destLat":50.1304,"destLon":18.686},{"id":597,"lat":50.953,"lon":16.7763,"rating":4,"reviews":1,"wait":20,"signal":"sign","lastUsed":"2024-04-24","comments":[{"text":"Smaller gas station (most people go to Wroclaw). Possible to Hitchhick by the road next to it. Got a ride to Swidnica in 15-20 min.","date":"2024-04-24","rating":4}],"destLat":50.8363,"destLon":16.4754},{"id":617,"lat":53.2318,"lon":19.3894,"rating":4,"reviews":1,"wait":1,"signal":null,"lastUsed":"2024-01-16","comments":[{"text":"I waited 1 minute but maybe I just got lucky because it was a blizzard and the guy took pity on me. I was going towards Warsaw. Took me more than halfway there.","date":"2024-01-16","rating":4}],"destLat":52.6099,"destLon":20.3648},{"id":623,"lat":52.8704,"lon":17.6994,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-10-13","comments":[{"text":"Not a lot of place to stop a car but anyway...\r\nLast driver left us here. We(boy&girl) caught a car in 15 minutes to the next gas station (2 km)","date":"2023-10-13","rating":4}],"destLat":52.836,"destLon":17.6909},{"id":626,"lat":50.2453,"lon":19.0309,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"Pretty fine spot for going to Krakow","date":"2023-10-12","rating":4}],"destLat":49.9874,"destLon":19.9134},{"id":635,"lat":52.0935,"lon":20.8087,"rating":4,"reviews":1,"wait":90,"signal":null,"lastUsed":"2023-09-27","comments":[{"text":"Not too many cars but the best spot in town do get out of the Warsaw suburbs","date":"2023-09-27","rating":4}],"destLat":51.9939,"destLon":20.5465},{"id":648,"lat":52.2427,"lon":22.7772,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-09-08","comments":[{"text":"Long waiting but good spot in the middle of a village - bus stop.","date":"2023-09-08","rating":4}],"destLat":52.2427,"destLon":22.7771},{"id":650,"lat":52.2753,"lon":16.686,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-09-04","comments":[{"text":"a long shoulder, wait just before it","date":"2023-09-04","rating":4}],"destLat":51.1199,"destLon":17.0343},{"id":652,"lat":53.8103,"lon":21.9437,"rating":4,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-09-04","comments":[{"text":"the road was not crowded at 11 am, but got a ride to Olsztyn pretty easily, quite a few cars with the Gdansk licence plates, so there is a possibility to get a ride to Gdansk directly","date":"2023-09-04","rating":4}],"destLat":53.7705,"destLon":20.3653},{"id":653,"lat":54.051,"lon":22.8948,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-09-01","comments":[{"text":"when I was there, there was a big queue of trucks waiting to fuel up. the fourth guy I spoke to was the first that was driving to Lithuania and agreed to take me as well. not terrible spot, I guess","date":"2023-09-01","rating":4}],"destLat":54.901,"destLon":23.8329},{"id":663,"lat":50.0544,"lon":19.2005,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-08-21","comments":[{"text":"Great spot to hitchhike to Katowice, I waited 10 mins and got a ride to a town 5-10km away from the City, also got a ride from that town (10.min wait) to the train station in katowice \r\n(Maybe I was just lucky","date":"2023-08-21","rating":4}],"destLat":50.2339,"destLon":19.1457},{"id":668,"lat":50.0157,"lon":18.9543,"rating":4,"reviews":1,"wait":15,"signal":null,"lastUsed":"2023-08-16","comments":[{"text":"Average amount of cars, but ok to get a ride to Katowice.","date":"2023-08-16","rating":4}],"destLat":50.2674,"destLon":19.1849},{"id":680,"lat":51.9834,"lon":20.517,"rating":4,"reviews":1,"wait":90,"signal":null,"lastUsed":"2023-08-04","comments":[{"text":"Fajne miejsce za rondem.","date":"2023-08-04","rating":4}],"destLat":51.6542,"destLon":20.1527},{"id":683,"lat":50.826,"lon":16.3047,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-08-02","comments":[{"text":"Ride to Swidnica","date":"2023-08-02","rating":4}],"destLat":50.837,"destLon":16.4658},{"id":696,"lat":52.1954,"lon":20.9271,"rating":4,"reviews":1,"wait":40,"signal":null,"lastUsed":"2023-07-21","comments":[{"text":"At the bus stop","date":"2023-07-21","rating":4}],"destLat":52.0757,"destLon":20.7751},{"id":723,"lat":51.1655,"lon":17.026,"rating":4,"reviews":1,"wait":60,"signal":null,"lastUsed":"2023-05-02","comments":[{"text":"There were two more pairs of hitchhikers and all of the groups had a lift. 30 minutes by bus from the city center.","date":"2023-05-02","rating":4}],"destLat":50.2449,"destLon":19.0325},{"id":731,"lat":53.6931,"lon":22.4426,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2023-04-18","comments":[{"text":"Prostki - Grajewo\r\nPeople drive here very slowly","date":"2023-04-18","rating":4}],"destLat":53.6472,"destLon":22.4567},{"id":732,"lat":53.1532,"lon":22.05,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-04-18","comments":[{"text":"Łomża - Warsaw","date":"2023-04-18","rating":4}],"destLat":52.2326,"destLon":21.0045},{"id":733,"lat":53.6389,"lon":22.4366,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2023-04-18","comments":[{"text":"Grajewo - Łomża\r\nGreat place if u wanna go to Łomża, from where its easier to get to Warsaw","date":"2023-04-18","rating":4}],"destLat":53.174,"destLon":22.0683},{"id":736,"lat":50.1485,"lon":19.3017,"rating":4,"reviews":1,"wait":120,"signal":null,"lastUsed":"2023-04-10","comments":[{"text":"Got there at about 9am, waited for about 2hours and got a ride to Wroclaw.","date":"2023-04-10","rating":4}],"destLat":50.993,"destLon":17.0096},{"id":753,"lat":51.4931,"lon":22.0666,"rating":4,"reviews":1,"wait":65,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Raz jechałem w kierunku warszawy z tego miejsca, od razu za rondem w kierunku drogi ekspresowej jest ułożona szeroka kostka, gdzie bez problemu może się samochód zatrzymać jadący w kierunku warszawy. Jak tam stałem to był piątek po godzinie 18 gdzie wszyscy wracali z warszawy, a nie jechali do niej.","date":"2023-01-03","rating":4}],"destLat":51.4931,"destLon":22.0666},{"id":755,"lat":50.7153,"lon":23.2868,"rating":4,"reviews":1,"wait":5,"signal":null,"lastUsed":"2022-12-04","comments":[{"text":"Hitchhiked by night in winter time. Good street lights, few cars but slow driving a space to pull over on the exit ramp. Truck took me in 5 minutes. Might be worth walking to the next traffic light 3km further at the exit of zamosc.","date":"2022-12-04","rating":4}],"destLat":50.467,"destLon":23.4304},{"id":756,"lat":52.8231,"lon":15.8278,"rating":4,"reviews":1,"wait":30,"signal":null,"lastUsed":"2022-11-29","comments":[{"text":"to Poznań","date":"2022-11-29","rating":4}],"destLat":52.3622,"destLon":16.9368},{"id":298,"lat":52.1554,"lon":20.6889,"rating":3.86,"reviews":7,"wait":34,"signal":"sign","lastUsed":"2025-07-17","comments":[{"text":"Probably possible to get further but since there is so little traffic and cars go all the different directions after Warsaw, then when a fifth car stopped and offered a ride to Warsaw centre, we took it. From there we took a hour on the bus to the popular place in Warsaw to go to west and got onto the second car easily. Definitely better to go to Warsaw centre with a ride rather than stop here.","date":"2025-07-17","rating":2},{"text":"Good spot to get to Warsaw and probably behind it but the traffic isn't too intense soo you might have to wait a little bit longer if you are not lucky","date":"2025-06-05","rating":5},{"text":"Not much traffic. Was going to Riga,got a direct ride to Vilnius (didnt finish the beer until the ride)","date":"2025-04-15","rating":4},{"text":"I just had to ask few truck drivers with the right license plates and in less than five minutes I found one going to Białystok. (He told me that in peak hours the trucks can't use the S8, not sure about exact times, but can be found on the internet for sure, so be aware of that), no cars stopping at the servo when I was there (around noon)","date":"2016-08-23","rating":4},{"text":"Of course it is possible. Be patient and wait for the right license plate (Polish region or next country).","date":"2015-08-25","rating":4}],"destLat":52.2337,"destLon":21.0152},{"id":44,"lat":50.0133,"lon":19.9277,"rating":3.8,"reviews":5,"wait":23,"signal":null,"lastUsed":"2025-11-06","comments":[{"text":"I waited 30min with a SK sign then a Nowy Targ sign. I had no luck and moved towards the highway intersection south of this place and got picked up in 15min towards Myslenice which unfortunately didn't help me a lot.","date":"2025-11-06","rating":2},{"text":"Got a ride to Rabka after 15 minutes on a Sunday morning with low traffic","date":"2023-11-12","rating":5},{"text":"I got a lift to Slovakia in 5mins on the national holiday lots of traffic just ask 3 drivers and i had a lift.","date":"2014-11-09","rating":4},{"text":"IF you are going to direction of Slovakia or Novy targ. Go at least to crossroads near Rabka zdroj because there are not many good places between.","date":"2011-03-02","rating":4},{"text":"Gas station. in direction of Slovakia.","date":"2011-03-02","rating":4}],"destLat":49.8338,"destLon":19.9403},{"id":285,"lat":54.4341,"lon":18.487,"rating":3.8,"reviews":5,"wait":63,"signal":"ask","lastUsed":"2025-07-23","comments":[{"text":"the first driver I asked took my friend to Łódź","date":"2025-07-23","rating":5},{"text":"Hi, I traveled from Gdańsk to Katowice in 8 hours","date":"2025-07-23","rating":5},{"text":"Can't stop traffic on the road, as it is too fast, had a very hard time finding a ride on the bus station","date":"2024-07-06","rating":1},{"text":"We waited (boy & girl) 1 hour and 10 minutes, after that we go through  after crossroad. and after 15min car pick up us","date":"2016-08-15","rating":4},{"text":"Petrol station on the bypass, direction Torun, Lodz, Poznan. You can get close to this spot by free bus 807 from Gdansk Zabianka, or bus 7 from Gdynia Karwiny going to Osowa Shopping Centre.","date":null,"rating":4}],"destLat":null,"destLon":null},{"id":123,"lat":52.2163,"lon":20.8627,"rating":3.75,"reviews":20,"wait":76,"signal":"thumb","lastUsed":"2025-09-09","comments":[{"text":"I first waited about 30 minutes at a nearby bus stop without success, then another 30 minutes at the highway ramp before getting a ride. Works, but not the best place. Solo M","date":"2025-09-09","rating":3},{"text":"Solo, m\r\nMonday morning\r\nWaited 20 minutes, bit of an awkward spot to stop. 50% of traffic is trucks (and they definitely can't stop).\r\nFine spot, but not sure if it was worth the 1.5h public transport and 0.5h walk to get there","date":"2025-08-18","rating":4},{"text":"But still best spot in the area, better than before the bridge. I reccomend sign Lodz. Ppl in capital are just not very nice i think, avoid Warszaw when hitchiking if you can.","date":"2023-09-16","rating":1},{"text":"Not a great spot since cars don't have room to pull over, but I eventually got a ride close to my destination of Łódź.","date":"2023-07-13","rating":3},{"text":"Stoplight leading to onramp to highway. No place to pull over, but if you can talk to cars stopped at stoplight you can jump in quickly  before light turns green. \r\nWe convinced a car quickly. At first they said no, but since they had to stop at the light, we talked with them through the window and asked to get a ride at least to a gas station, and got a 40km ride towards west","date":"2023-05-28","rating":4}],"destLat":51.6749,"destLon":19.4767},{"id":247,"lat":53.8344,"lon":22.3944,"rating":3.75,"reviews":4,"wait":24,"signal":"thumb","lastUsed":"2025-08-08","comments":[{"text":"We were two people (male and felmale). Standing there for quite a long time. It is a road from a town so many people yust go from town to different parts of town. We had a sign Litwa. We’ve got a ride to Suwałki.","date":"2025-07-26","rating":3},{"text":"In the evening (9 pm), no bueno. waited over 40 minutes then gave up due to all local traffic. During the day, a great spot! 10 minutes and we were headed to Augstow :)","date":"2014-06-25","rating":4},{"text":"Bus stop\nDirection: Augustów","date":"2013-10-20","rating":4}],"destLat":54.084,"destLon":22.9387},{"id":248,"lat":52.6207,"lon":21.5017,"rating":3.75,"reviews":4,"wait":25,"signal":"thumb","lastUsed":"2025-08-08","comments":[{"text":"Lots of cars, but they don't always have where to stop.","date":"2025-08-08","rating":4},{"text":"Not a lot of space, but most of the cars go in your direction. Got a ride to Białystok in 10 minutes.","date":"2023-08-24","rating":5},{"text":"To Bialystok, no place to stop without bothering others, but the traffic is very quiet in the morning.","date":"2014-06-05","rating":3}],"destLat":53.8347,"destLon":22.3953},{"id":284,"lat":54.3488,"lon":18.6845,"rating":3.75,"reviews":4,"wait":54,"signal":"sign","lastUsed":"2025-07-24","comments":[{"text":"We had a good time there. It was not a dangerous place. We stood in the end of bus station. We had a sign Olsztyn and there were two of us (male and female). Buses are not a problem there. We recommend this place even though we spent a lot of time in one place.","date":"2025-07-24","rating":4},{"text":"Try with the sign warszawa and it didn't work. With the sign Elblag, I had to wait 15 mn. It was on Wednesday afternoon","date":"2024-10-27","rating":3},{"text":"tried in the evening when it was dark without success and gave up after 1h30 of trying, got a ride into warsaw within 15min of getting there the next morning (weekday at 6am). had a sign for Elbląg and was told by the lorry driver that was very good (extra points for the diacritic on the a)","date":"2024-08-20","rating":4}],"destLat":53.7734,"destLon":20.4445},{"id":316,"lat":51.1698,"lon":15.0303,"rating":3.75,"reviews":4,"wait":13,"signal":"thumb","lastUsed":"2025-07-01","comments":[{"text":"Had no luck on the shoulder leading up the exit. Came here, absolutely horrendous spot, but Polish people really don't care. Got a ride to Boleslawiec. Was a summer evening so traffic was low, which might have actually helped.\r\n\r\nI recommend asking around before coming here though.","date":"2025-07-01","rating":2},{"text":"Waited on the \"island\" between the entry and exit lanes with a sign for Wrocław and literally the second car that was passing by stopped and brought me to directly to Aleja Bielany. Definitely recommend although might not be exactly legal.","date":"2025-06-04","rating":5},{"text":"On-ramp Zgorzelec direction Wrocław on the A4. Not really much place for cars to stop but since it's Poland they do anyway. Any ride is good because there's a petrol station 5km down the road.","date":"2013-12-21","rating":4}],"destLat":51.3105,"destLon":15.5708},{"id":391,"lat":51.1609,"lon":17.0277,"rating":3.75,"reviews":4,"wait":35,"signal":"sign","lastUsed":"2025-05-07","comments":[{"text":"A lot of traffic here. \r\nIn my opinion better spot than on the highway ramp. Cars have to stop for the red light. Also the driver can turn into the paraller road next to the stores to safely get on.","date":"2025-05-07","rating":5},{"text":"Kierowcy zatrzymywali się na światłach, i nke chcieli stąd zabierać. To ostatni punkt przed wjazdem na S5. Poszliśmy za rondo.","date":"2024-04-19","rating":2},{"text":"In my opinion better than the spot further, because the cars go slower because of the traffic lights.","date":"2023-08-24","rating":4},{"text":"Not a bad spot to get out of the city. Got a ride to a nearby gas station towards Poznan","date":"2023-04-10","rating":4}],"destLat":54.351,"destLon":18.6534},{"id":493,"lat":51.1899,"lon":15.1128,"rating":3.75,"reviews":4,"wait":27,"signal":null,"lastUsed":"2024-10-17","comments":[{"text":"A truck driver saved me. Was so hard. They all ignored me","date":"2024-10-17","rating":2},{"text":"Good spot. Also a lot of long-distance-drivers passing here.","date":"2023-01-25","rating":5},{"text":"MOP Żarska Wieś, A4 direction Wrocław. A bridge just south of the service station gives you a possibility to change to the other side (direction Germany).","date":"2012-11-21","rating":4}],"destLat":51.1707,"destLon":17.0272},{"id":629,"lat":49.9827,"lon":19.9117,"rating":3.75,"reviews":4,"wait":8,"signal":null,"lastUsed":"2023-10-12","comments":[{"text":"My feelings about this spot are mixed. Once I had to go a bit from here by bus as noone stopped for me for an hour. \r\nBut another time I've got an easy ride to Nowy Targ","date":"2023-10-12","rating":3},{"text":"We were waiting for the car almost 40 minutes, but then we got the ride almost directly to the Budapest.","date":"2013-05-05","rating":4},{"text":"its quite difficult to get lift from here, traffic lights are placed at the top of the hill. I was standing there for 1,5h and no one even stoped","date":"2012-09-12","rating":4},{"text":"There is a bus stop 'Ważewskiego' here, where you have enough of place to try hitchhiking. If without a luck, you can always go to the gas station nearby and ask the drivers. Directions: Chyżne, Banská Bystrica, Budapest.","date":"2011-09-12","rating":4}],"destLat":49.4798,"destLon":20.022},{"id":634,"lat":52.2449,"lon":20.8963,"rating":3.75,"reviews":4,"wait":9,"signal":null,"lastUsed":"2023-10-08","comments":[{"text":"There is a stop sign and parking is prohibited, although the place is good for hitchhiking. \r\n2023","date":"2023-10-08","rating":3},{"text":"Wanted to go on the 580 towards Sochaczew, but first car that stopped for us went to Katowice. Confirmation that it's a good spot :)","date":"2014-01-01","rating":4},{"text":"There is a safe place to stay on a bus stop. Anyways, most traffic goes to downtown and suburbs of Warsaw, but we were able to catch a good ride towards A2 after 15 minutes.","date":"2012-10-19","rating":4},{"text":"S8 towards road nr. 2. In the future this will be one of the good places to get a ride, once the A2 is completely finished. Right now the S8 merges with the normal road nr. 2. On-ramp with a bus stop, so more than enough place for cars to stop, and they'll also be going slow just after the traffic lights.","date":"2011-12-14","rating":4}],"destLat":52.2449,"destLon":20.8963},{"id":81,"lat":50.245,"lon":19.0372,"rating":3.73,"reviews":15,"wait":44,"signal":"sign","lastUsed":"2025-10-12","comments":[{"text":"I don't know why, but for a very long time people didn't want to stop - we headed towards Rybnik -> Ostrava","date":"2025-09-07","rating":2},{"text":"We waited 20 mins, we got a lift to Zory.","date":"2023-07-27","rating":5},{"text":"JACKPOT! \nThe first driver we approached on a Sunday morning (8am) took us to Wroclaw.","date":"2016-11-27","rating":4},{"text":"I was picked up there on my way from Krakow to Dresden, and even if tehre's a lot of cars (passengers mostly), lots of local traffic (because of McDonalds) I waited for an hour for anybody who could take me to the next, much bigger, gas station along A4. I was alone, at start with a sign with my destination, but quickly i started to ask personally. Probably the problem was that I was there on saturday during one a long weekends (with added national holiday) on Monday, and most cars were totally ","date":"2016-08-16","rating":4},{"text":"Many locals on the way, was really hard to pick a ride towards Wrocław. After an hour a guy took us to MOP Wirek, where you can find drivers heading to west.","date":"2015-08-20","rating":3}],"destLat":50.2589,"destLon":18.6739},{"id":257,"lat":54.1303,"lon":22.9506,"rating":3.7,"reviews":10,"wait":62,"signal":"sign","lastUsed":"2025-08-05","comments":[{"text":"mostly local traffic. many lithuania cars but almost none stop. I declined 2 rides to marijampole in the hopes of getting a ride further but it was a mistake and i got stuck for 2 hours. its not a bad spot but i think i was just very unlucky. in the afternoon many lithuanians go back from shopping so in the end i got a ride to Kaunas.","date":"2025-08-05","rating":3},{"text":"Two guys with backpacks, signaling with a sign LT.\r\nMost of drivers were local, but we got a ride to northern Lithuania in less than hour.","date":"2025-07-19","rating":5},{"text":"Really nice place in my opinion. Put LT on my sign and two cars stopped within 10 minutes on a friday at 12pm.","date":"2025-07-18","rating":5},{"text":"Many cars ignore you. After 15 minutes we find transport beside to border","date":"2025-06-25","rating":4},{"text":"Nice spot to get a ride to LT. A few trucks, but mostly you will see a cars. It's not hard to see a lituanian car plates, but they mostly ignore you. Consider to stand here between 14.00 and 18.00, when people comes back form work or form shopping","date":"2024-08-06","rating":4}],"destLat":54.8962,"destLon":23.9052},{"id":259,"lat":50.0983,"lon":19.9625,"rating":3.67,"reviews":9,"wait":68,"signal":null,"lastUsed":"2025-08-04","comments":[{"text":"I've been standing at the next bus station after this one. I used a sign \"WWA\" After about 1.5 hour I've got a ride directly to Warsaw with a super nice guy.","date":"2025-08-04","rating":3},{"text":"With a ''Warsowa'' sign i waited 40mins, as always it's terrible with a sign, so i gave it up and in few minutes i was taken to a rest area on the main road","date":"2025-07-13","rating":4},{"text":"all these spots along this road are good theoretically so i cannot wrap my head around why it took me more than 4 hours (!) to get someone to stop and take me to warsaw. never had a experience this bad anywhere else in poland","date":"2024-07-08","rating":2},{"text":"Got a ride directly to Warsaw in a couple boy-girl with a sign WWA. Waited 20 min. Good spot - traffic lights and enough space to stop :)","date":"2016-07-05","rating":4},{"text":"not WWA! people :P\nwrite like that:\n Warszawa or \nWAWA or\nW-WA (better than WWA)","date":"2015-01-27","rating":4}],"destLat":52.1629,"destLon":21.0182},{"id":223,"lat":53.8291,"lon":22.9539,"rating":3.67,"reviews":6,"wait":65,"signal":"thumb","lastUsed":"2025-08-12","comments":[{"text":"worst spot ever, nobody stopped in 3 hours","date":"2025-08-12","rating":1},{"text":"Unforgettable","date":"2023-08-23","rating":5},{"text":"good, car to Lomža after 30minutes, there is not any better space in this direction","date":"2016-07-16","rating":4},{"text":"At 8 PM I wait for 1 hour for car to Warsaw.","date":"2014-08-11","rating":4},{"text":"Going to Warsaw got a ride in 10 minutes. Stood right before the bus stop. There are shade and no-shade options :)","date":"2014-06-25","rating":4}],"destLat":53.8291,"destLon":22.9539},{"id":543,"lat":51.1647,"lon":17.0281,"rating":3.67,"reviews":6,"wait":90,"signal":"sign","lastUsed":"2024-08-06","comments":[{"text":"I was trying to catch a car at 15:00 and I spent 5 hours trying to get a ride towards Warsaw. Drivers generally ignore you and are not willing to stop.","date":"2024-08-06","rating":3},{"text":"Perfect spot for Łodž/Warsaw. Easy to get there by bus, cars slow down before the roundabout and have enough space to stop. Two cars stopped under 20 minutes and the second took us all the way to Warsaw.","date":"2024-07-19","rating":5},{"text":"Miejscowi kierowcy zatrzymywali, że by powiedzieć że na Poznań lepiej stanąć przed rondem koło przystanku autobusowego wcześniej.\r\n\r\nOstatecznie zrezygnowaliśmy z tego miejsca","date":"2024-04-19","rating":1},{"text":"We (2 people) got a ride here after only 20 minutes on a weekday, and they drove us straight to Warsaw (about 4h). Lovely and very freindly businessman on a work trip, we held a conversation with him the whole trip.","date":"2023-03-25","rating":5},{"text":"If you wanna go toward the Warsow this place seems to be very good. You can get there by #908 bus or #1 or #7 (in this cases you have to walk about 20 minutes north). Cars slow down before the roundabout and they can stop on buses' lay-by.","date":"2015-03-31","rating":4}],"destLat":52.2379,"destLon":21.0443},{"id":43,"lat":50.2745,"lon":23.5882,"rating":3.67,"reviews":3,"wait":8,"signal":null,"lastUsed":"2025-11-18","comments":[{"text":"Yes how ukrainian i know, so i can say you that on this punkt of crossing, you cant do it on your foot, because its place only for cars and buses, autobuses, only place on Pl-UA border, where you can get to Ukrainian, (or polish) side by foot, it is near to the polish city Prsemsyl, Medyka-Shegyinni, its only place where you can do it by foot, on others, the policmens just will dont let you go , and will stop you, of course you can try to ask this cars who are waiting in the line, to cross a bor","date":"2025-11-18","rating":3},{"text":"You can not get to this place because it is located between the Polish and Ukrainian border, and it is not walking border","date":"2014-09-20","rating":4},{"text":"For border crossing","date":"2011-09-04","rating":4}],"destLat":null,"destLon":null},{"id":118,"lat":54.211,"lon":16.1496,"rating":3.67,"reviews":3,"wait":28,"signal":"sign","lastUsed":"2025-09-09","comments":[{"text":"If you are hitchhiking in the Gdansk direction. There is enough space for one car to stop and simultaneously one car passing. Pretty good one!","date":"2025-09-09","rating":4},{"text":"It's pretty good because the cars need to slow down because of the roundabout","date":"2025-09-09","rating":3}],"destLat":54.3072,"destLon":16.5131},{"id":253,"lat":52.7768,"lon":21.8645,"rating":3.67,"reviews":3,"wait":60,"signal":null,"lastUsed":"2025-08-06","comments":[{"text":"fast traffic so it's hard to stop something","date":"2025-08-06","rating":3},{"text":"Quite ok spot just before the S8. Traffic is a bit fast, but there's a nice hard shoulder to stop.","date":"2014-10-23","rating":4}],"destLat":53.8283,"destLon":22.3603},{"id":291,"lat":52.2952,"lon":17.6525,"rating":3.67,"reviews":3,"wait":30,"signal":"sign","lastUsed":"2025-07-22","comments":[{"text":"Pretty empty but still doable. I guess it would be easier for a single person due to many trucks but we got ride in the end too.","date":"2025-07-22","rating":3},{"text":"very little traffic coming through but slow traffic and very possible to hike west","date":"2025-07-08","rating":4},{"text":"Not too many people but spot seems ok, got a ride to Berlin with a sweet Kazach guy, had a lot of fun trying to get to know what Kazachstan is like trying to communicate in a mix of poor polish english and russian","date":"2025-05-10","rating":4}],"destLat":52.3139,"destLon":15.7818},{"id":299,"lat":52.3279,"lon":17.0924,"rating":3.67,"reviews":3,"wait":27,"signal":"ask-sign","lastUsed":"2025-07-17","comments":[{"text":"The traffic isn't too great and there are no ideal spots for cars to stop but if you get there early enough in the morning then there is enough traffic to get a ride easily.","date":"2025-07-17","rating":4},{"text":"we asked around for a long while, people travelling long distances north and east but not worth the 1,5h commute from poznan","date":"2025-06-09","rating":3},{"text":"Most of the cars going to Bydgoszcz but you can find someone going east eventually. Nice spot to hang around in front of the gas station and talk to drivers, people are friendly. Got a ride to Warsaw with a person from Berlin going to Lithuania with their van.","date":"2025-05-24","rating":4}],"destLat":52.2323,"destLon":20.9718},{"id":381,"lat":52.4463,"lon":20.6095,"rating":3.67,"reviews":3,"wait":10,"signal":null,"lastUsed":"2025-06-11","comments":[{"text":"Please note that this location no longer exists, as the oil station was demolished during the renovation of Route 7.","date":"2025-06-11","rating":1},{"text":"Great stop on the way North. There is a big petrol station here(Statoil). Nearly no local traffic. Very easy to get long distance ride towards Olsztyn, Gdansk, Torun or Bydgoszcz.\n\nIt's the first petrol station after crossin Vistula river, so easy to get here. And easy to leave:-)","date":"2015-04-01","rating":5}],"destLat":null,"destLon":null},{"id":383,"lat":52.3783,"lon":16.5671,"rating":3.67,"reviews":3,"wait":63,"signal":"sign","lastUsed":"2025-06-09","comments":[{"text":"in the middle of nowhere, almost nobody drives here, we waited for 2+ hours and had to catch a ride back to poznan (summer 2024)","date":"2025-06-09","rating":1},{"text":"Not a lot of traffic and workers will probably sent you away if you try to hitch behind the toll station. After the roundabout is okay though. Might be good to have a sign to indicate your direction.","date":"2013-04-03","rating":5}],"destLat":null,"destLon":null},{"id":457,"lat":50.8048,"lon":20.4849,"rating":3.67,"reviews":3,"wait":null,"signal":null,"lastUsed":"2025-01-31","comments":[{"text":"Towards south, pretty okay location, but your better bet is for the cars coming from the junction, note: when walking here, go by the road 763, the area has high fence and nasty vegetation if you go next to the highway. waited 40 minutes","date":"2025-01-31","rating":3},{"text":"Good spot to hitchhike to the Katowice. We stayed only 15minutes.","date":"2016-01-05","rating":4}],"destLat":null,"destLon":null},{"id":550,"lat":53.0321,"lon":18.7065,"rating":3.67,"reviews":3,"wait":43,"signal":"thumb","lastUsed":"2024-07-28","comments":[{"text":"Good place for going to Warsaw or to get to highway (direction North-Gdańsk; South-Stryków). \nVery comfortable place to stop for cars (bus stop with bus bay).\nIt's the bus stop \"Słupska\" - you could get there from the city center by bus 35. This bus stop is on request (flag stop).","date":"2015-12-28","rating":3}],"destLat":54.3499,"destLon":18.5223},{"id":598,"lat":51.0442,"lon":16.9527,"rating":3.67,"reviews":3,"wait":41,"signal":"sign","lastUsed":"2024-04-24","comments":[{"text":"Seems like it's only good for Sobotka. Waited 35 minutes with a sign right after the traffic lights","date":"2024-04-24","rating":3},{"text":"Great spot. Bus stop after the traffic lights. Nom nom.","date":"2014-09-16","rating":4},{"text":"Good spot if you just want to go to Sobótka (Ślęża).","date":"2012-09-24","rating":4}],"destLat":50.9015,"destLon":16.7421},{"id":646,"lat":50.2515,"lon":19.0052,"rating":3.67,"reviews":3,"wait":13,"signal":null,"lastUsed":"2023-09-13","comments":[{"text":"Good spot to get to A4","date":"2023-09-13","rating":4},{"text":"The guy who picked us with his old alfa romeo told us, that it's one of the worst stops we could choose to hitchhike cause it's almost in the city centre....but he took us to Moll petrol station near Żary. I rate this pickup spot 3 stars out of 5.","date":"2023-08-11","rating":3},{"text":"It's a bus stop, so there were a lot of city buses, but our car stopped after few minutes.","date":"2023-07-21","rating":4}],"destLat":50.2509,"destLon":19.004},{"id":672,"lat":53.1505,"lon":18.0289,"rating":3.67,"reviews":3,"wait":30,"signal":null,"lastUsed":"2023-08-09","comments":[{"text":"We dont get a ride here. Go with any bus from here another two stationes and u will find better spot if you wanna go to gdaňsk.","date":"2023-08-09","rating":3},{"text":"very good place with big traffic","date":"2014-07-22","rating":4},{"text":"bus stop (line 52 with the letter 'P' or 'M', you can take a tram (the stop in Las Gdansk, tram number 1 or 2), a good place to hitchhike to Gdansk or at least to Osielsko","date":"2013-10-16","rating":4}],"destLat":53.1497,"destLon":18.0287},{"id":675,"lat":52.5435,"lon":17.6031,"rating":3.67,"reviews":3,"wait":120,"signal":null,"lastUsed":"2023-08-08","comments":[{"text":"Not a good spot. After two hours we can go to toruń but no bydgoszcz rides.","date":"2023-08-08","rating":3},{"text":"Good place for the direction towards Bydgoszcz, Torun or Gdansk. Waited 20 min with Gdansk sign at the common exit of petrol station and McDonalds.","date":"2015-08-22","rating":4}],"destLat":52.5437,"destLon":17.6034},{"id":705,"lat":52.3879,"lon":16.475,"rating":3.67,"reviews":3,"wait":120,"signal":null,"lastUsed":"2023-07-05","comments":[{"text":"Tried this spot twice to berlin, most cars are local,takes long to get a ride","date":"2023-07-05","rating":3},{"text":"MOP Sędzinko, petrol station along the A2 towards Berlin.","date":"2012-02-02","rating":4}],"destLat":52.3882,"destLon":16.4753},{"id":722,"lat":50.2355,"lon":19.054,"rating":3.67,"reviews":3,"wait":60,"signal":null,"lastUsed":"2023-05-02","comments":[{"text":"It's a dangerous place (cars are really fast and buses are coming to the bus stop), so you have to be careful. Visibility is not good - you have to stand very close to the road, on the edge of bus stop. One person stood before the bridge (pedestrian passage) and the other on the bus stop, after one hour somebody took us only to Pszczyna. Pros: there is a place for a car to stop.","date":"2023-05-02","rating":3},{"text":"Good bus stop, to south of PL (like Bielsko-Biala) or to the border (Cieszyn).","date":"2015-03-19","rating":4}],"destLat":49.977,"destLon":18.9586},{"id":746,"lat":52.9708,"lon":18.679,"rating":3.67,"reviews":3,"wait":1,"signal":null,"lastUsed":"2023-03-18","comments":[{"text":"Just stood here for 30 secs and instantly caught a ride. A lot of space to stop here.","date":"2023-03-18","rating":5},{"text":"I got there with the bus 35 and stopped at Odlegla II. The stop before (Slupska) may be better because at this point cars are driving already a bit fast but they have room to stop. I got picked towards the north after a long wait by a truck driver.","date":"2015-03-13","rating":3}],"destLat":52.2569,"destLon":19.1648},{"id":751,"lat":51.4273,"lon":21.1489,"rating":3.67,"reviews":3,"wait":41,"signal":null,"lastUsed":"2023-01-03","comments":[{"text":"Direction: Kraków/Cracow\r\nThis might have been a good place a few years ago because there is a lot of space. Nowadays, when everybody ride expressway this place isn't good. If somebody ride this way it's probably going to Radom from Warsaw and stay here. I recomend ride a bus number 5 to \"Młodocin Mniejszy I\" and there is a nice place to catch a car to Kraków/Cracow","date":"2023-01-03","rating":1},{"text":"Dobre miejsce na Kraków (Kielce, Radom, Skarżysko)","date":"2015-03-23","rating":5},{"text":"It's a good place to reach Krakow. Many cars from Warsaw use this way I think. Cars are not so fast and there is a place to stop. 5-10 minutes waiting.","date":null,"rating":5}],"destLat":51.4273,"destLon":21.1489},{"id":147,"lat":49.6439,"lon":19.9141,"rating":3.63,"reviews":8,"wait":27,"signal":null,"lastUsed":"2025-09-01","comments":[{"text":"We got off here by accident. Our destination was Budapest. There was very little traffic, so after 40 minutes we decided to take the bus to Rabka Zabojnia.","date":"2025-09-01","rating":1},{"text":"2 boys, Sunday morning\n\nWaited around 20 minutes with sign \"SK\" to Slovakia. Got ride to spot 4 km away in south direction.","date":"2015-12-08","rating":4},{"text":"2 boys to Jabłonka. ~10min. Our goal was Hungary.","date":"2015-07-03","rating":4},{"text":"2 boys to zakopane around 20 min","date":"2014-07-10","rating":4},{"text":"my girlfriend and i wait about 10 min.  to slovakia kosice. nice point","date":"2014-06-28","rating":4}],"destLat":null,"destLon":null},{"id":89,"lat":53.8334,"lon":22.3283,"rating":3.57,"reviews":7,"wait":48,"signal":"sign","lastUsed":"2025-10-02","comments":[{"text":"There is a bus stop at the exit from ELK, across the street it's a fuel station. This bus stop is a good place to stop cars, there is enough space for cars to stop. I was waiting 5 minutes with the sign: \"GYZYCKO\" and after one driver stopped and we went well. He was kind and he brought me to the address of my host from workaway.info","date":"2025-10-02","rating":5},{"text":"A good spot to go to Orzysz/Olsztyn. We stood there for about 20 minutes and got a ride to Olsztyn","date":"2025-05-04","rating":4},{"text":"Not the best one, but we were waiting around 1hour and find a ride directly do Gdańsk","date":"2024-05-26","rating":3},{"text":"a driver picked me up before I even started hitchiking. Good place to go to Orzysz","date":"2023-09-04","rating":4},{"text":"Terrible spot, not many traffic in this petrol station and very long time to have a ride.. mostly people from Elk just take fuel and that's it","date":"2019-06-23","rating":3}],"destLat":54.0436,"destLon":21.7732},{"id":67,"lat":53.1494,"lon":23.0556,"rating":3.5,"reviews":6,"wait":28,"signal":null,"lastUsed":"2025-10-15","comments":[{"text":"Not possible anymore and quite dangerous","date":"2025-10-15","rating":1},{"text":"Never waited more than 20 minutes","date":"2016-04-17","rating":4},{"text":"I've used this spot (even before the modernization) for the last 10 years whenever I've been going west. Thumbs up !","date":"2014-09-14","rating":4},{"text":"Never stayed more than 15 min for Warsaw's ride's.","date":"2014-05-16","rating":4},{"text":"once I've got ride in 10 minutes, the second time I didn't get it at all.","date":"2011-12-14","rating":4}],"destLat":null,"destLon":null},{"id":20,"lat":54.1283,"lon":17.9963,"rating":3.5,"reviews":2,"wait":25,"signal":"sign","lastUsed":"2026-01-16","comments":[{"text":"I was standing closer to Moya gas station. good place for Gdansk.","date":"2026-01-16","rating":4},{"text":"It's a good spot to hitchhike in direction to Gdansk. There are two patrol stations next to each other, but the best is catching where bus stop (there's a place to stop, not like in gas stations).","date":"2014-04-07","rating":3}],"destLat":54.3093,"destLon":18.5615},{"id":137,"lat":50.7918,"lon":16.0406,"rating":3.5,"reviews":2,"wait":65,"signal":"sign","lastUsed":"2025-09-03","comments":[{"text":"plenty of cars and space, but still waited a long time. maybe we had a misleading sign. intheend got a ride to jawor.","date":"2025-09-03","rating":2},{"text":"There is a bus stop with plenty space to stop.","date":"2025-08-28","rating":5}],"destLat":51.0274,"destLon":16.1828},{"id":158,"lat":51.0194,"lon":16.754,"rating":3.5,"reviews":2,"wait":30,"signal":"ask","lastUsed":"2025-08-31","comments":[{"text":"During the night not so many cars/trucks, but still enough to catch a Ukrainian truck and sleep in his bed while he drove me to Krakow, where I wanted to stop. Others I asked were heading just to Wroclaw direction.","date":"2025-08-31","rating":4},{"text":"good to Wroclaw\nnot so good for Dresden. \nfirst car direction Dresden took us, but long time we just found cars to Wroclaw","date":"2014-05-01","rating":3}],"destLat":50.079,"destLon":19.7593},{"id":260,"lat":52.1495,"lon":21.0604,"rating":3.5,"reviews":2,"wait":65,"signal":null,"lastUsed":"2025-08-04","comments":[{"text":"I started at 4pm Monday evening with a sign for Lublin. Nobody stopped in more than 2 hours, so I decided to take a train to my destination.","date":"2025-08-04","rating":2},{"text":"Another good place towards Lublin. There is a bus stop there so very easy to stop the car for a moment.","date":"2023-07-31","rating":5}],"destLat":52.1495,"destLon":21.0604},{"id":470,"lat":51.1092,"lon":16.9374,"rating":3.5,"reviews":2,"wait":40,"signal":null,"lastUsed":"2024-12-17","comments":[{"text":"Its ok but could be better","date":"2024-12-17","rating":4},{"text":"Good place to ask for a ride, it connects to lot of highways, specially if you are hitchhiking for a place inside Poland. \n It has place for the cars to stop. \nYou can take the city bus 106 and stop at \"Park Tysiaclecia\"","date":"2017-07-15","rating":3}],"destLat":51.1606,"destLon":15.0286},{"id":591,"lat":50.0769,"lon":18.6641,"rating":3.5,"reviews":2,"wait":35,"signal":"sign","lastUsed":"2024-04-30","comments":[{"text":"Last gas station before Gliwice, great amenities (showers, laundromat) Not many people stopping but for us easy to get a lift to Lodz.","date":"2024-04-30","rating":4},{"text":"Best spot when u are hitchiking alone as there are so many truck drivers, but cars ride more to Katowice or Wroclaw. I recommend you to stay nearby gas station no at the end of parking.","date":"2023-07-29","rating":3}],"destLat":51.7568,"destLon":19.4843},{"id":612,"lat":50.1972,"lon":18.7024,"rating":3.5,"reviews":2,"wait":53,"signal":"ask","lastUsed":"2024-03-25","comments":[{"text":"low traffic, but asking every driver coming in","date":"2024-03-25","rating":5},{"text":"Truck drivers weren't stopping.","date":"2023-08-21","rating":2}],"destLat":50.5751,"destLon":19.0515},{"id":695,"lat":50.3656,"lon":18.9366,"rating":3.5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2023-07-21","comments":[{"text":"Not good not terible, but we were dropped on the roundabout, so we didn't have another option. We had a ride to czestochowe. It's not the best for cars, but if they want to pick you up, they will.","date":"2023-07-21","rating":3}],"destLat":50.3653,"destLon":18.9369},{"id":410,"lat":52.1386,"lon":20.9007,"rating":3.4,"reviews":10,"wait":89,"signal":null,"lastUsed":"2025-04-27","comments":[{"text":"mega nie polecam nikt sie nie zatrzymuje, ponad godzina czekania i dupa","date":"2025-04-27","rating":1},{"text":"Duży ruch i dobre miejsce do zatrzymania się.","date":"2023-08-04","rating":4},{"text":"Waited on the bus stop. Nobody even stopped","date":"2023-04-18","rating":1},{"text":"Used to be a great spot - not anymore. There is a new way to Wroclaw. This s not a good spot to Radom also, cars are driving too fast - get the bus to Łazy, there is a gas station","date":"2016-05-30","rating":4},{"text":"Road under construction, as stated above. Waited 2h for someone to give us a lift to Krakow, no luck :(","date":"2015-11-26","rating":4}],"destLat":51.9813,"destLon":20.5183},{"id":697,"lat":52.1761,"lon":20.9431,"rating":3.4,"reviews":5,"wait":90,"signal":null,"lastUsed":"2023-07-17","comments":[{"text":"Waited 2 and a half hours by the bus stop, no one stopped, gave up.","date":"2023-07-17","rating":1},{"text":"Seems like a very good spot in the bus station, but waited for 2h and a half for a ride to Krakow, and finally quit.","date":"2014-09-03","rating":4},{"text":"We waited there for 1.30h so it was a not a lucky point for us. But it might be a good point in other days, not for a long-weekend-hitchhike. Quite good visibility.","date":"2013-05-02","rating":4},{"text":"Lots of traffic though I think it's mostly local and there are 3 lanes which means it's harder them to stop but it's a good place if You're going to the Katowice or Kraków direction :)","date":"2013-04-20","rating":4},{"text":"This is a very popular spot to hike out of Warsaw - lots of local traffic, but it's also not very hard to get a ride to Krakow or Katowice. Hike straightly from the bus stop - lots of people are travelling from that point so you have to be prepared that sometimes there is a crowd of hitchhikers here. This is also the place where a bus to Janki stops - there is actually a better spot for hiking. Keep in mind that drivers taking you to Radom usually expect some money from you, so make this clear b","date":"2011-06-15","rating":4}],"destLat":52.1761,"destLon":20.9431},{"id":282,"lat":52.3297,"lon":16.8018,"rating":3.33,"reviews":3,"wait":20,"signal":null,"lastUsed":"2025-07-28","comments":[{"text":"Showed sign for 5 seconds, two guys and two girls, can stopped instantly. Nice spot right behind traffic lights with bus stop, so cars can stop.","date":"2025-07-28","rating":5},{"text":"Only rides to Stęszew which is terrible spot to catch something. Jebać Stęszew. Not recommended.","date":"2024-09-18","rating":1},{"text":"Bus stop, use it to arrive to Stęszew, Grodzisk Wlkp and Zielona Góra","date":"2024-05-13","rating":4}],"destLat":51.8267,"destLon":16.5},{"id":287,"lat":50.0834,"lon":19.7932,"rating":3.33,"reviews":3,"wait":28,"signal":null,"lastUsed":"2025-07-23","comments":[{"text":"cars go in high speed, fellow hitchhikers we met when we got to this spot said that it took them 2 hours and nothing, they went trying luck more near to the airport. i suggest you to try just before the troll station, cars go slowly there because of the queue","date":"2025-07-23","rating":2},{"text":"Might be good to get cars East/to Krakow. Toll station.","date":"2015-05-06","rating":4}],"destLat":null,"destLon":null},{"id":305,"lat":49.4901,"lon":20.0176,"rating":3.33,"reviews":3,"wait":52,"signal":null,"lastUsed":"2025-07-11","comments":[{"text":"I had a hard time there\r\nMost of the people stay in nowy targ","date":"2025-07-11","rating":2},{"text":"There's a bus stop. 2 girls got a ride to Krakow in less than five minutes.","date":"2012-05-12","rating":4}],"destLat":49.6462,"destLon":19.9085},{"id":600,"lat":50.4614,"lon":18.2713,"rating":3.33,"reviews":3,"wait":50,"signal":"sign","lastUsed":"2024-04-23","comments":[{"text":"Got a ride to Cieszyn pretty fast, nobody bothered me although all the gates and police are scary, was standing begind the gates, there is good parking spot there","date":"2024-04-23","rating":4},{"text":"Just before highway toll zone, direction: A4 highway (Wroclaw or Katowice)","date":"2013-08-08","rating":3}],"destLat":50.0827,"destLon":19.7907},{"id":704,"lat":49.6346,"lon":21.7866,"rating":3.33,"reviews":3,"wait":13,"signal":null,"lastUsed":"2023-07-09","comments":[{"text":"hitch right after the roundabout. more likely than not, you'll only get short rides.","date":"2012-09-27","rating":3}],"destLat":49.5537,"destLon":21.6829},{"id":636,"lat":49.8316,"lon":19.0435,"rating":3.25,"reviews":4,"wait":16,"signal":null,"lastUsed":"2023-09-24","comments":[{"text":"We (2 boys 17 yo) asked people in cars, around the gas station for 15 minutes untill someone told us that he can take us to Katowice - around 1h drive","date":"2023-09-24","rating":4},{"text":"There's a parking nearby the train station and a gas station about 50m to the north. There's also a bus station nearby gas station so you can wave your finger around as cars do not go very fast here, but I think that the best option is asking people on the gas station.","date":"2012-07-17","rating":3},{"text":"It took us (2 boys) around 10mins to catch a ride towards Czechowice-Dziedzice (10km northwards).","date":"2012-07-17","rating":3},{"text":"Towards Tychy, Katowice.","date":"2011-12-07","rating":3}],"destLat":50.2351,"destLon":19.0549},{"id":658,"lat":52.3044,"lon":21.0899,"rating":3.25,"reviews":4,"wait":54,"signal":null,"lastUsed":"2023-08-24","comments":[{"text":"I waited for an hour and half. The majority of cars are local traffic. I then moved to the bus stop directly on the ramp. Got a lift to Wyszków in 20 minutes.","date":"2023-08-24","rating":1},{"text":"First car i asked took me! Nice spot ;) I asked for Wyrzkow!","date":"2013-10-13","rating":4},{"text":"Better than the further spot, because the ticket bus is cheaper, and there is gazstations. Not easy, lot of locals people, as always, but still very possible statistically, because thousands of car per hour =D","date":"2013-02-03","rating":4},{"text":"Quite a lot of traffic, a gas station, some possibilities for cars to stop, could be a bit better though and easy to access by bus going to petia CH Marki / M1 Marki","date":null,"rating":4}],"destLat":52.3044,"destLon":21.0899},{"id":114,"lat":52.404,"lon":17.0565,"rating":3.2,"reviews":5,"wait":17,"signal":"sign","lastUsed":"2025-09-11","comments":[{"text":"Waited for over an hour, did not get a ride. Decided to move forward by bus.","date":"2025-09-11","rating":2},{"text":"I wouldn't recommend it. We used it to get to Warsaw and were really lucky but I don't think that you have a good chance getting a ride. Most drivers are only driving a really short distance. Our driver was on his way home after work (distance about 1km) but he was so kind to take us all the way to a big gas station at the highway in Gozdowo! He only went there for us so we can get to Warsaw.","date":"2025-08-09","rating":2},{"text":"1h of wait but worth it as the guy literaly drop me central warsaw , he wass going to a meeting , nice mercedes car !","date":"2016-03-23","rating":4},{"text":"I waited there 11 minutes and got a direct lift to Warsaw. As this is a bus stop, there is also a shelter in case of rain.","date":"2014-09-23","rating":4},{"text":"Bus stop \"Skansen\" in Swarzędz just at the side of the busy 92 road leading to Września and further to Warsaw. Many people heading for Warsaw use this road as it leads straight from the centre and is toll-free. There is a frequent 401 bus going there from Śródka Dworzec in Poznań, costing just 2.60 PLN (9.2014). The spot is just after street lights, so cars regularly stop there and the speed limit is 50 km/h so they have enough time to react and stop.","date":"2014-09-23","rating":4}],"destLat":52.2948,"destLon":17.6516},{"id":113,"lat":52.4103,"lon":17.0082,"rating":3.17,"reviews":6,"wait":110,"signal":"ask-sign","lastUsed":"2025-09-11","comments":[{"text":"Mostly local traffic. The station is next to lidl and most people go there. Waited for an hour, asked drivers at the gas station, then gave up and took a bus further.","date":"2025-09-11","rating":2},{"text":"really un friendly bad drivers. mostly ignore you. some of them are friendly but not kind.\r\nwaited 3 hrs. and finally ONE car stopped. it was our direction. but while asking few second other old man cars come n complain about his stupid life n suddenly our main car has left. \r\nthis is so rediculas experience in my 20yrs travelling. \r\nmany ppl r grumpy n keep ignore you.\r\n\r\npretty sad area.\r\n\r\n*did aaking around. thumps up. etc.\r\n\r\n3 drivers give us middle fingures while passing. terrible country","date":"2024-08-29","rating":1},{"text":"If you fail to thumb a ride from a road, you can ask drivers on gas station. \nIf you are heading to Gniezno, Toruń, Bydgoszcz direction, it's better to hike on Gnieźnieńska street, 2 km north from here.","date":"2015-10-31","rating":4},{"text":"Good place, but cars are going very fast here, so sometimes you have to wait quite long. Advantage- it's easy to reach this place.","date":"2013-07-30","rating":4},{"text":"I was travelling very often from there. The spot is really good, enough space to stop for a car. Someitmes it took me 30 min to get a lift sometimes longer.","date":"2011-04-22","rating":4}],"destLat":52.4033,"destLon":17.0743}]}