{"country":"SA","name":"SA","totalSpots":19,"totalReviews":19,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":1,"lat":24.134,"lon":51.5703,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-06-24","comments":[{"text":"So, unfortunately truck driver from previous spot was indeed driving to Dubai, but the politics of his company did allow only driver in the cabin while crossing, so he had to drop me off just before the border. And although crossing in feet is not allowed, I decided to walk all the way to the checkpoint, and I was lucky!\r\n\r\nI came through 3 police checkpoints, telling then my hitchhiking stories, because they were surprised I came with a huge backpack by feet. Just be funny and play it cool. The","date":"2025-06-24","rating":5}],"destLat":25.3157,"destLon":55.4015},{"id":2,"lat":24.3829,"lon":47.0846,"rating":5,"reviews":1,"wait":5,"signal":"ask","lastUsed":"2025-06-23","comments":[{"text":"Lol, that was random.\r\n\r\nIt's a crowded gas station somewhere there, the first truck driver from Syria I asked was going all the way to Dubai. Prepare for your ~10 hours drive. So lucky. But still, be careful about the heat","date":"2025-06-23","rating":5}],"destLat":25.2369,"destLon":55.3195},{"id":4,"lat":24.5722,"lon":46.828,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"Cars go fast, but there are some space for cars to pull over for the whole length of the road. Managed to get a ride to the next highway cross. Yuppie.\r\n\r\nBut it's very very hot. Make sure you have enough water with you, sun cream protection and some head cover.","date":"2025-06-23","rating":5}],"destLat":24.505,"destLon":46.9321},{"id":5,"lat":24.6072,"lon":46.774,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"Asked around at the gas station and got a young nice guy drive me a little bit further.","date":"2025-06-23","rating":5}],"destLat":24.5736,"destLon":46.8259},{"id":11,"lat":27.665,"lon":41.768,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-22","comments":[{"text":"Hitchhiking in Saudi on the highway is not a problem, did it in front of the police and no one cared.\r\n\r\nHere mostly local traffic, but they can give you a short ride to next highway cross, after which there are mostly vehicles that go to Riyadh. All these crosses have bridges under which you can hide from the heat(it was 45 degrees when I was hitchhiking)\r\n\r\nNice Arab man stopped by me, gave me money, offered food & place to sleep at his house(normal in Saudi Arabia, 90% of drivers are this hos","date":"2025-06-22","rating":5}],"destLat":27.6222,"destLon":41.8344},{"id":12,"lat":27.7942,"lon":41.6043,"rating":5,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"Omg, I can't even say how lucky I am. I was hitchhiking there at night with no hope for a ride and I was late to a rally event in Hail, when a legend stopped by me!\r\n\r\nAn Indian traveler guy, my best friend now stopped in the middle of the night to a complete stranger, I told him the situation and he changed his route to drive me to a rally and go fast so I get on time! I couldn't believe my luck!\r\n\r\nThis guy just saved me. I got to a rally on time and had a great evening watching show and seein","date":"2025-06-21","rating":5}],"destLat":27.554,"destLon":41.6499},{"id":14,"lat":29.8125,"lon":39.6492,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"Good spot near gas station, but worked for me only for a short ride to a safer place under the bridge, which protects you from extreme sun.","date":"2025-06-21","rating":5}],"destLat":29.6372,"destLon":39.8451},{"id":15,"lat":31.0009,"lon":37.6789,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"I'm not kidding. I got so much food offer that I started to refuse food because I am so full. Another driver invited me for a meal at local diner, couldn't eat anymore so got some food for later. Hitchhiking is easy","date":"2025-06-21","rating":5}],"destLat":29.9507,"destLon":40.2089},{"id":16,"lat":31.2589,"lon":37.4259,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"Prepare that in Saudi Arabia you will never starve and have a lot of food. There are not many tourists in Saudi and locals are very curious and want to learn more from you. Expect a lot of heartful discussions(through translator) and a lot of food offers every step. Hitching a ride is easier than anywhere","date":"2025-06-21","rating":5}],"destLat":31.0072,"destLon":37.6749},{"id":17,"lat":31.3647,"lon":37.3143,"rating":5,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"Just go along the highway with your thumb up and someone will stop by you in a few minutes","date":"2025-06-21","rating":5}],"destLat":31.2656,"destLon":37.4176},{"id":18,"lat":31.4459,"lon":37.1553,"rating":5,"reviews":1,"wait":10,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"Saudi Arabia is so welcoming. Here is a gas station but you can hitchhike on the highway directly. Drivers stop anywhere unlike in Europe. Everyone are interested in travelers and will try to help you in any way possible, you won't wait long for someone to stop for you. \r\n\r\nAlso, here is Mosque where you can sleep. If there's no one, don't freak out just go there and sleep on the floor, it's ok and acceptable. When arab man asked me what I was doing there, I told him that I am a traveler from Po","date":"2025-06-21","rating":5}],"destLat":31.3643,"destLon":37.3149},{"id":3,"lat":24.4994,"lon":46.9388,"rating":4,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"It's getting very very hot. Had to hide in the tunnels under the highway to cool down. It's ok spot on the highway. Got a very nice man driving me to a crowded gas station where truck drivers go to Dubai from. But it was very hot, I mean it.","date":"2025-06-23","rating":4}],"destLat":24.3799,"destLon":47.0908},{"id":9,"lat":24.5937,"lon":46.5472,"rating":4,"reviews":1,"wait":5,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"Was hitchhiking back to Riyadh.\r\n\r\nA lot of traffic. But be careful about people asking for money or hitchhiking a taxi. I hitchhiked a taxi by accident, but then told that I am a stupid tourist and was confused, so the driver didn't charge me anything thankfully","date":"2025-06-23","rating":4}],"destLat":24.6953,"destLon":46.6336},{"id":10,"lat":27.6139,"lon":41.8473,"rating":4,"reviews":1,"wait":100,"signal":"thumb","lastUsed":"2025-06-22","comments":[{"text":"So, good and bad news, I start with a bad one.\r\n\r\nThis road mostly has truck drivers, but the problem with them is that, they are extra paranoid about backpacks and that you may have something illegal with you, I had few truck drivers stop for me, but when they saw my backpack, they were just saying \"no\" and driving away.\r\n\r\nSo I would suggest to focus on hitchhiking cars, even if it means to step on the highway directly so they can see you better.\r\n\r\nWaited for almost 2 hours when it was gettin","date":"2025-06-22","rating":4}],"destLat":24.7007,"destLon":46.6905},{"id":6,"lat":24.6529,"lon":46.6881,"rating":3,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"Its the place where drivers enter highway. Pathetic, but a nice taxi driver stopped by me and it was too hot and I was to desperate, so I negotiated that he drives me to the gas station for 20 Saudi Arabia rupi, so I can hitchhike in Dubai direction.","date":"2025-06-23","rating":3}],"destLat":24.6071,"destLon":46.7739},{"id":13,"lat":29.6375,"lon":39.8442,"rating":3,"reviews":1,"wait":100,"signal":"thumb","lastUsed":"2025-06-21","comments":[{"text":"help pls. spot in direction of Hail. The only good about it is that there's a bridge where you can hide from sun and where some truck drivers hide to cool their vehicles.\r\n\r\nMost of the cars are local traffic, delivering hay to local farms. Truck drivers go to Hail, but all of them are afraid to pick you up, because they think:\r\na) You're illegally in country\r\nb) You have drugs with you\r\nc) That you don't speak Arabic\r\n\r\nI waited almost two hours for at least someone to stop and then had to prov","date":"2025-06-21","rating":3}],"destLat":27.7932,"destLon":41.6057},{"id":19,"lat":27.5139,"lon":41.5971,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2012-03-30","comments":[],"destLat":null,"destLon":null},{"id":7,"lat":24.6753,"lon":46.6535,"rating":1,"reviews":1,"wait":45,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"No. Just no.\r\n\r\nThis highway has no place to stop and cars go faster than 120 km/h, no chance. Further down the road not better, at some point police officers told me to disappear from the highway to avoid problems","date":"2025-06-23","rating":1}],"destLat":null,"destLon":null},{"id":8,"lat":24.6993,"lon":46.6514,"rating":1,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-06-23","comments":[{"text":"No, just don't. Hitchhiking inside Riyadh is nearly impossible, anomaly amount of taxi drivers that stop by you even if you are not hitchhiking and just look like foreigner.","date":"2025-06-23","rating":1}],"destLat":null,"destLon":null}]}