{"country":"TN","name":"Tunisie","totalSpots":5,"totalReviews":10,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":5,"lat":37.2563,"lon":9.9021,"rating":5,"reviews":1,"wait":1,"signal":null,"lastUsed":"2024-03-18","comments":[{"text":"First time in 15.000km hitchhiked i didn't even stop myself to drop my backpack and raise my thumb. A young guy in a small working van saw me in a sunny ramadan morning, picked me up and even took me on a walk around El Alia city on his way, prayer included.","date":"2024-03-18","rating":5}],"destLat":36.7883,"destLon":10.1814},{"id":6,"lat":36.7729,"lon":10.0719,"rating":5,"reviews":1,"wait":20,"signal":null,"lastUsed":"2023-09-30","comments":[{"text":"If you wanna go to the northwest like (beja,jandouba,kef) i advice u to stop and try from here very easy spot all cars use this highway A3 to go to these states \r\ngood luck :)","date":"2023-09-30","rating":5}],"destLat":36.7729,"destLon":10.0719},{"id":1,"lat":33.8036,"lon":8.788,"rating":4,"reviews":1,"wait":20,"signal":"thumb","lastUsed":"2025-09-22","comments":[{"text":"I was hitchiking in Soul Lahad and locals advices me to take a taxi to this spot (6 TND). There was a hotchiling queue with other 4 people. All of them were militaries so I think cars felt obliged to stop ahaha. 3 people went in the first car and I went in the following car with another guy.\r\n\r\nThis place is in the middle of the desert with no way to get shadow from the sun, so a hat, sunscreen and a lot of water is highly advised.\r\n\r\nThis was on a Monday in September.","date":"2025-09-22","rating":4}],"destLat":33.9572,"destLon":8.1863},{"id":3,"lat":33.8839,"lon":10.0868,"rating":4,"reviews":1,"wait":120,"signal":null,"lastUsed":"2024-03-21","comments":[{"text":"cars are always available and they are friendly","date":"2024-03-21","rating":4}],"destLat":34.812,"destLon":10.6945},{"id":4,"lat":36.9508,"lon":8.7673,"rating":4,"reviews":1,"wait":10,"signal":null,"lastUsed":"2024-03-18","comments":[{"text":"Easy to start here, but you should find a direct ride to your destination, especially to Bizerte. Locals recommended to start n the morning. 2 guys took me to Ras Rajel where i waited and gave up till a minibus took me to Nefza. There i waited 1.5 hour, gave up and took another minibus to Bizerte.\r\nBesides, this spot is just at the city's hostel gate \"Maison de Jeunes Tabarka\". 10 tnd for locals, 12 for algerians, 18 for other souls.\r\nI came here the day before with a 2 rides from El Kala, Alger","date":"2024-03-18","rating":4}],"destLat":36.9521,"destLon":8.8743}]}