{"country":"ZA","name":"Afrique du Sud","totalSpots":48,"totalReviews":61,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":41,"lat":-25.7038,"lon":27.2537,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"I took a local bus from Pretoria to get to Rustenberg and after i tried several spots there i came here and it was fairly easy. Passing traffic will get gas here. Good spot","date":"2013-09-19","rating":5}],"destLat":null,"destLon":null},{"id":44,"lat":-33.6287,"lon":19.4321,"rating":5,"reviews":2,"wait":5,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"the location that i set on the map might be not really exact","date":"2013-09-19","rating":5},{"text":"A big Ultra City station with a lot of traffic stopping here. Try to get to this place if you want to head up to Jo´burg","date":"2013-09-19","rating":5}],"destLat":null,"destLon":null},{"id":47,"lat":-33.8312,"lon":23.904,"rating":5,"reviews":2,"wait":30,"signal":null,"lastUsed":"2013-05-12","comments":[{"text":"got a ride from just by the toll plaza within half an hour to PE","date":"2013-05-12","rating":5}],"destLat":null,"destLon":null},{"id":7,"lat":-25.4667,"lon":30.9564,"rating":5,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-03-23","comments":[{"text":"Iu, kiu liveris iun al la Citybug Shuttle Service, veturis min al la elirejo de la urbo.","date":"2025-03-23","rating":5}],"destLat":-25.4722,"destLon":30.9941},{"id":21,"lat":-30.1669,"lon":30.8179,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Very good. A friend dropped me by there. Don't know how to get there from durban","date":"2025-03-11","rating":5}],"destLat":-30.7487,"destLon":30.4337},{"id":29,"lat":-32.5785,"lon":27.9552,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"2 viroj irantaj ŝarĝi vinberojn proksime de Worcester prenis min de ĉi tie. Mi uzis plakedon al P.E aŭ la eksa Port Elizabeth City, nun Gqeberha. Komence ili demandis min kiom mi pagos ĝis P.E, kaj mi diris al ili, ke mi ne povas, sed diris al ili, ke mi iros al Kab-urbo. Tiam ili diris, ankaŭ ni. Ĉu estas problemo se vi iras eksteren sub la Tarpo, ĉar pluvos dum la nokto. Mi diris Ne. Ni iru. Kaj blau.","date":"2025-03-11","rating":5}],"destLat":-33.8372,"destLon":20.0361},{"id":33,"lat":-33.6345,"lon":19.3563,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-03-11","comments":[{"text":"Post 5 minutoj iu ĉesis peti monon. Kiel kutime, plej multaj homoj atendas, ke vi pagu. Nur nei ĝin ĝis iu, kiu ne akceptos subaĉetaĵojn. Amiko helpis min el Worcester veni ĉi tien.","date":"2025-03-11","rating":5}],"destLat":-33.9071,"destLon":18.4175},{"id":38,"lat":-34.1083,"lon":18.8612,"rating":4,"reviews":2,"wait":23,"signal":null,"lastUsed":"2014-09-23","comments":[{"text":"By a service station and just after the lights. For hitching along the N2 or the Garden Route.\n\n Take the train to Strand, but get off the 2nd to last stop (Van Der Stel). You don't necessarily have to use this spot, as there's a few interesections with lights and shoulder to pull over onto. Locals will be all over them.","date":"2014-09-23","rating":4}],"destLat":null,"destLon":null},{"id":39,"lat":-24.0188,"lon":31.6425,"rating":4,"reviews":2,"wait":null,"signal":null,"lastUsed":"2014-04-20","comments":[{"text":"Within the park, most of the residents are pretty willing to help, racism is still an issue and my white driver did keep mentioning that I (also white) should be careful who I got in a car with.","date":"2014-04-20","rating":4}],"destLat":null,"destLon":null},{"id":48,"lat":-32.9782,"lon":17.9523,"rating":4,"reviews":2,"wait":38,"signal":null,"lastUsed":"2013-05-12","comments":[{"text":"pretty solid, people take pity on you around lunchtime","date":"2013-05-12","rating":4}],"destLat":null,"destLon":null},{"id":14,"lat":-33.1437,"lon":18.682,"rating":4,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Ĝi estas bona loko al la sekva urbo Piketberg. Mi provis ĝuste antaŭ kie la aŭtoj komencas eniri en Moorreesburg, kaj mia amiko ĝuste ĉe la turniĝo de kiu venas de la urbo.","date":"2025-03-22","rating":4}],"destLat":-32.9076,"destLon":18.7635},{"id":16,"lat":-33.673,"lon":18.5543,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Por atingi ĉi tiun benzinstacion vi devas eniri 2 minni-taksiojn, unu el la urbocentro proksime de la longdistanca buso, al Dunoon, kie oni diras, ke ili manĝas blankulojn ahehaeh, kaj de tie alian al Atlantis aŭ Malmesbury. Ĉiu estis proksimume 25 Rants. De ĉi tiu benzinstacio mi supozas, ke la plej bona estus provi rekte al Namibio, sed ĉi tio eble prenos tro multe, tamen eble indos la atendon, ĉar ĉi tiu vojo al Namibio estas kiel infero... aŭ al la sekva malpli malfacila punkto por petveturi","date":"2025-03-22","rating":4}],"destLat":-33.4409,"destLon":18.7195},{"id":17,"lat":-26.2127,"lon":30.9825,"rating":4,"reviews":1,"wait":180,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Mia ŝoko estis, ke taksiaj asocio-membroj estas sufiĉe perfortaj. Multaj el ili menecis min, eĉ montrante pafilajn signojn per siaj fingroj al mi. Multaj homoj petis min iri plu por ke ili ne vidu min, eĉ la kamionistoj diris al mi, ke ili povus esti mortpafitaj de ili. Post tio mi ekmarŝis kaj viro haltis al mi ĝuste antaŭ la lasta taksio haltita ĉe la vojo. Ili mancis la viron. Sed ĉi tiu zambia viro ne estis ŝerco. Li diris al ili: Mi volas preni la knabon, mi faros. Ni iru.","date":"2025-03-11","rating":4}],"destLat":-25.8103,"destLon":29.8936},{"id":18,"lat":-25.8101,"lon":29.8929,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Post esti faligita ĉi tien de viro, kiu alfrontis la minacon de la taksia asocio por preni min, 3 virinoj kun bela aŭto kondukis min al Centurium-stacio. Amuza fakto, la 3 estis de malsamaj etnoj kaj ŝatas vojaĝi la mondon kune. Mi supozas, ke unu estis pafita, alia la zulua, ne memoru la trian.","date":"2025-03-11","rating":4}],"destLat":-25.852,"destLon":28.1895},{"id":22,"lat":-30.7562,"lon":30.4319,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Mi atendis 30 minutojn en la unua ilo, sed iu invitis min petveturi pli proksime al la sekva venanta el la alia urbo kaj tio estis la plej bona elekto.","date":"2025-03-11","rating":4}],"destLat":-31.0786,"destLon":30.1865},{"id":26,"lat":-31.595,"lon":29.5206,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Ree minacite de la taksiistoj tuj post la ponto kaj marŝis iom antaŭen post la rapiddrompilo por ne plu suferi ĉikanadon aŭ vortajn agresojn, taksiisto haltis kaj diris: Eniru! Pensante, ke li klopodas forrabi min aŭ ion ajn, mi krias: mi ne povas pagi! Tiam li Krias reen. Mi veturigas vin, eniru. Mi eniris. Ironie.","date":"2025-03-11","rating":4}],"destLat":-31.5928,"destLon":28.7819},{"id":30,"lat":-33.8363,"lon":20.0428,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Viro el Zambio kondukis min de ĉi tie al la sekva Urbo. Mi estis kun Worcester-plakedo.","date":"2025-03-11","rating":4}],"destLat":-33.805,"destLon":19.8738},{"id":36,"lat":-33.992,"lon":22.5199,"rating":3,"reviews":2,"wait":5,"signal":null,"lastUsed":"2014-09-30","comments":[{"text":"Careful of some people who pick you up, they might just end up taking you to the minibus station and refuse to take you back here! Must be working for them...","date":"2014-09-30","rating":3}],"destLat":null,"destLon":null},{"id":37,"lat":-34.142,"lon":22.0999,"rating":3,"reviews":2,"wait":110,"signal":null,"lastUsed":"2014-09-30","comments":[{"text":"It's a bit of a walk from the centre. Lots of room to stop and a steady amount of cars. Not many people pull over though, and those that did asked for money.\n\nIf you're willing to pay, R20 seemed to be the normal amount people were paying to George. I waited almost 2 hours for a free one.","date":"2014-09-30","rating":3}],"destLat":null,"destLon":null},{"id":40,"lat":-25.5448,"lon":26.0829,"rating":3,"reviews":2,"wait":30,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"I was asking at the local gasstaions and i was lucky to find somebody after a while.","date":"2013-09-19","rating":3}],"destLat":null,"destLon":null},{"id":42,"lat":-28.6918,"lon":24.7794,"rating":3,"reviews":2,"wait":10,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"Perfect hitch-hiking spot to get out of Kimberly in any direction. A big ultra city gas station that is used by most of the passing traffic.","date":"2013-09-19","rating":3}],"destLat":null,"destLon":null},{"id":43,"lat":-31.886,"lon":23.0828,"rating":3,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"Here is the big Three sisters Ultra City. I guess it must be a good spot to switch on the different highways","date":"2013-09-19","rating":3}],"destLat":null,"destLon":null},{"id":2,"lat":-24.6573,"lon":27.3799,"rating":3,"reviews":1,"wait":15,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"Mia tanzanina amiko ĵus venis ĉi tien post mi kaj ni daŭre iris kune.","date":"2025-03-23","rating":3}],"destLat":-24.888,"destLon":27.5303},{"id":3,"lat":-24.6023,"lon":27.3873,"rating":3,"reviews":1,"wait":40,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"kaj paro da afrikaj blankuloj haltis al mi kaj prenis min malmulte antaŭen (dirante kiom danĝera Johanesburgo estus, laŭ ili, pli danĝera ol Rio-de-Ĵanejro, sed post pasigi 2 monatojn en Johanesburgo mi estas tute certa, ke ĝi ne estas eĉ 1/10 tiom danĝera kiel rio, kiu eĉ ne estas proksima al esti la plej danĝera urbo de Brazilo...)\r\nIli diris al mi, ke mi devus iri per britoj.","date":"2025-03-23","rating":3}],"destLat":-24.6579,"destLon":27.3799},{"id":4,"lat":-24.5921,"lon":27.398,"rating":3,"reviews":1,"wait":60,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"De ĉi tie tio estis iom konfuza. Mia tanzania amiko ne ĝuste decidis ĉu li prenos minitaksion aŭ daŭrigos petveturadon. Li finfine pagis al mi minitaksion al unu km antaŭe, kie li provis negoci, sed mi devis klarigi, ke mi ne povas pagi. Do ni apartigis...","date":"2025-03-23","rating":3}],"destLat":-24.6017,"destLon":27.3879},{"id":5,"lat":-23.6879,"lon":27.7409,"rating":3,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"One of the most stranges rides of my life. We overpopulated the pickup truck inside. A funny man with a with diction alterations went all way long over my lap.","date":"2025-03-23","rating":3}],"destLat":-24.5914,"destLon":27.3983},{"id":9,"lat":-29.2553,"lon":17.7419,"rating":3,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Ni finfine akceptis pagi 40 Rands al maljunulo San en malgranda kamiono. Bedaŭrinde li estis pastro kun tre forta voĉo. Sed tamen bonkora koro. Ĉio en la afrikansa.","date":"2025-03-22","rating":3}],"destLat":-28.7704,"destLon":17.6259},{"id":10,"lat":-29.4704,"lon":17.8374,"rating":3,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"bona por la sekva urbo.","date":"2025-03-22","rating":3}],"destLat":-29.2553,"destLon":17.7419},{"id":12,"lat":-32.9077,"lon":18.7646,"rating":3,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Neortodoksa metodaro por severaj situacioj, Tuj post la trafikcirklo estas malpermesite halti, sed iuj eble ankoraŭ haltos. Antaŭ la trafikcirklo kaj interne ĝi ankaŭ estas opcio. Neniu konkuradas, ĉiuj pasas malrapide. Alia ebleco estas peti kamionojn ene de la benzinstacio, ne en la parko ĉar ĝi estas malpermesita. Sed proksime aŭ ĉe la ekstero de kamionoj. Ili ankaŭ povas helpi.\r\n\r\nNi prenis aŭton ĉi tie, kiuj iris al Upington. Kaj eĉ de la komenco li diris, ke li ne petos de ni monon. Sciant","date":"2025-03-22","rating":3}],"destLat":-29.6621,"destLon":17.8917},{"id":15,"lat":-33.4408,"lon":18.7196,"rating":3,"reviews":1,"wait":60,"signal":null,"lastUsed":"2025-03-22","comments":[{"text":"La afero pri petveturado de mallongaj distancoj en Sud-Afriko estas, ke en ĉiu loko alvenos homoj la tutan tempon por petveturi, sed ili pagas kaj ankoraŭ estas multaj rasaj tensio, blankuloj preskaŭ neniam ĉesas kaj nigruloj kutime nur haltas al nigruloj kaj evitas eĉ paroli kun nenigrulaj eksterlandanoj aŭ blankuloj migrantoj... Do krom la severeco de petveturado, vi ankoraŭ bezonos konkurenci per strategio en sudafriko por si mem. spertaj lokuloj, kiuj plejparte ne helpos vin ĉar ili ankaŭ vo","date":"2025-03-22","rating":3}],"destLat":-33.1437,"destLon":18.682},{"id":19,"lat":-26.2104,"lon":28.1075,"rating":3,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-03-11","comments":[],"destLat":-26.3178,"destLon":28.1882},{"id":20,"lat":-26.3231,"lon":28.1955,"rating":3,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Mi alvenis ĉi tien de alia veturo de ene de la urbo. Granda kamiono haltis al mi. Maljuna blanka fiera afrikaans... Almenaŭ li ŝatis recikladon","date":"2025-03-11","rating":3}],"destLat":-29.906,"destLon":30.9842},{"id":23,"lat":-30.8662,"lon":29.8476,"rating":3,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"La problemo estis la taksiistoj. Tio estis lerneja tempo, do multaj taksioj, kiam ĉi tiu viro haltis al mi, ili devigis lin preni monon de mi. Mi diris al ĉiuj, ke mi ne havas monon kaj demandis, kio estas la problemo. Ili ne volis batali antaŭ la infanoj kaj lasis min iri, la viro ne pagis ilin.","date":"2025-03-11","rating":3}],"destLat":-31.1509,"destLon":29.4602},{"id":32,"lat":-33.8049,"lon":19.8661,"rating":3,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Mi translokiĝas ĉi tien post 3 horoj provante en alia loko, proksime de la ponto, sub minacoj de la asocio de taksiistoj kaj konkurante kun aliaj 10 pagantaj migrantoj.","date":"2025-03-11","rating":3}],"destLat":-33.6411,"destLon":19.451},{"id":34,"lat":-33.9665,"lon":23.8908,"rating":3,"reviews":1,"wait":90,"signal":"thumb","lastUsed":"2024-12-13","comments":[{"text":"Interesting spot for hitchhiking. As a white young guy I waited around 90 minutes. Some people from the townships were hitching as well and got rides quicker. Don't forget to visit the township of storms river. White people will say it is dangerous but all the people were lovely. Don't be afraid!!","date":"2024-12-13","rating":3}],"destLat":-33.9807,"destLon":25.5552},{"id":35,"lat":-29.1137,"lon":26.1826,"rating":3,"reviews":1,"wait":null,"signal":null,"lastUsed":"2016-02-03","comments":[],"destLat":null,"destLon":null},{"id":45,"lat":-33.7421,"lon":19.0179,"rating":2,"reviews":2,"wait":120,"signal":null,"lastUsed":"2013-09-19","comments":[{"text":"I planned to ask people at the toll station but i was not allowed to. so i had to wait next to the highway and it took me almost two hours in the early morning till i found somebody","date":"2013-09-19","rating":2}],"destLat":null,"destLon":null},{"id":46,"lat":-28.6197,"lon":29.8359,"rating":2,"reviews":2,"wait":null,"signal":null,"lastUsed":"2013-05-12","comments":[{"text":"very slow going- gauteng number plates will not stop, KZN generally want a very generous taxi-fare- as you get closer to the Drakensberg it gets easier","date":"2013-05-12","rating":2}],"destLat":null,"destLon":null},{"id":1,"lat":-24.8879,"lon":27.53,"rating":2,"reviews":1,"wait":30,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"Multaj homoj provas en ĉi tiu loko. Malfacile akiri unu sen pagi. TRE TRE RAPIDA VOJO.\r\nSen dubo, havi grandan ŝildon kun la loko, kiun vi iros, distingos vin kaj pliigos viajn ŝancojn ricevi senpagan veturon.","date":"2025-03-23","rating":2}],"destLat":-26.1102,"destLon":28.1477},{"id":6,"lat":-23.0084,"lon":27.947,"rating":2,"reviews":1,"wait":120,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"Tio estis malfacila, tre malfacila. mia unua fojo en unu el la plej malfacilaj landoj por petveturi inter la 35 kiujn mi ĝis nun konas. Bonŝance mi renkontis tanzanon, kiu perdis sian buson ĉar ili ne akceptis lin reen post multaj fojoj kaj li helpis min de la landlimo ĝis Johanesburgo kaj eĉ gastigis min la unuan nokton. Kaj mi povus paroli iom da swahili por konekti kun li.","date":"2025-03-23","rating":2}],"destLat":-23.6877,"destLon":27.7409},{"id":8,"lat":-25.4714,"lon":30.997,"rating":2,"reviews":1,"wait":180,"signal":"thumb","lastUsed":"2025-03-23","comments":[{"text":"Post horoj suferantaj sub la suno, de la eliro de ĉi tiu urbo kio mi ne bezonis eniri (ĉar mi hastis veni al Moçambique por la Poliglota Konferenco, kaj prenis privatan transporton ekde la flughaveno veninta de Eburabordo partoperninta de la Internacia Rainbow Gathering, ĝis ĉi tiu punkto por 600 randoj TT)... Mi povis nur petveturi ĉar mi petis helpon de lokano, tio estis mia dua fojo en Sudafriko kaj nur mia dua tago de veturoj. Do mi ankoraŭ ne povis kompreni kiel la aferoj funkcias ĉirkaŭ Su","date":"2025-03-23","rating":2}],"destLat":-25.447,"destLon":31.9458},{"id":11,"lat":-29.6445,"lon":17.8836,"rating":2,"reviews":1,"wait":180,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Post vekiĝo en la stacidomo. Ni atendis en ĉagreno ke la apoteko malfermiĝu por ricevi iom da astmomedikamento kaj poste translokiĝis. Marŝis 2 km ĝis la lasta elirejo de la urbo kaj rekomencis. Sama situacio, dekduo da homoj provas. La plej bona afero estas skribi plakedon al Steinkopf. Tiam post kelkaj minutoj iu kondukis nin al la enirejo por kuglokapti. Ĉi tie jam estas 100% dezerto, tute ne ombro. Prenu multe da akvo kaj Ombrelon, La grandaj plakoj povas havigi iom da ombro.","date":"2025-03-22","rating":2}],"destLat":-29.4704,"destLon":17.8374},{"id":25,"lat":-31.3781,"lon":29.5756,"rating":2,"reviews":1,"wait":120,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Iom malfacila kaj konfuza. Post iom da tempo kun la Plakedo Mthatha iu donis al mi Plakedon skribitan XA. Mi ne komprenis Kaj konfirmis por certigi, ke ĉi tio ne estis krimbanda signo kontraŭ mi aŭ io ajn... Ĝi estas vere Mthata, sed laŭ loka maniero, do tio povas esti bona kaj malbona, Ĉar se vi estas rigardata kiel tre \"loka\" homo, plej multaj homoj atendas ke vi pagu. Do, mi elmontris ambaŭ plakojn kaj post 2 horoj iu kondukis min al la Ponto en Pt. Sankta Johano","date":"2025-03-11","rating":2}],"destLat":-31.5964,"destLon":29.5258},{"id":13,"lat":-32.9036,"lon":18.7676,"rating":1,"reviews":1,"wait":150,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Tre malfacile preni kamionojn irantajn malproksimen. Se vi iros al la sekvaj urboj, estas bone. Sed al Nambio ĝi estas infero, ĉar vi havas dekojn da homoj provanta kaj eĉ malfacile kamiono haltos al vi ili kuros tien kaj lasos neniun ŝancon al vi. Aŭtoj irantaj malproksimen ankaŭ povas halti al vi, sed la plej multaj el ili petos monon kaj la konkurado estas tro severa. Aŭ vi restas multe pli plu malproksime aŭ provas neortodoksan aliron. Antaŭ la ĉirkaŭvojo kaj ene de ĝi. Neniu konkurado, ĉiuj","date":"2025-03-22","rating":1}],"destLat":-32.9037,"destLon":18.7675},{"id":24,"lat":-31.151,"lon":29.4602,"rating":1,"reviews":1,"wait":null,"signal":"thumb","lastUsed":"2025-03-11","comments":[{"text":"That was an ilega movement, the guy was giving me a ride to a bit after flagstaff knew someone passing by in the same direction, stopped him on the road and asked him to take me. So that was more like a transfer than a hitchhiking..","date":"2025-03-11","rating":1}],"destLat":-31.3654,"destLon":29.5729},{"id":27,"lat":-31.5926,"lon":28.7781,"rating":1,"reviews":1,"wait":90,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Tre terure, Se mi scius, ke estas benzinstacio iom antaŭe, mi estus irinta. Sed kiam oni petas informojn pri lokoj por petveturi, homoj komprenas la tradiciajn lokojn, homoj pagas por migradoj. Viro haltis al mi kaj dum la vojaĝo mi diris al li, ke mi ne pagos, li serĉis pasaĝerojn. Kaj faligis min ĉe alia terura loko, kie homoj pagas por ;a veturado.","date":"2025-03-11","rating":1}],"destLat":-31.6143,"destLon":28.7346},{"id":28,"lat":-31.6143,"lon":28.7346,"rating":1,"reviews":1,"wait":120,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Juna khosa virino prenis min de ĉi tie al Orienta Londono kie ŝi iris por reunuiĝo venontan tagon. Bela aŭto. Ŝi unue petis al mi monon, mi klarigis al ŝi mian mision kaj ŝi akceptis. Dekoj da homoj provas. Ĉiuj provas per mono. Sub premo kaj observoj de la frenezaj taksiistoj. La suno bruligis min severe.","date":"2025-03-11","rating":1}],"destLat":-32.5797,"destLon":27.9549},{"id":31,"lat":-33.8047,"lon":19.8723,"rating":1,"reviews":1,"wait":180,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"ahead Terura loko. Dekoj da homoj alvenas ĉiuminute svingante monon, por ke homoj prenu ilin. Ĉiuj, kiuj haltis al mi, petis monon. Promenu antaŭen .","date":"2025-03-11","rating":1}],"destLat":-33.8047,"destLon":19.8723}]}