{"country":"ZA","name":"Afrique du Sud","totalSpots":10,"totalReviews":61,"source":"hitchwiki","license":"ODBL","attribution":"Data from Hitchwiki/Hitchmap (ODBL)","spots":[{"id":7,"lat":-25.4667,"lon":30.9564,"rating":5,"reviews":1,"wait":10,"signal":"ask","lastUsed":"2025-03-23","comments":[{"text":"Iu, kiu liveris iun al la Citybug Shuttle Service, veturis min al la elirejo de la urbo.","date":"2025-03-23","rating":5}],"destLat":-25.4722,"destLon":30.9941},{"id":21,"lat":-30.1669,"lon":30.8179,"rating":5,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Very good. A friend dropped me by there. Don't know how to get there from durban","date":"2025-03-11","rating":5}],"destLat":-30.7487,"destLon":30.4337},{"id":29,"lat":-32.5785,"lon":27.9552,"rating":5,"reviews":1,"wait":10,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"2 viroj irantaj ŝarĝi vinberojn proksime de Worcester prenis min de ĉi tie. Mi uzis plakedon al P.E aŭ la eksa Port Elizabeth City, nun Gqeberha. Komence ili demandis min kiom mi pagos ĝis P.E, kaj mi diris al ili, ke mi ne povas, sed diris al ili, ke mi iros al Kab-urbo. Tiam ili diris, ankaŭ ni. Ĉu estas problemo se vi iras eksteren sub la Tarpo, ĉar pluvos dum la nokto. Mi diris Ne. Ni iru. Kaj blau.","date":"2025-03-11","rating":5}],"destLat":-33.8372,"destLon":20.0361},{"id":33,"lat":-33.6345,"lon":19.3563,"rating":5,"reviews":1,"wait":25,"signal":null,"lastUsed":"2025-03-11","comments":[{"text":"Post 5 minutoj iu ĉesis peti monon. Kiel kutime, plej multaj homoj atendas, ke vi pagu. Nur nei ĝin ĝis iu, kiu ne akceptos subaĉetaĵojn. Amiko helpis min el Worcester veni ĉi tien.","date":"2025-03-11","rating":5}],"destLat":-33.9071,"destLon":18.4175},{"id":14,"lat":-33.1437,"lon":18.682,"rating":4,"reviews":1,"wait":30,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Ĝi estas bona loko al la sekva urbo Piketberg. Mi provis ĝuste antaŭ kie la aŭtoj komencas eniri en Moorreesburg, kaj mia amiko ĝuste ĉe la turniĝo de kiu venas de la urbo.","date":"2025-03-22","rating":4}],"destLat":-32.9076,"destLon":18.7635},{"id":16,"lat":-33.673,"lon":18.5543,"rating":4,"reviews":1,"wait":40,"signal":"sign","lastUsed":"2025-03-22","comments":[{"text":"Por atingi ĉi tiun benzinstacion vi devas eniri 2 minni-taksiojn, unu el la urbocentro proksime de la longdistanca buso, al Dunoon, kie oni diras, ke ili manĝas blankulojn ahehaeh, kaj de tie alian al Atlantis aŭ Malmesbury. Ĉiu estis proksimume 25 Rants. De ĉi tiu benzinstacio mi supozas, ke la plej bona estus provi rekte al Namibio, sed ĉi tio eble prenos tro multe, tamen eble indos la atendon, ĉar ĉi tiu vojo al Namibio estas kiel infero... aŭ al la sekva malpli malfacila punkto por petveturi","date":"2025-03-22","rating":4}],"destLat":-33.4409,"destLon":18.7195},{"id":18,"lat":-25.8101,"lon":29.8929,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Post esti faligita ĉi tien de viro, kiu alfrontis la minacon de la taksia asocio por preni min, 3 virinoj kun bela aŭto kondukis min al Centurium-stacio. Amuza fakto, la 3 estis de malsamaj etnoj kaj ŝatas vojaĝi la mondon kune. Mi supozas, ke unu estis pafita, alia la zulua, ne memoru la trian.","date":"2025-03-11","rating":4}],"destLat":-25.852,"destLon":28.1895},{"id":22,"lat":-30.7562,"lon":30.4319,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Mi atendis 30 minutojn en la unua ilo, sed iu invitis min petveturi pli proksime al la sekva venanta el la alia urbo kaj tio estis la plej bona elekto.","date":"2025-03-11","rating":4}],"destLat":-31.0786,"destLon":30.1865},{"id":26,"lat":-31.595,"lon":29.5206,"rating":4,"reviews":1,"wait":15,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Ree minacite de la taksiistoj tuj post la ponto kaj marŝis iom antaŭen post la rapiddrompilo por ne plu suferi ĉikanadon aŭ vortajn agresojn, taksiisto haltis kaj diris: Eniru! Pensante, ke li klopodas forrabi min aŭ ion ajn, mi krias: mi ne povas pagi! Tiam li Krias reen. Mi veturigas vin, eniru. Mi eniris. Ironie.","date":"2025-03-11","rating":4}],"destLat":-31.5928,"destLon":28.7819},{"id":30,"lat":-33.8363,"lon":20.0428,"rating":4,"reviews":1,"wait":25,"signal":"sign","lastUsed":"2025-03-11","comments":[{"text":"Viro el Zambio kondukis min de ĉi tie al la sekva Urbo. Mi estis kun Worcester-plakedo.","date":"2025-03-11","rating":4}],"destLat":-33.805,"destLon":19.8738}]}